Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: Division of integer values yields an integer value again. That means e.g. 10 / 100 = 0 instead of 0.1 since the result is an integer again. This does not hold for division of (only) literal values since those yield rational constants.
ru_ru: Деление целых значений дает снова целое значение. Это означает, что, например, 10 / 100 = 0 вместо 0.1, поскольку результат снова является целым числом. Это не относится к делению (только) буквенных значений, поскольку в этом случае получаются рациональные константы.

source: Remix-analyzer
ru_ru: Ремикс-анализатор

source: remix-analyzer is the library which works underneath of remix-ide Solidity Static Analysis plugin.
ru_ru: remix-analyzer - это библиотека, которая работает под плагином remix-ide Solidity Static Analysis.

source: remix-analyzer is an NPM package. It can be used as a library in a solution supporting node.js. Find more information about this type of usage in the remix-analyzer repository
ru_ru: remix-analyzer - это пакет NPM. Он может быть использован в качестве библиотеки в решении, поддерживающем node.js. Более подробную информацию об этом типе использования Вы найдете в репозитории remix-analyzer

source: Support chat
ru_ru: Чат поддержки

source: We know that blockchain ecosystem is very new and that lots of information is scattered around the web. That is why we created a community support chat where we and other users try to answer your questions if you get stuck using Remix. Please, join the Remix channel and ask the community for help.
ru_ru: Мы знаем, что блокчейн-экосистема очень новая и много информации разбросано по сети. Вот почему мы создали канал поддержки сообщества, где мы и другие пользователи пытаемся ответить на ваши вопросы, если вы столкнулись с трудностями при использовании Remix. Пожалуйста, присоединяйтесь к каналу Remix и попросите помощи у сообщества.

source: For anyone who is interested in developing a custom plugin for Remix or who wants to contribute to the codebase, we've opened another channel specially for developers working on Remix tool.
ru_ru: Для всех, кто заинтересован в разработке собственного плагина для Remix или хочет внести свой вклад в кодовую базу, мы открыли еще один канал специально для разработчиков, работающих над инструментами Remix.

source: Terminal
ru_ru: Терминал

source: Features, available in the terminal:
ru_ru: Функции, доступные в терминале:

source: It integrates a JavaScript interpreter and the web3 object. It enables the execution of the JavaScript script which interacts with the current context. (note that web3 is only available if the web provider or injected provider mode is selected).
ru_ru: Он объединяет интерпретатор JavaScript и объект web3. Он обеспечивает выполнение сценария JavaScript, который взаимодействует с текущим контекстом. (обратите внимание, что web3 доступен только в том случае, если выбран режим веб-провайдера или инжектируемого провайдера).

source: It displays important actions made while interacting with the Remix IDE (i.e. sending a new transaction).
ru_ru: Здесь отображаются важные действия, выполненные при взаимодействии с Remix IDE (например, отправка новой транзакции).

source: It displays transactions that are mined in the current context. You can choose to display all transactions or only transactions that refers to the contracts Remix knows (e.g transaction created from the Remix IDE).
ru_ru: Он отображает транзакции, которые добываются в текущем контексте. Вы можете выбрать отображение всех транзакций или только транзакций, которые относятся к контрактам, известным Remix (например, транзакция, созданная из Remix IDE).

source: It allows searching for the data and clearing the logs from the terminal.
ru_ru: Он позволяет осуществлять поиск данных и очищать журналы с терминала.

source: You can run scripts by inputting them at the bottom after the >.
ru_ru: Вы можете запускать скрипты, вводя их внизу, после >.

source: Debugging Transactions
ru_ru: Отладка транзакций

source: There are two ways to start debugging, each one corresponds to a different use case.
ru_ru: Существует два способа начать отладку, каждый из которых соответствует различным вариантам использования.

source: from the transaction log in the Terminal - use this when you want to debug a transaction.
ru_ru: из журнала транзакций в Терминале - используйте это, когда Вы хотите отладить транзакцию.

source: from the Debugger - use this if you have a transaction hash.
ru_ru: из Отладчика - используйте это, если у Вас есть хэш транзакции.

source: Initiate Debugging from the transaction log in the Terminal
ru_ru: Инициируйте отладку из журнала транзакций в Терминале

source: Let's start with a basic contract ( or replace this one by your own ) :
ru_ru: Давайте начнем с базового контракта (или замените этот контракт на свой собственный) :

source: create a blank file in the file explorer (by clicking the + icon) and give it a name.
ru_ru: Создайте пустой файл в файловом проводнике (щелкнув на значке +) и дайте ему имя.

source: copy the code below.
ru_ru: скопируйте приведенный ниже код.

source: compile the code.
ru_ru: Скомпилируйте код.

source: click the Run & Deploy icon in the icon panel.
ru_ru: Щелкните на пиктограмме Run & Deploy в панели пиктограмм.

source: For the purpose of this tutorial, we will run the JavaScript VM. This simulates a custom blockchain. You could do the same using a proper backend node.
ru_ru: Для целей данного руководства мы запустим ВМ на JavaScript. Это имитирует пользовательский блокчейн. Вы можете сделать то же самое, используя соответствующий узел бэкенда.

source: Let's deploy the contract:
ru_ru: Давайте развернем контракт:

source: Click the Deploy button
ru_ru: Нажмите кнопку Развертывание

source: You'll see the deployed instance (AKA the udapp).
ru_ru: Вы увидите развернутый экземпляр (он же udapp).

source: Then open it up (by clicking the caret).
ru_ru: Затем откройте его (щелкнув по каретке).

source: We are going to call the Donate function and will send it ether.
ru_ru: Мы собираемся вызвать функцию Donate и отправим ее в эфир.

source: To do this: in the value input box put in 2 and select Ether as the unit (and not wei like I did in the image below - well you could - it won't really change anything).
ru_ru: Для этого: в поле ввода значения поставьте 2 и выберите в качестве единицы измерения Эфир (а не Вэй, как я сделал на рисунке ниже - ну, Вы можете, но это ничего не изменит).

source: Then click the Donate button.
ru_ru: Затем нажмите кнопку Donate (Пожертвовать).

source: This will send Ether to the this function.
ru_ru: Это отправит Ether на данную функцию.

source: Because we are using the JavaScript VM, everything happens almost instantly. (If we had been using Injected Web 3, then we would have to need to approve the transaction, pay for gas and wait for the transaction to get mined.)
ru_ru: Поскольку мы используем ВМ JavaScript, все происходит практически мгновенно. (Если бы мы использовали Injected Web 3, то нам пришлось бы утверждать транзакцию, платить за бензин и ждать, пока транзакция будет добыта).

source: Remix displays information related to each transaction result in the terminal.
ru_ru: Remix отображает в терминале информацию, относящуюся к каждому результату транзакции.

source: Check in the terminal where the transaction you just made is logged.
ru_ru: Проверьте в терминале, где зарегистрирована транзакция, которую Вы только что совершили.

source: Click the debug button to start debugging it.
ru_ru: Нажмите кнопку отладки, чтобы начать отладку.

source: Before we get to the actual debugging tool, the next section show how to start debugging session directly from the Debugger.
ru_ru: Прежде чем мы перейдем к собственно инструменту отладки, в следующем разделе мы покажем, как начать сеанс отладки непосредственно из Отладчика.

source: Initiate Debugging from the Debugger
ru_ru: Инициируйте отладку из отладчика

source: Click the bug icon in the icon panel to get to the debugger in the side panel.
ru_ru: Щелкните значок ошибки на панели пиктограмм, чтобы перейти к отладчику на боковой панели.

source: If you don't see the bug icon, go to the plugin manager and activate the debugger.
ru_ru: Если Вы не видите значок ошибки, зайдите в менеджер плагинов и активируйте отладчик.

source: You can start a debug session by providing a transaction hash.
ru_ru: Вы можете начать сеанс отладки, предоставив хэш транзакции.

source: To find a transaction hash:
ru_ru: Чтобы найти хэш транзакции:

source: Go to a transaction in the terminal.
ru_ru: Перейдите к транзакции в терминале.

source: Click a line with a transaction - to exand the log.
ru_ru: Щелкните на строке с транзакцией -, чтобы развернуть журнал.

source: The transaction hash is there - copy it.
ru_ru: Хэш транзакции находится там - скопируйте его.

source: Then click in the debugger paste the hash and click on the Start debugging button.
ru_ru: Затем щелчком мыши в отладчике вставьте хэш и щелкните на кнопке Начать отладку.

source: Using the debugger
ru_ru: Использование отладчика

source: The debugger allows one to see detailed informations about the transaction's execution. It uses the editor to display the location in the source code where the current execution is.
ru_ru: Отладчик позволяет увидеть подробную информацию о выполнении транзакции. Он использует редактор для отображения того места в исходном коде, где находится текущее выполнение.

source: The navigation part contains a slider and buttons that can be used to step through the transaction execution.
ru_ru: Навигационная часть содержит ползунок и кнопки, которые можно использовать для пошагового выполнения транзакции.

source: More explaination of what these buttons do.
ru_ru: Более подробное объяснение того, что делают эти кнопки.

source: 11 panels give detailed information about the execution:
ru_ru: 11 панелей дают подробную информацию об исполнении:

source: Instructions
ru_ru: Инструкции

source: The Instructions panel displays the bytecode of the current executing contract- with the current step highlighted.
ru_ru: На панели Инструкции отображается байткод текущего выполняемого контракта с выделенным текущим шагом.

source: Important note: When this panel is hidden, the slider will have a courser granularity and only stop at expression boundaries, even if they are compiled into multiple EVM instructions. When the panel is displayed, it will be possible to step over every instruction, even those that refers to the same expression.
ru_ru: Важное замечание: Когда эта панель скрыта, ползунок будет иметь более мелкую детализацию и останавливаться только на границах выражений, даже если они скомпилированы в несколько инструкций EVM. Когда панель отображается, можно будет перешагнуть через каждую инструкцию, даже через те, которые относятся к одному и тому же выражению.

source: The Solidity Locals panel displays local variables associated with the current context.
ru_ru: Панель Solidity Locals отображает локальные переменные, связанные с текущим контекстом.

source: Solidity State
ru_ru: Состояние солидности

source: The Solidity State panel displays state variables of the current executing contract.
ru_ru: Панель Solidity State отображает переменные состояния текущего исполняемого контракта.

source: Low level panels
ru_ru: Панели низкого уровня

source: These panels display low level informations about the execution:
ru_ru: Эти панели отображают низкоуровневую информацию об исполнении:

source: Stack
ru_ru: Стек

source: Storages Changes
ru_ru: Изменения в хранилищах

source: Memory
ru_ru: Память

source: Call Data
ru_ru: Данные о звонках

source: Call Stack
ru_ru: Стек вызовов

source: Return Value (only if the current step is a RETURN opcode)
ru_ru: Возвращаемое значение (только если текущий шаг является опкодом RETURN)

source: Full Storages Changes (only at the end of the execution - display every storage change of every modified contract)
ru_ru: Полные изменения хранилищ (только в конце исполнения - отображение каждого изменения хранилища каждого измененного контракта)

source: Reverted Transaction
ru_ru: Возвращенная транзакция

source: A transaction can be reverted (because of an out of gas exception or Solidity revert statement or because of a low level exception).
ru_ru: Транзакция может быть отменена (из-за исключения out of gas или заявления Solidity revert или из-за исключения низкого уровня).

source: It is important to be aware of the exception and to locate where the exception is in the source code.
ru_ru: Важно знать об исключении и определить, где оно находится в исходном коде.

source: Remix will warn you when the execution throws an exception. The warning button will jump to the last opcode before the exception happened.
ru_ru: Remix предупредит Вас, когда при выполнении возникнет исключение. Кнопка предупреждения приведет к переходу к последнему опкоду, предшествующему возникновению исключения.

source: Breakpoints
ru_ru: Точки останова

source: The two last buttons from the navigation area are used to jump either back to the previous breakpoint or forward to the next breakpoint.
ru_ru: Две последние кнопки из области навигации используются для перехода либо назад к предыдущей точке останова, либо вперед к следующей точке останова.

source: Breakpoints can be added and removed by clicking on the line number in the Editor.
ru_ru: Точки останова можно добавлять и удалять, щелкая на номере строки в Редакторе.

source: When using debug session with breakpoints, the execution will jump to the first encountered breakpoint.
ru_ru: При использовании сессии отладки с точками останова выполнение перейдет к первой встреченной точке останова.

source: Important note: If you add a breakpoint to a line that declares a variable, it might be triggered twice: Once for initializing the variable to zero and second time for assigning the actual value. As an example, assume you are debugging the following contract:
ru_ru: Важное замечание: Если Вы добавите точку останова в строку, в которой объявлена переменная, то она может сработать дважды: один раз для инициализации переменной нулем, а второй раз для присвоения ей фактического значения. В качестве примера предположим, что Вы отлаживаете следующий контракт:

source: And let's says that breakpoints are set for the lines
ru_ru: И допустим, что точки останова установлены для строк

source: then clicking on Jump to next breakpoint will stop at the following lines in the given order:
ru_ru: затем щелчок на Jump to next breakpoint остановится на следующих строках в заданном порядке:

source: uint p = 45; (declaration of p)
ru_ru: uint p = 45; (объявление p)

source: uint l = 34; (declaration of l)
ru_ru: uint l = 34; (объявление l)

source: uint p = 45; (45 assigned to p)
ru_ru: uint p = 45; (45 присваивается p)

source: m = 89; (89 assigned to m)
ru_ru: m = 89; (89 отнесено к m)

source: uint l = 34; (34 assigned to l)
ru_ru: uint l = 34; (34 присваивается l)

source: Run & Deploy (part 2)
ru_ru: Запуск и развертывание (часть 2)

source: Deployed contracts
ru_ru: Развернутые контракты

source: This section in the Run tab contains a list of deployed contracts to interact with through autogenerated UI of the deployed contract (also called udapp).
ru_ru: Этот раздел на вкладке Run содержит список развернутых контрактов для взаимодействия с ними через автогенерируемый пользовательский интерфейс развернутого контракта (также называемый udapp).

source: The deployed contract appears but is in its collapsed form.
ru_ru: Развернутый контракт появляется, но в свернутом виде.

source: Click the sideways caret to open it up.
ru_ru: Щелкните по боковой каретке, чтобы открыть ее.

source: You will see the functions in the contract. The functions buttons can have different color buttons.
ru_ru: Вы увидите функции в контракте. Кнопки функций могут иметь кнопки разного цвета.

source: Functions that are constant or pure functions in Solidity have a blue buttons. Clicking one of this type does not create a new transaction. So clicking will not cause state changes - it will only return a value stored in the contract - so it won't cost you anything in gas fees.
ru_ru: Функции, которые являются постоянными или чистыми функциями в Solidity, имеют синие кнопки. При нажатии на такую кнопку не создается новая транзакция. Таким образом, нажатие не приведет к изменению состояния - оно только вернет значение, хранящееся в контракте - так что это не будет стоить Вам ничего в виде платы за газ.

source: Functions that change the state of the contract AND that do not accept Ether are called non-payable functions and have an orange button. Clicking on them will create a transaction and thus cost gas.
ru_ru: Функции, которые изменяют состояние контракта И которые не принимают Эфир, называются неоплачиваемыми функциями и имеют оранжевую кнопку. При нажатии на них создается транзакция и, следовательно, расходуется Эфир.

source: Functions that have red buttons are payable functions in Solidity. Clicking one of these will create a new transaction and this transaction can accept a value. The value is put in in the Value field which is under the Gas Limit field.
ru_ru: Функции, имеющие красные кнопки, являются оплачиваемыми функциями в Solidity. Щелчок на одной из них приведет к созданию новой транзакции, и эта транзакция может принимать значение. Значение помещается в поле Value, которое находится под полем Gas Limit.

source: See more information about Solidity modifiers in the Solidity docs. .
ru_ru: Смотрите дополнительную информацию о модификаторах Solidity в документации Solidity. .

source: If a function requires input parameters, well.. you gotta put them in.
ru_ru: Если функция требует входных параметров, что ж... Вы должны их вставить.

source: Inputting parameters
ru_ru: Ввод параметров

source: Inputting parameters in the collapsed view
ru_ru: Ввод параметров в свернутом представлении

source: (Inputting all the parameters in a single input box)
ru_ru: (Ввод всех параметров в одно поле ввода)

source: The input box tells you what type each parameter needs to be.
ru_ru: Поле ввода подскажет Вам, какого типа должен быть каждый параметр.

source: Numbers and addresses do not need to be wrapped in double quotes.
ru_ru: Числа и адреса не нужно заключать в двойные кавычки.

source: Strings need to be wrapped.
ru_ru: Строки должны быть обернуты.

source: Parameters are separated by commas.
ru_ru: Параметры разделяются запятыми.

source: In the example above the "delegate" function has 3 parameters.
ru_ru: В приведенном выше примере функция "delegate" имеет 3 параметра.

source: Inputting parameters in the expanded view
ru_ru: Ввод параметров в расширенном представлении

source: Clicking the 'down' caret brings you to the Multi-param Manager - where you can input the parameters one at a time. Much less confusing!
ru_ru: Щелчок по стрелке "вниз" переводит Вас в Менеджер мультипараметров - где Вы можете вводить параметры по одному. Гораздо меньше путаницы!

source: In the expanded view, strings do not need to be wrapped.
ru_ru: В расширенном представлении строки не нужно оборачивать.

source: Clicking the clipboard icon will encode the inputs and will copy them. Only a valid set of inputs can be encoded.
ru_ru: Щелчок на значке буфера обмена приведет к кодированию входов и их копированию. Кодировать можно только действительный набор входов.

source: So if you made a mistake and put a uint8 where an address should have been, clicking the clipboard here will give you an error.
ru_ru: Поэтому, если Вы допустили ошибку и поместили uint8 туда, где должен был быть адрес, щелчок по буферу обмена здесь выдаст Вам ошибку.

source: Low level interactions
ru_ru: Взаимодействие на низком уровне

source: Low level interactions are used to send funds or calldata or funds & calldata to a contract through the recieve() or fallback() function. Typically, you should only need to implement the fallback function if you are following an upgrade or proxy pattern.
ru_ru: Низкоуровневые взаимодействия используются для отправки средств или calldata или средств & calldata в контракт через функцию recieve() или fallback(). Как правило, Вам необходимо реализовать функцию fallback только в том случае, если Вы следуете шаблону обновления или прокси.

source: The low level interactions section is below the functions in each deployed contract.
ru_ru: Раздел низкоуровневых взаимодействий находится ниже функций в каждом развернутом контракте.

source: Please note the following:
ru_ru: Обратите внимание на следующее:

source: If you are executing a plain Ether transfer to a contract, you need to have the receive() function in your contract. If your contract has been deployed and you want to send it funds, you would input the amount of Ether or Wei etc. (see A in graphic below), and then input NOTHING in the calldata field of Low level interactions (see B in graphic) and click the Transact button (see C in graphic below).
ru_ru: Если Вы выполняете простой перевод Эфира в контракт, Вам необходимо иметь в своем контракте функцию receive(). Если Ваш контракт уже развернут, и Вы хотите отправить ему средства, то Вы введете количество Эфиров или Вей и т.д. (см. А на графике ниже), а затем введете НИЧЕГО в поле calldata Низкоуровневых взаимодействий (см. В на графике) и нажмете кнопку Transact (см. С на графике ниже).

source: If you are sending calldata to your contract with Ether, then you need to use the fallback() function and have it with the state mutability of payable.
ru_ru: Если Вы посылаете calldata в Ваш контракт с Ether, то Вам необходимо использовать функцию fallback() и иметь ее с мутабельностью состояния payable.

source: If you are not sending ether to the contract but are sending call data then you need to use the fallback() function.
ru_ru: Если Вы не посылаете эфир контракту, а посылаете данные вызова, то Вам необходимо использовать функцию fallback().

source: If you break the rules when using the Low level interactions you will be slapped with a warning.
ru_ru: Если Вы нарушите правила при использовании взаимодействий низкого уровня, Вы получите предупреждение.

source: Please see the solidity docs for more specifics about using the fallback and receive functions.
ru_ru: Более подробную информацию об использовании функций fallback и receive см. в документации по solidity.

source: Passing in a tuple or a struct to a function
ru_ru: Передача кортежа или структуры в функцию

source: To pass a tuple in, you need to put in an array [].
ru_ru: Чтобы передать кортеж, Вы должны поместить в него массив [].

source: Similarly, to pass in a struct as a parameter of a function, it needs to be put in as an array []. Also note that the line pragma experimental ABIEncoderV2; needs to put in at the top of the solidity file.
ru_ru: Аналогично, чтобы передать struct в качестве параметра функции, его нужно поместить в виде массива []. Также обратите внимание, что строку pragma experimental ABIEncoderV2; необходимо поместить в верхней части файла solidity.

source: Example of passing nested struct to a function
ru_ru: Пример передачи вложенной структуры в функцию

source: Consider a nested struct defined like this:
ru_ru: Рассмотрим вложенную структуру, определенную следующим образом:

source: If a function has the signature fertilizer(Garden memory gardenPlot) then the correct syntax is:
ru_ru: Если функция имеет сигнатуру fertilizer(Garden memory gardenPlot), то правильный синтаксис будет следующим:

source: To continue on this example, here's a sample contract:
ru_ru: Чтобы продолжить этот пример, вот образец контракта:
