Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: Remix Assert Library
ru_ru: Библиотека утверждений ремиксов

source: value: <bool>
ru_ru: значение: <bool>

source: message: <string>
ru_ru: сообщение: <string>

source: Tests if value is truthy. message is returned in case of failure.
ru_ru: Проверяет, является ли значение истинным. В случае неудачи возвращается сообщение.

source: Examples:
ru_ru: Примеры:

source: actual: <uint | int | bool | address | bytes32 | string>
ru_ru: актуально: <uint | int | bool | address | bytes32 | string>

source: expected: <uint | int | bool | address | bytes32 | string>
ru_ru: Ожидается: <uint | int | bool | address | bytes32 | string>

source: Tests if actual & expected values are same. message is returned in case of failure.
ru_ru: Проверяет, совпадают ли фактические и ожидаемые значения. В случае неудачи возвращается сообщение.

source: Tests if actual & expected values are not same. message is returned in case of failure.
ru_ru: Проверяет, не совпадают ли фактические и ожидаемые значения. В случае неудачи возвращается сообщение.

source: Tests if value1 is greater than value2. message is returned in case of failure.
ru_ru: Проверяет, больше ли значение1, чем значение2. В случае неудачи возвращается сообщение.

source: Tests if value1 is lesser than value2. message is returned in case of failure.
ru_ru: Проверяет, меньше ли значение1, чем значение2. В случае неудачи возвращается сообщение.

source: Code Contribution Guide
ru_ru: Руководство по написанию кода

source: Remix is an open source tool and we encourage everyone to help us improve it. Please opening issues, give feedback or contribute by a pulling request to our codebase.
ru_ru: Remix - это инструмент с открытым исходным кодом, и мы призываем всех помочь нам его улучшить. Пожалуйста, находя проблемы, оставляйте отзывы или отправляйте запросы на добавление в нашу кодовую базу.

source: The Remix application is built with JavaScript and it doesn't use any frameworks. We rely on a selected set of npm modules, like yo-yo, csjs-inject and among others. Check out the package.json files in the Remix submodules to learn more about the stack.
ru_ru: Приложение Remix построено на JavaScript и не использует никаких фреймворков. Мы полагаемся на избранный набор модулей npm, таких как yo-yo, csjs-inject и другие. Ознакомьтесь с файлами package.json подмодулей Remix, чтобы узнать больше об этом стеке.

source: To learn more, please visit our GitHub page.
ru_ru: Чтобы узнать больше, посетите нашу страницу на GitHub.

source: Community Support
ru_ru: Поддержка сообщества

source: We know that blockchain ecosystem is very new and that lots of information is scattered around the web. That is why we created a community support channel where we and other users try to answer your questions if you get stuck using Remix. Please, join the community and ask for help.
ru_ru: Мы знаем, что блокчейн-экосистема очень новая и много информации разбросано по сети. Вот почему мы создали канал поддержки сообщества, где мы и другие пользователи пытаемся ответить на ваши вопросы, если вы столкнулись с трудностями при использовании Remix. Пожалуйста, присоединяйтесь к сообществу и попросите помощи.

source: For anyone who is interested in developing a custom plugin for Remix or who wants to contribute to the codebase, we opened a contributors' channel especially for developers working on Remix tools.
ru_ru: Для всех, кто заинтересован в разработке пользовательского плагина для Remix или хочет внести свой вклад в кодовую базу, мы открыли канал контрибьюторов, специально предназначенный для разработчиков, работающих над инструментами Remix.

source: We would kindly ask you to respect the space and to use it for getting help with your work and the developers' channel for discussions related to working on Remix codebase. If you have ideas for collaborations or you want to promote your project, try to find some more appropriate channels to do so. Or you can contact the main contributors directly on Gitter or Twitter.
ru_ru: Мы просим Вас уважать это пространство и использовать его для получения помощи в работе, а канал разработчиков - для обсуждений, связанных с работой над кодовой базой Remix. Если у Вас есть идеи для сотрудничества или Вы хотите продвигать свой проект, постарайтесь найти для этого более подходящие каналы. Или же Вы можете напрямую связаться с основными контрибьюторами на Gitter или Twitter.

source: Compiler (Solidity)
ru_ru: Компилятор (Solidity)

source: Clicking the Solidity icon in the icon panel brings you to the Solidty Compiler.
ru_ru: Щелчок по значку Solidity на панели иконок приводит Вас в Компилятор Solidty.

source: Compiling is triggered when you click the compile button ( D. in image below). If you want the file to be compiled each time the file is saved or when another file is selected - check the auto compile checkbox ( E. in image below).
ru_ru: Компиляция запускается, когда Вы нажимаете кнопку компиляции ( D. на рисунке ниже). Если Вы хотите, чтобы файл компилировался каждый раз при его сохранении или при выборе другого файла, установите флажок автокомпиляции ( E. на рисунке ниже).

source: Since the Solidity version 0.5.7, it is possible to compile Yul files. Please read the (solidity documentation about Yul) which contain some code examples. You can use the language dropdown ( B. in image below) to switch the language. This dropdown list is only available for versions greater than or equal to 0.5.7.
ru_ru: Начиная с версии Solidity 0.5.7, появилась возможность компиляции файлов Yul. Пожалуйста, прочитайте (документацию Solidity о Yul), которая содержит несколько примеров кода. Для переключения языка Вы можете использовать выпадающий список языков (B. на изображении ниже). Этот выпадающий список доступен только для версий, больших или равных 0.5.7.

source: The fork selection dropdown list ( C. in image below) allows to compile code against a specific ethereum hard fork. The compiler default corresponds to the default hard fork used by a specific version. Please go to "Compilation Details" ( G. in image below) in the settings of Metadata section to see the harfork name used for the current compilation.
ru_ru: Выпадающий список выбора форка (C. на изображении ниже) позволяет скомпилировать код под определенный хард форк ethereum. Компилятор по умолчанию соответствует хард форку по умолчанию, используемому конкретной версией. Пожалуйста, перейдите в раздел "Compilation Details" ("Детали компиляции") ("G." на рисунке ниже) в настройках раздела Metadata, чтобы увидеть имя хард-форка, используемого для текущей компиляции.

source: If the contract has a lot of dependencies it can take a while to compile - so you use autocompilation at your discretion.
ru_ru: Если контракт имеет много зависимостей, то его компиляция может занять некоторое время - поэтому Вы используете автокомпиляцию по своему усмотрению.

source: After each compilation, a list is updated with all newly compiled contracts. A compiled contract can be selected with the Contract pulldown menu ( F. in the image). Multiple contracts are compiled when one contract imports other contracts. Selecting a contract will show information about that one.
ru_ru: После каждой компиляции список обновляется и содержит все новые скомпилированные контракты. Скомпилированный контракт можно выбрать с помощью выпадающего меню Контракт ("F." на рисунке). Несколько контрактов компилируются, когда один контракт импортирует другие контракты. Выбрав контракт, Вы увидите информацию о нем.

source: When the "Compilation Details" button is clicked ( G. in image), a modal opens displaying detailed information about the current selected contract.
ru_ru: При нажатии кнопки "Детали компиляции" ("G." на изображении) открывается модальное окно, в котором отображается подробная информация о текущем выбранном контракте.

source: For those writing your own custom solidity compiler, you can import that by clicking the + button (X. in the image) to open a modal where you can input the url of the compiler to be loaded.
ru_ru: Для тех, кто пишет свой собственный компилятор Solidity, Вы можете импортировать его, нажав на кнопку + (X. на изображении), чтобы открыть модальное окно, в котором Вы можете ввести url компилятора, который необходимо загрузить.

source: From the Solidity Compiler module you can also publish your contract to Swarm (only non abstract contracts can be published) & IPFS.
ru_ru: Из модуля Solidity Compiler Вы также можете опубликовать свой контракт в Swarm (можно публиковать только не абстрактные контракты) и IPFS.

source: Published data notably contains the abi and the solidity source code.
ru_ru: Опубликованные данные, в частности, содержат исходный код abi и solidity.

source: After a contract is published, you can find its metadata information using the bzz URL located in the details modal dialog SWARM LOCATION.
ru_ru: После того, как контракт опубликован, Вы можете найти информацию о его метаданных, используя URL-адрес bzz, расположенный в модальном диалоге подробностей SWARM LOCATION.

source: Compilation Errors and Warning are displayed below the contract section. At each compilation, the static analysis tab builds a report. It is important to address reported issues even if the compiler doesn't complain. (see more)
ru_ru: Ошибки компиляции и предупреждения отображаются ниже раздела контрактов. При каждой компиляции вкладка статического анализа строит отчет. Важно устранить сообщенные проблемы, даже если компилятор не жалуется. (см. подробнее)

source: Build Artifact
ru_ru: Создание артефакта

source: When a compilation succeeds, Remix creates two JSON files for each compiled contract. One of these files captures the output from the Solidity compilation. This file will be named contractName_metadata.json.
ru_ru: Когда компиляция проходит успешно, Remix создает два JSON-файла для каждого скомпилированного контракта. Один из этих файлов содержит вывод, полученный в результате компиляции Solidity. Этот файл будет называться contractName_metadata.json.

source: The other JSON file is named contractName.json . The contractName.json file contains the compilation's artifact that is needed for linking a library to the file. It contains the link to the libraries, the bytecode, the deployed bytecode, the gas estimation, the method identifiers, and the ABI.
ru_ru: Другой JSON-файл имеет имя contractName.json . Файл contractName.json содержит артефакт компиляции, необходимый для связывания библиотеки с файлом. Он содержит ссылку на библиотеки, байткод, развернутый байткод, оценку газа, идентификаторы методов и ABI.

source: In order to generate these artifact files, the Generate contract metadata box in the General settings section of the Settings module needs to be checked. The these metadatas files will then be generated when you compile a file and will be placed in the artifacts folder - which you can see in the Files Explorers plugin.
ru_ru: Для того чтобы сгенерировать эти файлы артефактов, необходимо установить флажок Генерировать метаданные контракта в разделе Общие настройки модуля Настройки. Затем эти файлы метаданных будут генерироваться при компиляции файла и помещаться в папку артефактов - которую Вы можете увидеть в плагине Files Explorers.

source: You can write scripts that can access either of these files.
ru_ru: Вы можете написать сценарии, которые могут обращаться к любому из этих файлов.

source: Library Deployment with filename.json
ru_ru: Развертывание библиотеки с помощью файла filename.json

source: By default Remix automatically deploys needed libraries.
ru_ru: По умолчанию Remix автоматически развертывает необходимые библиотеки.

source: When you open the metadata file for the libraries - artifact/filename.json you will see the following sections:
ru_ru: Когда Вы откроете файл метаданных для библиотек - artifact/filename.json, Вы увидите следующие секции:

source: linkReferences contains a map representing libraries which depend on the current contract. Values are addresses of libraries used for linking the contract.
ru_ru: linkReferences содержит карту, представляющую библиотеки, которые зависят от текущего контракта. Значениями являются адреса библиотек, используемых для связывания контракта.

source: autoDeployLib defines if the libraries should be auto deployed by Remix or if the contract should be linked with libraries described in linkReferences
ru_ru: autoDeployLib определяет, должны ли библиотеки быть автоматически развернуты Remix или контракт должен быть скомпонован с библиотеками, описанными в linkReferences

source: Note that Remix will resolve addresses corresponding to the current network. By default, a configuration key follows the form: <network_name>:<networkd_id>, but it is also possible to define <network_name> or <network_id> as keys.
ru_ru: Обратите внимание, что Remix будет разрешать адреса, соответствующие текущей сети. По умолчанию ключ конфигурации имеет вид: <network_name>:<networkd_id>, но можно также определить в качестве ключей <network_name> или <network_id> .

source: Here is a sample metadata file for linking a library:
ru_ru: Здесь приведен пример файла метаданных для связывания библиотеки:

source: Creating and Deploying a Contract
ru_ru: Создание и развертывание контракта

source: There are 3 type of environments Remix can be plugged to: Javascript VM, Injected provider, or Web3 provider. (for details see Running transactions)
ru_ru: Существует 3 типа окружений, к которым может быть подключен Remix: Javascript VM, Injected provider или Web3 provider. (подробнее см. раздел Выполнение транзакций)

source: Both Web3 provider and Injected provider require the use of an external tool.
ru_ru: Как Web3-провайдер, так и Injected-провайдер требуют использования внешнего инструмента.

source: The external tool for Web3 provider is an Ethereum node and for Injected provider Metamask.
ru_ru: Внешним инструментом для Web3-провайдера является узел Ethereum, а для Injected-провайдера - Metamask.

source: The JavaScript VM mode is convenient because each execution runs in your browser and you don't need any other software or Ethereum node to run it.
ru_ru: Режим JavaScript VM удобен тем, что каждое выполнение запускается в Вашем браузере, и Вам не нужно никакого другого программного обеспечения или узла Ethereum для его запуска.

source: So, it is the easiest test environment - no setup required!
ru_ru: Таким образом, это самая простая тестовая среда - не требуется никаких настроек!

source: But keep in mind that reloading the browser when you are in the Javascript VM will restart Remix in an empty state.
ru_ru: Но имейте в виду, что перезагрузка браузера, когда Вы находитесь в виртуальной машине Javascript, приведет к перезапуску Remix в пустом состоянии.

source: For performance purposes ( which is to say - for testing in an environment that is closest to the mainnet), it might also be better to use an external node.
ru_ru: В целях повышения производительности (то есть для тестирования в среде, максимально приближенной к основной сети), возможно, лучше использовать внешний узел.

source: Selecting the VM mode
ru_ru: Выбор режима ВМ

source: Make sure the VM mode is selected. All accounts displayed in Accounts should have 100 ether.
ru_ru: Убедитесь, что выбран режим VM. Все счета, отображаемые в разделе Accounts, должны иметь 100 эфиров.

source: Sample contract
ru_ru: Образец договора

source: This contract is very basic. The goal is to quickly start to create and to interact with a sample contract.
ru_ru: Этот контракт является очень базовым. Цель состоит в том, чтобы быстро начать создавать и взаимодействовать с образцом контракта.

source: Deploying an instance
ru_ru: Развертывание экземпляра

source: The Compile tab displays information related to the current contract (note that there can be more than one) (see compile).
ru_ru: На закладке Compile отображается информация, относящаяся к текущему контракту (обратите внимание, что их может быть несколько) (см. compile).

source: Moving on, in the Run tab select, JavaScript VM to specify that you are going to deploy an instance of the contract in the JavaScript VM state.
ru_ru: Двигаясь дальше, на вкладке Run выберите, JavaScript VM, чтобы указать, что Вы собираетесь развернуть экземпляр контракта в состоянии JavaScript VM.

source: The constructor of Ballot.sol needs a parameter (of type uint8). Give any value and click on Deploy.
ru_ru: Конструктору Ballot.sol необходим параметр (типа uint8). Задайте любое значение и щелкните на Deploy.

source: The transaction which deploys the instance of Ballot is created.
ru_ru: Создается транзакция, которая развертывает экземпляр Ballot.

source: In a "normal" blockchain, it can take several seconds to execute. This is the time for the transaction to be mined. However, because we are using the JavaScript VM, our execution is immediate.
ru_ru: В "обычном" блокчейне на выполнение транзакции может уйти несколько секунд. Это время, необходимое для майнинга транзакции. Однако, поскольку мы используем ВМ JavaScript, выполнение происходит мгновенно.

source: The terminal will inform you about the transaction. You can see details there and start debugging.
ru_ru: Терминал сообщит Вам о транзакции. Там Вы можете посмотреть подробности и начать отладку.

source: The newly created instance is displayed in the run tab.
ru_ru: Вновь созданный экземпляр отображается на вкладке run.

source: Interacting with an instance
ru_ru: Взаимодействие с экземпляром

source: This new instance contains 3 actions which corresponds to the 3 functions (setP, setPN, get). Clicking on SetP or SetPN will create a new transaction.
ru_ru: Этот новый экземпляр содержит 3 действия, которые соответствуют 3 функциям (setP, setPN, get). Щелчок на SetP или SetPN приведет к созданию новой транзакции.

source: Note that SetP is payable (red button) : it is possible to send value (Ether) to the contract.
ru_ru: Обратите внимание, что SetP является платным (красная кнопка) : можно отправить стоимость (Ether) в контракт.

source: SetPN is not payable (orange button - depending on the theme) : it is not possible to send value (Ether) to the contract.
ru_ru: SetPN не оплачивается (оранжевая кнопка - в зависимости от темы) : невозможно отправить стоимость (Ether) на контракт.

source: Clicking on get will not execute a transaction (usually its a blue button - depending on the theme). It doesn't execute a transaction because a get does not modify the state (variable value) of this instance.
ru_ru: Щелчок на кнопке get не приведет к выполнению транзакции (обычно это синяя кнопка - в зависимости от темы). Она не выполняет транзакцию, потому что get не изменяет состояние (значение переменной) данного экземпляра.

source: As get is view you can see the return value just below the action.
ru_ru: В виде get Вы можете увидеть возвращаемое значение чуть ниже действия.

source: Debugger
ru_ru: Отладчик

source: This module allows you to debug the transaction. It can be used to deploy transactions created from Remix and already mined transactions. (debugging works only if the current environment provides the necessary features).
ru_ru: Этот модуль позволяет Вам отлаживать транзакцию. Его можно использовать для развертывания транзакций, созданных из Remix, и уже добытых транзакций. (Отладка работает только в том случае, если текущая среда предоставляет необходимые возможности).

source: To get to the debugger - you can click the debug button in the terminal when a successful or failed transaction appears there. You can also load the module from the plugin manager and then click the bug in the icon panel. Or you can get to the debugger by running the debug command in the console.
ru_ru: Чтобы попасть в отладчик - Вы можете нажать кнопку отладки в терминале, когда там появится успешная или неудачная транзакция. Вы также можете загрузить модуль из менеджера плагинов и затем щелкнуть на ошибке в панели значков. Или Вы можете попасть в отладчик, выполнив команду debug в консоли.

source: To learn more about how to use this tool go to the debugger tutorial.
ru_ru: Чтобы узнать больше о том, как использовать этот инструмент, перейдите к учебнику по отладчику.

source: FAQ
ru_ru: ЧаВо

source: Solidity compiler
ru_ru: Компилятор Solidity

source: Q: Error: compiler might be in a non-sane state
ru_ru: В: Ошибка: компилятор может быть в неисправном состоянии

source: A: Old versions of solidity compiler had this problem with chrome. Please change the compiler version in Solidity Plugin to the newer one or use another browser.
ru_ru: О: У старой версии компилятора solidity возникает такая проблема с браузером Chrome. Поменяйте версию компилятора в Плагине Solidity на более новую или воспользуйтесь другим браузером.

source: Q: I’m getting an issue with Maximum call stack exceed and various other errors, can't compile.
ru_ru: В: У меня возникает проблема с превышением максимального количества запусков и другими ошибками, не могу скомпилировать.

source: A: Try a different browser or a newer solidity compiler version.
ru_ru: О: Попробуйте другой браузер или более новую версию компилятора solidity.

source: Q: How to verify a contract that imports other contracts?
ru_ru: В: Как подтвердить контракт, который импортирует другие контракты?

source: A: The verification tool does not recursively go through the import statments in a contract. So can only verify a 'flattened' contract.
ru_ru: О: Проверяющий инструмент не выполняет рекурсивную проверку операторов импорта в контракте. Так что можно проверить только "прямые" контракты.

source: There is a plugin called Flattener which will stuff all the original code and the imported code into a single file.
ru_ru: Есть плагин Flattener, который объединит весь исходный и импортированный код в один файл.

source: Deploy & Run
ru_ru: Развертывание и запуск

source: Q: I am using an Infura endpoint in my app, but when I try to deploy against that endpoint in remix IDE selecting "web3 provider" and putting my endpoint in, it's telling me that it can't connect
ru_ru: В: В своем приложении я использую конечную точку Infura, но при попытке выполнить развертывание на этой конечной точке в remix IDE, выбирая "web3 provider" и добавляя свою конечную точку, мне сообщается, что она не может подключиться.

source: A: If the endpoint you are using is http, it won't work.
ru_ru: О: Если вы используете конечную точку http, она не будет работать.

source: Q: Where is deploy button?
ru_ru: В: Где кнопка "развернуть"?

source: A: Its in the Deploy & Run module. If you haven't activated that module, you should do that by clicking Deploy & Run module in the Plugin Manager. You could also activate everything you need to work with solidity on the landing page ( click the remix logo at the top left for the screen) and click the "Solidity" button in the environment section.
ru_ru: О: Она находится в модуле Развертывание и запуск. Если вы не активировали этот модуль, вы должны сделать это в Диспетчере плагинов. Вы также можете активировать всё, что вам нужно для работы с Solidity, на стартовой странице (нажмите на логотип remix в левом верхнем углу), нажав кнопку "Solidity" в разделе "среда".

source: Q: How to pass a tuple to a public function in Remix?
ru_ru: В: Как передать кортеж публичной функции в Remix?

source: A: Pass it as an array [].
ru_ru: О: Передайте его как массив [].

source: Q: How to input a struct as input to a parameter of a function in the Deploy & Run module?
ru_ru: В: Как ввести структуру в качестве входных данных для параметра функции в модуле Развертывание и запуск?

source: A: For inputting a struct, just like a tuple, pass it in as an array []. Also you need to put in the line:
ru_ru: О: Для введения структуры, как и кортежа, передайте его как массив []. Ещё вам нужно вставить в строку:
