Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: pragma experimental ABIEncoderV2; at the top of the solidity file.
ru_ru: pragma experimental ABIEncoderV2; в верхней части файла Solidity.

source: For example, here's a solidity file with a struct is an input parameter.
ru_ru: Например, вот файл solidity, структура которого является входным параметром.

source: The input of initPeepToPeeps takes a struct. If you input [1,2] the transaction will go through.
ru_ru: Ввод initPeepToPeeps принимает структуру. Если вы введете [1,2], операция пройдёт.

source: General
ru_ru: Общие

source: Q: Where do plugin developers go with their questions?
ru_ru: В: Где разработчикам плагинов задавать вопросы?

source: A: The Gitter Remix plugin developers room https://gitter.im/ethereum/remix-dev-plugin
ru_ru: О: В комнате разработчиков плагинов Remix в Gitter https://gitter.im/ethereum/remix-dev-plugin

source: File Explorers
ru_ru: Проводник

source: To get to the File Explorers module - click the file explorers icon.
ru_ru: Что бы перейти в проводник - нажмите на символ проводника.

source: The basic files explorer lists all the files stored in your browser's browser storage. You can see them in the browser folder.
ru_ru: В обычном проводнике перечислены все файлы, находящиеся в хранилище вашего браузера. Вы можете увидеть их в папке браузера.

source: Important Note: Clearing the browser storage will permanently delete all the solidity files stored there. This is an inherent limitation of a browser-based IDE. However, if you want to store files outside of the browser and on your computer's filesystem, use Remixd or use the desktop version of Remix-IDE. RemixD enables you to have access to a selected folder on your hard drive. Remix Desktop is a version of Remix-IDE in an Electron app.
ru_ru: Важное замечание: Очистка хранилища браузера приведет к окончательному удалению всех хранящихся там файлов solidity. Это - неотъемлемое ограничение IDE, основанной на браузере. Однако если Вы хотите хранить файлы вне браузера, а в файловой системе Вашего компьютера, используйте Remixd или настольную версию Remix-IDE. RemixD позволяет Вам иметь доступ к выбранной папке на жестком диске. Remix Desktop - это версия Remix-IDE в приложении Electron.

source: You can rename, remove or add new files to the file explorer.
ru_ru: Вы можете переименовать, удалить или добавить новые файлы в проводник.

source: We will start by reviewing the icons in the image above.
ru_ru: Мы начнем с рассмотрения пиктограмм на изображении выше.

source: The book icon - A. is the link to the module's documentation.
ru_ru: Значок книги - A. является ссылкой на документацию модуля.

source: The icons to the right of the browser file explorer in the image above only appear for browser storage.
ru_ru: Пиктограммы справа от файлового проводника браузера на изображении выше появляются только для хранилища браузера.

source: Create new File
ru_ru: Создать новый файл

source: The icon marked B. above. Creates a new file.
ru_ru: Пиктограмма, отмеченная выше буквой B. Создает новый файл.

source: Publish to Gist
ru_ru: Опубликовать в Gist

source: The icon marked C. above. Publishes all files from the browser folder to a gist. Only file in the root of browser will be published. Files in subfolders will not be publish to the Gist. Gist API has changed in 2018 and requires users to be authenticated to be able to publish a gist.
ru_ru: Выше показан значок, помеченный C. Публикует все файлы из папки браузера в gist. Будет опубликован только файл в корне браузера. Файлы во вложенных папках не будут опубликованы в Gist. API Gist изменился в 2018 году и требует аутентификации пользователей для публикации gist.

source: Click this link to Github tokens setup and select Generate new token. Then check the Create gists checkbox and generate a new token.
ru_ru: Щелкните по этой ссылке для настройки токенов Github и выберите Generate new token. Затем установите флажок Create gists и сгенерируйте новый токен.

source: Take the token and paste it in Remix's Settings module in the Github Access Token section. And then click Save. Now you should be able to use the feature.
ru_ru: Возьмите токен и вставьте его в модуль Настройки Ремикса в раздел Токен доступа Github. Затем нажмите кнопку Сохранить. Теперь Вы должны быть в состоянии использовать эту функцию.

source: Create a folder
ru_ru: Создать папку

source: The icon marked D. above. Creates a new folder in browser file explorer.
ru_ru: Значок, отмеченный выше буквой D. Создает новую папку в файловом проводнике браузера.

source: Context Menu (Right Click)
ru_ru: Контекстное меню (правый клик)

source: Right click on a file or a folder and the context menu will appear.
ru_ru: Нажмите правой кнопкой мыши на файл или папку, и появится контекстное меню.

source: You can rename or delete a selected file or a folder. You can also create a folder.
ru_ru: Вы можете переименовать или удалить выбранный файл или папку. Вы также можете создать папку.

source: To create a file with the context menu, right click on a folder to get the Create File option. A file will be created inside that folder.
ru_ru: Чтобы создать файл с помощью контекстного меню, щелкните правой кнопкой мыши на папку, чтобы появился параметр «Создать файл». Внутри этой папки будет создан файл.

source: The functionality of the context menu also works with RemixD (which gives you have access to a folder on your hard drive).
ru_ru: Функции контекстного меню также работает с RemixD (что дает вам доступ к папке на жестком диске).

source: Note: When working with RemixD, you need to open and close the localhost folder to refresh the view.
ru_ru: Примечание. При работе с RemixD вам необходимо открывать и закрывать папку localhost, чтобы обновить вид.

source: Importing Source Files in Solidity
ru_ru: Импорт исходных файлов в Solidity

source: There are multiple techniques for importing files into Remix.
ru_ru: Существует несколько способов импорта файлов в Remix.

source: For a tutorial about importing files click here. You can also find this tutorial in the Remix Workshops plugin.
ru_ru: Для просмотра руководства по импорту файлов, нажмите здесь. Вы также можете найти это руководство в плагине Remix Workshops.

source: For a detailed explanation of the import keyword see the Solidity documentation
ru_ru: Для детального понимания ключевого слова import смотрите документацию Solidity

source: Here are a some of the main methods of importing a file:
ru_ru: Вот некоторые из основных способов импорта файла:

source: Importing a file from the browser's local storage
ru_ru: Импорт файла из локального хранилища браузера

source: Files in Remix can be imported with the import key word with the path to the file. Use ./ for relative paths to increase portability.
ru_ru: Файлы в Remix можно импортировать с помощью ключевого слова import с указанием пути к файлу. Для повышения переносимости используйте ./ для относительных путей.

source: Importing a file from your computer's filesystem
ru_ru: Импорт файла из файловой системы Вашего компьютера

source: This method uses remixd - the remix daemon. Please go to the remixd tutorial for instructions about how to bridge the divide between the browser and your computers filesystem.
ru_ru: В этом методе используется remixd - демон remix. Пожалуйста, обратитесь к руководству по remixd, чтобы получить инструкции о том, как преодолеть разрыв между браузером и файловой системой Вашего компьютера.

source: Importing from GitHub
ru_ru: Импорт из GitHub

source: It is possible to import files directly from GitHub. You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example below imports from OpenZeppelin Contracts v2.5.0.
ru_ru: Существует возможность импортировать файлы непосредственно с GitHub. Вы должны указать тег релиза (если он доступен), иначе Вы получите последнюю версию кода в мастер-ветке. Для OpenZeppelin Contracts Вы должны использовать только код, опубликованный в официальном релизе. В приведенном ниже примере импортируется код из OpenZeppelin Contracts v2.5.0.

source: Importing from Swarm
ru_ru: Импорт из Swarm

source: Files can be imported using all URLs supported by swarm. If you do not have a swarm node, then use swarm-gateways.net.
ru_ru: Файлы можно импортировать, используя URL-адреса, поддерживаемые swarm. Если у вас нет узла swarm, используйте swarm-gateways.net.

source: Importing from IPFS
ru_ru: Импорт из IPFS

source: Files can be imported from IPFS.
ru_ru: Файлы могут быть импортированы из IPFS.

source: Importing from the console
ru_ru: Импорт из консоли

source: You can also use a remix command remix.loadurl('<the_url>')in the console. You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example below imports from OpenZeppelin Contracts v2.5.0.
ru_ru: Вы также можете использовать команду remix remix.loadurl('<the_url>')в консоли. Вы должны указать тег релиза (если он доступен), иначе Вы получите самый последний код в мастер-ветке. Для OpenZeppelin Contracts Вы должны использовать только код, опубликованный в официальном релизе. В примере ниже импортируется код из OpenZeppelin Contracts v2.5.0.

source: Notice that this will create a github folder in the file explorer. To load a file in the github folder, you would use a command like this:
ru_ru: Обратите внимание, что при этом в файловом проводнике будет создана папка github. Чтобы загрузить файл в папку github, Вы должны использовать команду, подобную этой:

source: Welcome to Remix documentation!
ru_ru: Добро пожаловать в документацию по Remix!

source: Remix is a powerful, open source tool that helps you write Solidity contracts straight from the browser. Written in JavaScript, Remix supports both usage in the browser and locally.
ru_ru: Remix — это мощный инструмент с открытым исходным кодом, который помогает вам писать контракты Solidity прямо из браузера. Написанный на JavaScript, Remix поддерживает использование как в браузере, так и локально.

source: Remix also supports testing, debugging and deploying of smart contracts and much more.
ru_ru: Remix также поддерживает тестирование, отладку и развертывание смарт-контрактов и многое другое.

source: Our Remix project with all its features is available at `remix.ethereum.org <https://remix.ethereum.org>`__ and more information can be found in these docs. Our IDE tool is available at `our GitHub repository <https://github.com/ethereum/remix-ide>`__.
ru_ru: Проект Remix со всеми его функциями доступен по адресу `remix.ethereum.org <https://remix.ethereum.org>`__, а дополнительную информацию можно найти в этих документах. Наш инструмент IDE доступен в репозитории GitHub <https://github.com/ethereum/remix-ide>`__.

source: This set of documents covers instructions on how to use Remix and some tutorials to help you get started.
ru_ru: Этот набор документов содержит инструкции по использованию Remix и некоторые руководства, которые помогут вам начать работу.

source: Useful links:
ru_ru: Полезные ссылки:

source: `Solidity documentation <https://solidity.readthedocs.io>`__
ru_ru: `Документация Solidity <https://solidity.readthedocs.io>`__

source: `Remix alpha <https://remix-alpha.ethereum.org>`__ - The version where we test new Remix release (not stable!).
ru_ru: `Remix alpha <https://remix-alpha.ethereum.org>`__ — Версия, в которой мы тестируем новый релиз Remix (не стабильный!).

source: `Remix on Medium <https://medium.com/remix-ide>`__
ru_ru: `Remix на Medium <https://medium.com/remix-ide>`__

source: `Ethereum StackExchange for Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__
ru_ru: `Ethereum StackExchange для Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__

source: `Community support channel <https://gitter.im/ethereum/remix>`__
ru_ru: `Канал поддержки сообщества <https://gitter.im/ethereum/remix>`__

source: `Ðapp Developer resources (Ethereum wiki) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__
ru_ru: `Ресурсы разработчика Ðapp (Ethereum wiki) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__

source: New Layout Intro
ru_ru: Введение в новый макет

source: Tour of default modules
ru_ru: Обзор модулей по умолчанию

source: Tour of typical solidity modules
ru_ru: Обзор типовых модулей solidity

source: Solidity Unit Testing
ru_ru: Модульное тестирование Solidity

source: Using Remix
ru_ru: Использование Remix

source: Miscellaneous
ru_ru: Разное

source: Remix-IDE Layout
ru_ru: Макет Remix-IDE

source: The new structure
ru_ru: Новая структура

source: Icon Panel - click to change which plugin appears in the Side Panel
ru_ru: Панель иконок - щелкните, чтобы изменить, какой плагин отображается на Боковой панели

source: Side Panel - Most but not all plugins will have their GUI here.
ru_ru: Боковая панель - Большинство, но не все плагины будут иметь здесь свой графический интерфейс.

source: Main Panel - In the old layout this was just for editing files. In the tabs can be plugins or files for the IDE to compile.
ru_ru: Главная панель - В старой схеме она предназначалась только для редактирования файлов. На вкладках могут находиться плагины или файлы для компиляции IDE.

source: Terminal - where you will see the results of your interactions with the GUI's. Also you can run scripts here.
ru_ru: Terminal (Терминал) - здесь Вы увидите результаты Вашего взаимодействия с графическим интерфейсом. Также здесь Вы можете запускать скрипты.

source: Icon Panel at Page Load
ru_ru: Панель значков при загрузке страницы

source: When you load remix - the icon panel show these icons by default.
ru_ru: Когда Вы загружаете remix - панель пиктограмм по умолчанию показывает эти пиктограммы.

source: Everything in remix is now a plugin... so the Plugin Manager is very important. In the old layout, each basic task in remix was separated into the tabs. Now these tabs are plugins.
ru_ru: Все в remix теперь является плагином... поэтому Менеджер плагинов очень важен. В старой схеме каждая основная задача в remix была разделена на вкладки. Теперь эти вкладки являются плагинами.

source: But to activate a half a dozen plugins - (or however many you are using) each time the page load is tedious. So learn about the Environments.
ru_ru: Но активировать полдюжины плагинов - (или сколько бы Вы их ни использовали) при каждой загрузке страницы - утомительно. Поэтому познакомьтесь с Окружениями.

source: Homepage
ru_ru: Домашняя страница

source: The homepage is located in a tab in the Main Panel.
ru_ru: Домашняя страница расположена на вкладке в Главной панели.

source: You can also get there by clicking the remix logo at the top of the icon panel.
ru_ru: Вы также можете попасть туда, щелкнув на логотипе ремикса в верхней части панели пиктограмм.

source: Environments
ru_ru: Среды

source: Clicking on one of the environment buttons loads up a collection of plugins. We currently have a Solidity Button and a Vyper button. In the future you will be able to save your own environment.
ru_ru: Щелчок на одной из кнопок окружения загружает коллекцию плагинов. В настоящее время у нас есть кнопка Solidity и кнопка Vyper. В будущем Вы сможете сохранять собственные окружения.

source: To see all the plugins go to the plugin manager - by selecting the plug in the icon panel.
ru_ru: Чтобы увидеть все плагины, перейдите в менеджер плагинов - выбрав плагин на панели пиктограмм.

source: The environment buttons are time & sanity savers - so you don't need to go to the plugin manager to get started everytime you load the page.
ru_ru: Кнопки окружения - это экономия времени и здравого смысла - Вам не нужно каждый раз при загрузке страницы заходить в менеджер плагинов, чтобы начать работу.

source: Plugin Manager
ru_ru: Менеджер плагинов

source: In order to make Remix flexible for integrating changes into its functionality and for integrating remix into other projects (your's for example), we've now made everything a plugin. This means that you only load the functionality you need. It also means that you need a place to turn off and on plugins - as your needs change. This all happens in the plug manager.
ru_ru: Для того, чтобы сделать Ремикс гибким для внесения изменений в его функциональность и для интеграции Ремикса в другие проекты (например, в Ваш), мы теперь сделали все плагином. Это означает, что Вы загружаете только ту функциональность, которая Вам необходима. Это также означает, что Вам нужно место для отключения и включения плагинов - по мере изменения Ваших потребностей. Все это происходит в менеджере плагинов.

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix. In that case you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
ru_ru: Менеджер плагинов - это также то место, куда Вы обращаетесь, если Вы создаете свой собственный плагин и хотите загрузить локальный плагин в Remix. В этом случае Вы щелкните на ссылке "Подключиться к локальному плагину" в верхней части панели Менеджера плагинов.

source: Themes
ru_ru: Темы

source: So you want to work on Remix with a dark theme or a gray theme or just a different theme that the one you are currently looking at? Go to the settings tab and at the bottom is a choice of lots of bootstrap based themes.
ru_ru: Итак, Вы хотите работать в Remix с темной темой, серой темой или просто с темой, отличной от той, которую Вы сейчас просматриваете? Перейдите на вкладку настроек, и внизу будет выбор из множества тем, основанных на bootstrap.

source: Remix URLs & Links with Parameters
ru_ru: Ремикс URL и ссылок с параметрами

source: Remix URLs
ru_ru: URL-адреса ремиксов

source: An online version is available at https://remix.ethereum.org. This version is stable and is updated at almost every release.
ru_ru: Онлайновая версия доступна по адресу https://remix.ethereum.org. Эта версия является стабильной и обновляется практически в каждом релизе.

source: An alpha online version is available at https://remix-alpha.ethereum.org. This is not a stable version.
ru_ru: Альфа-версия онлайн доступна по адресу https://remix-alpha.ethereum.org. Это не стабильная версия.

source: Github repo: https://github.com/ethereum/remix-project . The README contains instructions for running Remix-IDE locally.
ru_ru: Github repo: https://github.com/ethereum/remix-project . В README содержатся инструкции по локальному запуску Remix-IDE.

source: Github release: https://github.com/ethereum/remix-project/releases .
ru_ru: Релиз на Github: https://github.com/ethereum/remix-project/releases .

source: Embedding & Linking to Remix
ru_ru: Встраивание и размещение ссылок на Ремикс

source: Remix-IDE's urls have parameters -so it is possible to specify:
ru_ru: Урлы Remix-IDE имеют параметры - поэтому их можно указывать:

source: the list of plugins you want activated
ru_ru: список плагинов, которые Вы хотите активировать

source: the theme (Dark or Light)
ru_ru: тема (Темная или Светлая)

source: the panels that should be minimized
ru_ru: панели, которые должны быть сведены к минимуму

source: if you want the Solidity compiler to have optimize enabled
ru_ru: если Вы хотите, чтобы в компиляторе Solidity была включена функция optimize

source: In the following example, there is a list of plugins that follows the word plugins will be activated and the last plugin will gain the focus.
ru_ru: В следующем примере имеется список плагинов, который после слова plugins будет активирован, и последний плагин получит фокус.

source: For the plugin are called by their name in their profile. To check for a plugin's profile name - for plugins built by external teams, please go to https://github.com/ethereum/remix-plugins-directory/tree/master/plugins
ru_ru: Для плагина они называются по имени в своем профиле. Чтобы проверить имя профиля плагина - для плагинов, созданных внешними командами, пожалуйста, перейдите по ссылке https://github.com/ethereum/remix-plugins-directory/tree/master/plugins.

source: Further Customization with URL parameters
ru_ru: Дальнейшая настройка с помощью параметров URL

source: The following URL will close everything except the main panel & the icon panel (so the side and terminal are minimized)
ru_ru: Следующий URL закроет все, кроме главной панели и панели иконок (таким образом, боковая панель и терминал будут минимизированы)

source: To link with the side panel minimized use this URL:
ru_ru: Чтобы сделать ссылку со свернутой боковой панелью, используйте этот URL:

source: To link to Remix with the dark theme or the light theme specified use this url:
ru_ru: Для ссылки на Remix с темной или светлой темой используйте этот url:

source: To link to Remix with the Solidity compiler, the unit testing, and LearnEth plugins activated (with Learneth gaining the side panel's focus) & with the Light theme loaded & with the terminal minimized use this URL & with optimize off:
ru_ru: Чтобы установить ссылку на Remix с активированными компилятором Solidity, модульным тестированием и плагинами LearnEth (при этом Learneth будет находиться в фокусе боковой панели), с загруженной темой Light и свернутым терминалом, используйте этот URL и выключите оптимизацию:

source: Everything is a PLUGIN in Remix
ru_ru: Все является ПЛЮГИНОМ в Remix

source: In order to integrate new tools made by us and by ...you into Remix, we've now made everything a plugin. This architecture will also allow Remix or just parts of Remix to be integrated into other projects (your's for example).
ru_ru: Для того, чтобы интегрировать в Ремикс новые инструменты, созданные нами и ...Вами, мы сделали все плагины. Такая архитектура также позволит интегрировать Ремикс или отдельные его части в другие проекты (например, в Ваш).

source: This means that you only load the functionality you need.
ru_ru: Это означает, что Вы загружаете только ту функциональность, которая Вам необходима.

source: It also means that you can turn off and on plugins - as your needs change.
ru_ru: Это также означает, что Вы можете отключать и включать плагины - по мере изменения Ваших потребностей.

source: This all happens in the plug manager.
ru_ru: Все это происходит в менеджере подключений.

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix.
ru_ru: Менеджер плагинов - это также то место, куда Вы обращаетесь, когда создаете свой собственный плагин и хотите загрузить свой локальный плагин в Remix.

source: To load your local plugin, you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
ru_ru: Чтобы загрузить локальный плагин, Вы должны щелкнуть на ссылке "Подключиться к локальному плагину" в верхней части панели Менеджера плагинов.

source: To learn more about how to create your own plugin, go to the README of remix-plugin repo.
ru_ru: Чтобы узнать больше о том, как создать свой собственный плагин, обратитесь к README репо remix-plugin.

source: Remix Commands
ru_ru: Команды Ремикса

source: In the console, you can run the commands listed below. Once you start to type a command, there is auto completion. These commands are using the following libraries:
ru_ru: В консоли Вы можете выполнять команды, перечисленные ниже. Как только Вы начинаете вводить команду, происходит автозавершение. Эти команды используют следующие библиотеки:

source: ethers: The ethers.js library is a compact and complete JavaScript library for Ethereum.
ru_ru: ethers.js: Библиотека ethers.js - это компактная и полная библиотека JavaScript для Ethereum.
