Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: After compiling, deploying the contract and opening up the deployed instance, we can then add the following input parameters to the function named fertilizer :
ru_ru: После компиляции, развертывания контракта и открытия развернутого экземпляра мы можем добавить следующие входные параметры в функцию с именем fertilizer :

source: The function fertilizer accepts a single parameter of the type Garden. The type Garden is a struct. Structs are wrapped in square brackets. Inside Garden is an array that is an array of structs named theFlowers. It gets a set of brackets for the array and another set for the struct. Thus the double square brackets.
ru_ru: Функция fertilizer принимает один параметр типа Garden. Тип Garden является структурой. Структуры заключаются в квадратные скобки. Внутри Garden находится массив, который представляет собой массив структур с именем theFlowers. Он получает один набор скобок для массива и другой набор для структуры. Таким образом, двойные квадратные скобки.

source: Testing by Example
ru_ru: Тестирование на примере

source: Here are some examples which can give you better understanding to plan your tests.
ru_ru: Приведем несколько примеров, которые могут дать Вам лучшее понимание для планирования Ваших тестов.

source: Note: Examples in this section are intended to give you a push for development. We don't recommend to rely on them without verifying at your end.
ru_ru: Примечание: Примеры в этом разделе предназначены для того, чтобы дать Вам толчок к развитию. Мы не рекомендуем полагаться на них без проверки со своей стороны.

source: 1. Simple example
ru_ru: 1. Простой пример

source: In this example, we test setting & getting variables.
ru_ru: В этом примере мы тестируем установку и получение переменных.

source: Contract/Program to be tested: Simple_storage.sol
ru_ru: Тестируемый контракт/программа: Simple_storage.sol

source: Test contract/program: simple_storage_test.sol
ru_ru: Тестовый контракт/программа: simple_storage_test.sol

source: 2. Testing a method involving msg.sender
ru_ru: 2. Тестирование метода, включающего msg.sender

source: In Solidity, msg.sender plays a great role in access management of a smart contract methods interaction. Different msg.sender can help to test a contract involving multiple accounts with different roles. Here is an example for testing such case:
ru_ru: В Solidity msg.sender играет большую роль в управлении доступом при взаимодействии методов смарт-контракта. Различные msg.sender могут помочь протестировать контракт, в котором задействовано несколько учетных записей с различными ролями. Ниже приведен пример тестирования такого случая:

source: Contract/Program to be tested: Sender.sol
ru_ru: Контракт/программа для тестирования: Sender.sol

source: Test contract/program: Sender_test.sol
ru_ru: Тестовый контракт/программа: Sender_test.sol

source: 3. Testing method execution
ru_ru: 3. Выполнение метода тестирования

source: With Solidity, one can directly verify the changes made by a method in storage by retrieving those variables from a contract. But testing for a successful method execution takes some strategy. Well that is not entirely true, when a test is successful - it is usually obvious why it passed. However, when a test fails, it is essential to understand why it failed.
ru_ru: С помощью Solidity можно напрямую проверить изменения, произведенные методом в хранилище, получив эти переменные из контракта. Но тестирование успешного выполнения метода требует определенной стратегии. Это не совсем верно, когда тест проходит успешно - обычно очевидно, почему он прошел. Однако, когда тест не удался, очень важно понять, почему он не удался.

source: To help in such cases, Solidity introduced the try-catch statement in version 0.6.0. Previously, we had to use low-level calls to track down what was going on.
ru_ru: Чтобы помочь в таких случаях, Solidity ввел оператор try-catch в версии 0.6.0. Ранее нам приходилось использовать низкоуровневые вызовы, чтобы отследить, что происходит.

source: Here is an example test file that use both try-catch blocks and low level calls:
ru_ru: Приведем пример тестового файла, в котором используются как блоки try-catch, так и низкоуровневые вызовы:

source: Contract/Program to be tested: AttendanceRegister.sol
ru_ru: Проверяемый контракт/программа: AttendanceRegister.sol

source: Test contract/program: AttendanceRegister_test.sol
ru_ru: Тестовый контракт/программа: AttendanceRegister_test.sol

source: 4. Testing a method involving msg.value
ru_ru: 4. Тестирование метода, включающего msg.value

source: In Solidity, ether can be passed along with a method call which is accessed inside contract as msg.value. Sometimes, multiple calculations in a method are performed based on msg.value which can be tested with various values using Remix's Custom transaction context. See the example:
ru_ru: В Solidity эфир может быть передан вместе с вызовом метода, доступ к которому осуществляется внутри контракта как msg.value. Иногда несколько вычислений в методе выполняются на основе msg.value, что можно протестировать с различными значениями, используя контекст пользовательских транзакций Remix. См. пример:

source: Contract/Program to be tested: Value.sol
ru_ru: Контракт/программа, подлежащая тестированию: Value.sol

source: Test contract/program: Value_test.sol
ru_ru: Тестовый контракт/программа: Value_test.sol

source: Unit Testing Plugin
ru_ru: Плагин Unit Testing Plugin

source: Click the double check icon to get to the Solidity Unit Testing plugin.
ru_ru: Щелкните по значку двойной галочки, чтобы перейти к плагину Solidity Unit Testing.

source: If you haven't used this plugin before and are not seeing double check icon, you have to activate it from Remix plugin manager.
ru_ru: Если Вы еще не использовали этот плагин и не видите значок двойной проверки, Вам необходимо активировать его в менеджере плагинов Remix.

source: Go to the plugin manager (by click the plug icon) and load up the unit testing plugin.
ru_ru: Перейдите в менеджер плагинов (щелкнув на значке плагина) и загрузите плагин модульного тестирования.

source: Now double check icon will appear on the left side icon bar. Clicking on icon will load the unit testing module in the side panel.
ru_ru: Теперь на левой боковой панели пиктограмм появится значок двойной проверки. Щелчок на пиктограмме загрузит модуль модульного тестирования в боковую панель.

source: Alternatively, just select Solidity environment from remix IDE home page. This will activate Solidity Unit Testing plugin along with Solidity Compiler, Deploy & Run Transactions & Solidity Static Analysis plugins.
ru_ru: В качестве альтернативы, просто выберите среду Solidity на главной странице remix IDE. Это активирует плагин Solidity Unit Testing, а также плагины Solidity Compiler, Deploy & Run Transactions и Solidity Static Analysis.

source: Generate
ru_ru: Создайте

source: Select a solidity file which you want to test and click on the button Generate. It will generate a new sample solidity test file in the current folder suffixed with _test. This file contains the minimum you need for running unit testing.
ru_ru: Выберите файл solidity, который Вы хотите протестировать, и щелкните на кнопке Generate. В результате будет сгенерирован новый тестовый файл solidity в текущей папке с суффиксом _test. Этот файл содержит минимум, необходимый для выполнения модульного тестирования.

source: Write Tests
ru_ru: Напишите тесты

source: Write tests to check the functionality of your contract. Remix injects a built-in assert library which can be used for testing. Visit the library documentation here.
ru_ru: Пишите тесты для проверки функциональности Вашего контракта. В Remix встроена библиотека assert, которую можно использовать для тестирования. Посетите документацию по библиотеке здесь.

source: Apart from this, Remix allows usage of some special functions to make testing more structural. They are:
ru_ru: Кроме того, Remix позволяет использовать некоторые специальные функции, чтобы сделать тестирование более структурным. К ним относятся:

source: beforeEach() - Runs before each test
ru_ru: beforeEach() - Выполняется перед каждым тестом

source: beforeAll() - Runs before all tests
ru_ru: beforeAll() - Выполняется перед всеми тестами

source: afterEach() - Runs after each test
ru_ru: afterEach() - Выполняется после каждого теста

source: afterAll() - Runs after all tests
ru_ru: afterAll() - Выполняется после всех тестов

source: To get started, see this simple example.
ru_ru: Для начала ознакомьтесь с этим простым примером.

source: Run
ru_ru: Выполните

source: Once you are done with writing tests, select the _test.sol files in the list and click on the button Run to execute the tests in the selected files. The execution will run in a separate environment and the result will be displayed below.
ru_ru: Когда Вы закончите писать тесты, выберите в списке файлы _test.sol и щелкните на кнопке Run, чтобы выполнить тесты в выбранных файлах. Выполнение будет происходить в отдельном окружении, а результат будет показан ниже.

source: If you have selected multiple files to run the tests and want to stop the execution, click on Stop button. It will stop execution after running the tests for current file.
ru_ru: Если Вы выбрали несколько файлов для выполнения тестов и хотите остановить выполнение, щелкните на кнопке Stop. После выполнения тестов для текущего файла выполнение будет остановлено.

source: Customization
ru_ru: Персонализация

source: Remix facilitates users with various types of customizations to test a contract properly.
ru_ru: Remix предоставляет пользователям различные виды настроек для правильного тестирования контракта.

source: 1. Custom Compiler Context
ru_ru: 1. Пользовательский контекст компилятора

source: Solidity Unit Testing refers Solidity Compiler plugin for compiler configurations. One can provide customized inputs for Compiler, EVM Version & Enable Optimization and these will be the configuration settings used for contract compilation before running unit tests.
ru_ru: Solidity Unit Testing использует плагин Solidity Compiler для конфигурации компилятора. Можно задать пользовательские параметры для Compiler, EVM Version & Enable Optimization, и это будут параметры конфигурации, используемые для компиляции контракта перед запуском модульных тестов.

source: 2. Custom Transaction Context
ru_ru: 2. Пользовательский контекст транзакции

source: For a contract method interaction, prime parameters of transaction are from address, value & gas. Usually, we need to test a method's behaviour under different values of these parameters.
ru_ru: При взаимодействии метода с контрактом основными параметрами транзакции являются адрес, значение и газ. Обычно нам необходимо протестировать поведение метода при различных значениях этих параметров.

source: Remix provides the functionality of custom msg.sender & msg.value of transaction using method devdoc like:
ru_ru: Remix предоставляет функциональность пользовательских msg.sender и msg.value транзакции, используя метод devdoc, например:

source: Things to keep in mind while using custom transaction context:
ru_ru: О чем следует помнить при использовании пользовательского контекста транзакции:

source: Parameters must be defined in devdoc of related method
ru_ru: Параметры должны быть определены в devdoc соответствующего метода

source: Each parameter key should be prefixed with a hash (#) and end with a colon following a space (: ) like #sender: & #value:
ru_ru: Каждый ключ параметра должен иметь префикс в виде хэша (#) и заканчиваться двоеточием, следующим за пробелом (: ), например, #sender: & #value:

source: For now, customization is available for parameters sender & value only
ru_ru: На данный момент настройка доступна только для параметров sender & value

source: Sender is from address of a transaction which is accessed using msg.sender inside a contract method. It should be defined in a fixed format as 'account-<account_index>'
ru_ru: Отправитель - это адрес транзакции, доступ к которому осуществляется с помощью msg.sender внутри метода контракта. Он должен быть определен в фиксированном формате как 'account-<account_index>'.

source: <account_index> varies from 0-2 before remix-ide release v0.10.0 and 0-9 afterwards
ru_ru: <account_index> варьируется от 0-2 до выхода remix-ide v0.10.0 и 0-9 после

source: remix_accounts.sol must be imported in your test file to use custom sender
ru_ru: remix_accounts.sol должен быть импортирован в Ваш тестовый файл, чтобы использовать пользовательского отправителя

source: Value is value sent along with a transaction in wei which is accessed using msg.value inside a contract method. It should be a number.
ru_ru: Value - это значение, отправленное вместе с транзакцией в wei, доступ к которому осуществляется с помощью msg.value внутри метода контракта. Оно должно быть числом.

source: Regarding gas, Remix estimates the required gas for each transaction internally. Still if a contract deployment fails with Out-of-Gas error, it tries to redeploy it by doubling the gas. Deployment failing with double gas will show error: contract deployment failed after trying twice: The contract code couldn't be stored, please check your gas limit
ru_ru: Что касается газа, то Ремикс внутренне оценивает необходимый газ для каждой транзакции. Тем не менее, если развертывание контракта завершилось с ошибкой Out-of-Gas, он пытается развернуть его заново, удвоив количество газа. При неудачном развертывании с удвоенным газом будет показана ошибка: Contract deployment failed after attempt twice: The contract code could not be stored, please check your gas limit

source: Various test examples can be seen in examples section.
ru_ru: Различные тестовые примеры Вы можете увидеть в разделе примеров.

source: Points to remember
ru_ru: Что следует помнить

source: A test contract cannot have a method with parameters. Having one such method will show error: Method 'methodname' can not have parameters inside a test contract
ru_ru: Тестовый контракт не может иметь метод с параметрами. Наличие одного такого метода приведет к ошибке: Метод 'methodname' не может иметь параметров внутри тестового контракта

source: Number of test accounts are 3 before remix-ide release v0.10.0 and 10 afterwards
ru_ru: Количество тестовых учетных записей - 3 до выхода remix-ide v0.10.0 и 10 после.

source: A test file which imports remix_accounts.sol might not compile successfully with Solidity Compiler plugin but it will work fine with Solidity Unit Testing plugin.
ru_ru: Тестовый файл, который импортирует remix_accounts.sol, может не скомпилироваться с помощью плагина Solidity Compiler, но он будет прекрасно работать с плагином Solidity Unit Testing.

source: Remix-tests
ru_ru: Ремикс-тесты

source: remix-tests is the module which works underneath of remix-ide Solidity Unit Testing plugin.
ru_ru: remix-tests - это модуль, который работает под плагином remix-ide Solidity Unit Testing.

source: remix-tests is an NPM package. It can also be used as a CLI/CI solution, supporting node.js. Find more information about this type of usage in the remix-tests repository
ru_ru: remix-tests - это пакет NPM. Его также можно использовать в качестве CLI/CI-решения, поддерживающего node.js. Более подробную информацию об этом типе использования Вы найдете в репозитории remix-tests

source: For CI implementation example, see Su Squares contract and Travis build that uses remix-tests for continuous integration testing.
ru_ru: Пример реализации CI смотрите в контракте Su Squares и сборке Travis, использующей remix-tests для тестирования в режиме непрерывной интеграции.
