Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: Validating a transaction takes several seconds. During this time, the GUI shows it in a pending mode. When the transaction is mined, the number of pending transactions is updated and the transaction is added to the log (see terminal).
ru_ru: Валидация транзакции занимает несколько секунд. В течение этого времени графический интерфейс отображает ее в режиме ожидания. Когда транзакция будет отработана, количество отложенных транзакций обновится, и транзакция будет добавлена в журнал (см. терминал).

source: Using the ABI
ru_ru: Использование ABI

source: Using Deploy or At Address is a classic use case of Remix. However, it is possible to interact with a contract by using its ABI. The ABI is a JSON array which describe its interface.
ru_ru: Использование Deploy или At Address - это классический случай использования Remix. Однако можно взаимодействовать с контрактом, используя его ABI. ABI - это массив JSON, который описывает его интерфейс.

source: To interact with a contract using the ABI, create a new file in Remix with extension *.abi and copy the ABI content to it. Then, in the input next to At Address, put the Address of the contract you want to interact with. Click on At Address, a new "connection" with the contract will popup below.
ru_ru: Чтобы взаимодействовать с контрактом с помощью ABI, создайте в Remix новый файл с расширением *.abi и скопируйте в него содержимое ABI. Затем, в поле ввода рядом с At Address, поместите адрес контракта, с которым Вы хотите взаимодействовать. Щелкните на At Address, и ниже появится новое "соединение" с контрактом.

source: Using the Recorder
ru_ru: Использование магнитофона

source: The Recorder is a tool used to save a bunch of transactions in a JSON file and rerun them later either in the same environment or in another.
ru_ru: Recorder - это инструмент, используемый для сохранения набора транзакций в JSON-файле и повторного их выполнения позже либо в той же среде, либо в другой.

source: Saving to the JSON file ( by default its called scenario.json) allows one to easily check the transaction list, tweak input parameters, change linked library, etc...
ru_ru: Сохранение в JSON-файл (по умолчанию он называется scenario.json) позволяет легко проверить список транзакций, подправить входные параметры, изменить связанную библиотеку и т.д..

source: There are many use cases for the recorder.
ru_ru: Существует множество вариантов использования диктофона.

source: For instance:
ru_ru: Например:

source: After having coded and tested contracts in a constrained environment (like the JavaScript VM), you could then change the environment and redeploy it to a more realistic environment like a test net with an injected web3 or to a Geth node. By using the generated scenario.json file, you will be using all the same settings that you used in the Javascript VM. And this mean that you won't need to click the interface 100 times or whatever to get the state that you achieved originally. So the recorder could be a tool to protect your sanity.
ru_ru: После разработки и тестирования контрактов в ограниченной среде (например, в ВМ JavaScript), Вы можете изменить среду и развернуть их в более реалистичной среде, например, в тестовой сети с внедренным web3 или на узле Geth. Используя сгенерированный файл scenario.json, Вы будете применять все те же настройки, которые Вы использовали в Javascript VM. А это означает, что Вам не нужно будет 100 раз нажимать на интерфейс или что-то еще, чтобы получить то состояние, которого Вы достигли первоначально. Таким образом, диктофон может стать инструментом, защищающим Ваше здравомыслие.

source: You can also change the settings in the scenario.json file to customize the playback.
ru_ru: Вы также можете изменить параметры в файле scenario.json, чтобы настроить воспроизведение.

source: Deploying contract does often require more than creating one transaction and so the recorder will automate this deployment.
ru_ru: Развертывание контракта часто требует большего, чем создание одной транзакции, поэтому регистратор автоматизирует это развертывание.

source: Working in a dev environment often requires to setup the state in a first place.
ru_ru: Работа в среде dev часто требует в первую очередь настроить состояние.

source: To create this file in the recorder, you first of course need to have run some transactions. In the image above - it has a 0 next to Transactions Recorded. So this isn't the right moment to save transactions because - well because there aren't any. Each time you make a transaction, that number will increment. Then when you are ready, click the floppy disk icon and the scenario.json file will be created.
ru_ru: Чтобы создать этот файл в рекордере, Вам, конечно же, сначала нужно провести несколько транзакций. На изображении выше - рядом с Transactions Recorded стоит 0. Таким образом, сейчас не самый подходящий момент для сохранения транзакций, потому что - ну, потому что их нет. Каждый раз, когда Вы выполняете транзакцию, это число будет увеличиваться. Затем, когда Вы будете готовы, щелкните на значке дискеты, и будет создан файл scenario.json.

source: The JSON file below is an example of the scenario.json file.
ru_ru: Приведенный ниже JSON-файл является примером файла scenario.json.

source: In it, 3 transactions are executed:
ru_ru: В нем выполняются 3 транзакции:

source: The first corresponds to the deployment of the lib testLib.
ru_ru: Первый соответствует развертыванию библиотеки testLib.

source: The second corresponds to the deployment of the contract test with the first parameter of the constructor set to 11. That contract depends on a library. The linkage is done using the property linkReferences. In that case we use the address of the previously created library : created{1512830014773}. The number is the id (timestamp) of the transaction that led to the creation of the library.
ru_ru: Второй соответствует развертыванию теста контракта с первым параметром конструктора, установленным в значение 11. Этот контракт зависит от библиотеки. Связывание осуществляется с помощью свойства linkReferences. В этом случае мы используем адрес ранее созданной библиотеки : created{1512830014773}. Число - это id (временная метка) транзакции, которая привела к созданию библиотеки.

source: The third record corresponds to the call to the function set of the contract test (the property to is set to: created{1512830015080}) . Input parameters are 1 and 0xca35b7d915458ef540ade6068dfe2f44e8fa733c
ru_ru: Третья запись соответствует вызову набора функций теста контракта (свойство to установлено в: created{1512830015080}) . Входными параметрами являются 1 и 0xca35b7d915458ef540ade6068dfe2f44e8fa733c

source: All these transactions are created using the value of the accounts account{0}.
ru_ru: Все эти транзакции создаются с использованием значения счета{0}.

source: Settings
ru_ru: Настройки

source: To get to Settings click the gear a the very bottom of the icon panel.
ru_ru: Чтобы перейти к Настройкам, щелкните на шестеренке в самом низу панели пиктограмм.

source: You can find a link to the homepage (if you closed it) as well as a link to our Gitter Channel and for you aesthetes out there, we now have a rather large list of themes.
ru_ru: Вы можете найти ссылку на домашнюю страницу (если Вы ее закрыли), а также ссылку на наш Gitter-канал, и для Вас, эстеты, у нас теперь есть довольно большой список тем.

source: Another important settings:
ru_ru: Еще один важный параметр:

source: Text wrap: controls if the text in the editor should be wrapped.
ru_ru: Обертывание текста: контролирует, должен ли текст в редакторе быть обернут.

source: Enable optimization: defines if the compiler should enable optimization during compilation. Enabling this option saves execution gas. It is useful to enable optimization for contracts ready to be deployed in production but could lead to some inconsistencies when debugging such a contract.
ru_ru: Включить оптимизацию: определяет, должен ли компилятор включать оптимизацию во время компиляции. Включение этой опции экономит время выполнения. Включение оптимизации полезно для контрактов, готовых к внедрению в производство, но может привести к некоторым несоответствиям при отладке такого контракта.

source: Solidity Editor
ru_ru: Редактор Solidity

source: The Remix editor recompiles the code each time the current file is changed or another file is selected. It also provides syntax highlighting mapped to solidity keywords.
ru_ru: Редактор Remix перекомпилирует код каждый раз, когда изменяется текущий файл или выбирается другой файл. Он также обеспечивает подсветку синтаксиса, сопоставленную с ключевыми словами Solidity.

source: Here's the list of some important features:
ru_ru: Вот список некоторых важных особенностей:

source: It display opened files as tabs.
ru_ru: Он отображает открытые файлы в виде вкладок.

source: Compilation Warning and Error are displayed in the gutter
ru_ru: Предупреждение и ошибка компиляции отображаются в желобе

source: Remix saves the current file continuously (5s after the last changes)
ru_ru: Remix сохраняет текущий файл непрерывно (через 5 с после последних изменений)

source: +/- on the top left corner enable you to increase/decrease the font size of the editor
ru_ru: +/- в левом верхнем углу позволяют Вам увеличить/уменьшить размер шрифта редактора

source: Solidity Static Analysis
ru_ru: Статический анализ Solidity

source: Static code analysis is a process to debug the code by examining it and without actually executing the code.
ru_ru: Статический анализ кода - это процесс отладки кода путем его изучения и без реального выполнения кода.

source: Solidity Static Analysis plugin performs static analysis on Solidity smart contracts once they are compiled. It checks for security vulnerabilities and bad development practices, among other issues. This plugin comes with Solidity environment of Remix IDE. It can also be activated individually from Plugin Manager.
ru_ru: Плагин Solidity Static Analysis выполняет статический анализ смарт-контрактов Solidity после их компиляции. Он проверяет, в частности, уязвимости в системе безопасности и плохую практику разработки. Этот плагин поставляется вместе со средой Solidity среды Remix IDE. Его также можно активировать отдельно из Менеджера плагинов.

source: How to use
ru_ru: Как использовать

source: If you select this plugin, you will see a number of modules listed along with checkboxes, one Auto run checkbox and a Run button.
ru_ru: Если Вы выберете этот плагин, то увидите ряд модулей, перечисленных вместе с флажками, один флажок Auto run и кнопку Run.

source: By default, all modules are selected for analysis and a new analysis is performed at each compilation.
ru_ru: По умолчанию для анализа выбираются все модули, и при каждой компиляции выполняется новый анализ.

source: One can select/deselect the modules under which contract should be analyzed and can run the analysis again for last compiled contract by clicking on Run.
ru_ru: Можно выбрать/отменить выбор модулей, по которым должен быть проанализирован контракт, и запустить анализ еще раз для последнего скомпилированного контракта, нажав на кнопку Run.

source: If you don't want to run analysis each time you compile a contract, just uncheck the checkbox near to Auto run.
ru_ru: Если Вы не хотите запускать анализ каждый раз, когда составляете контракт, просто снимите флажок рядом с пунктом Автозапуск.

source: Analysis Modules
ru_ru: Модули анализа

source: Currently, with Remix IDE v0.10.1, there are 21 analysis modules listed under 4 categories. Categories are: Security, Gas & Economy, ERC & Miscellaneous.
ru_ru: В настоящее время в Remix IDE v0.10.1 имеется 21 модуль анализа, перечисленный в 4 категориях. Категориями являются: Безопасность, Газ и экономика, ERC и Разное.

source: Here is the list of modules under each category along with the example code which should be avoided or used very carefully while development:
ru_ru: Здесь приведен список модулей в каждой категории вместе с примерами кода, которых следует избегать или использовать очень осторожно при разработке:

source: Category: Security
ru_ru: Категория: Безопасность Безопасность

source: Transaction origin: 'tx.origin' is used
ru_ru: Происхождение транзакции: используется 'tx.origin'

source: tx.origin is useful only in very exceptional cases. If you use it for authentication, you usually want to replace it by "msg.sender", because otherwise any contract you call can act on your behalf.
ru_ru: tx.origin полезен только в очень исключительных случаях. Если Вы используете его для аутентификации, Вы обычно хотите заменить его на "msg.sender", потому что в противном случае любой контракт, который Вы вызываете, может действовать от Вашего имени.

source: Example:
ru_ru: Пример:

source: Check effects: Potential reentrancy bugs
ru_ru: Контрольные эффекты: Потенциальные ошибки реентерабельности

source: Potential Violation of Checks-Effects-Interaction pattern can lead to re-entrancy vulnerability.
ru_ru: Потенциальное нарушение шаблона Checks-Effects-Interaction может привести к уязвимости re-entrancy.

source: Inline assembly: Inline assembly used
ru_ru: Поточная сборка: Используется последовательная сборка

source: Use of inline assembly is advised only in rare cases.
ru_ru: Использование поточной сборки рекомендуется только в редких случаях.

source: Block timestamp: Semantics maybe unclear
ru_ru: Временная метка блока: Семантика может быть неясной

source: now does not mean current time. now is an alias for block.timestamp. block.timestamp can be influenced by miners to a certain degree, be careful.
ru_ru: now не означает текущее время. now - это псевдоним для block.timestamp. block.timestamp может быть в определенной степени подвержен влиянию майнеров, будьте осторожны.

source: Low level calls: Semantics maybe unclear
ru_ru: Вызовы низкого уровня: Семантика может быть неясной

source: Use of low level call, callcode or delegatecall should be avoided whenever possible. send does not throw an exception when not successful, make sure you deal with the failure case accordingly. Use transfer whenever failure of the ether transfer should rollback the whole transaction.
ru_ru: Использование низкоуровневых вызовов, callcode или delegatecall следует избегать, когда это возможно. send не выбрасывает исключение в случае неудачи, убедитесь, что Вы соответствующим образом справляетесь со случаем неудачи. Используйте transfer во всех случаях, когда неудача в передаче эфира должна привести к откату всей транзакции.

source: Blockhash usage: Semantics maybe unclear
ru_ru: Использование блокчейна: Семантика может быть неясной

source: blockhash is used to access the last 256 block hashes. A miner computes the block hash by "summing up" the information in the current block mined. By summing up the information in a clever way a miner can try to influence the outcome of a transaction in the current block.
ru_ru: blockhash используется для доступа к последним 256 хэшам блоков. Майнер вычисляет хэш блока путем "суммирования" информации в текущем добываемом блоке. Суммируя информацию хитрым способом, майнер может попытаться повлиять на исход транзакции в текущем блоке.

source: Selfdestruct: Beware of caller contracts
ru_ru: Самоуничтожение: Остерегайтесь контрактов с абонентами

source: selfdestruct can block calling contracts unexpectedly. Be especially careful if this contract is planned to be used by other contracts (i.e. library contracts, interactions). Selfdestruction of the callee contract can leave callers in an inoperable state.
ru_ru: самоуничтожение может неожиданно заблокировать вызывающие контракты. Будьте особенно осторожны, если этот контракт планируется использовать другими контрактами (например, библиотечными контрактами, взаимодействиями). Самоуничтожение контракта-получателя может привести к тому, что вызывающие контракты окажутся в неработоспособном состоянии.

source: Category: Gas & Economy
ru_ru: Категория: Газ и экономика

source: Gas costs: Too high gas requirement of functions
ru_ru: Расходы на газ: Слишком высокая потребность функций в газе

source: If the gas requirement of a function is higher than the block gas limit, it cannot be executed. Please avoid loops in your functions or actions that modify large areas of storage
ru_ru: Если потребность функции в газе превышает предельное значение газа блока, она не может быть выполнена. Пожалуйста, избегайте циклов в Ваших функциях или действий, которые изменяют большие области хранения

source: This on local calls: Invocation of local functions via 'this'
ru_ru: This при локальных вызовах: Вызов локальных функций через 'this'

source: Never use this to call functions in the same contract, it only consumes more gas than normal local calls.
ru_ru: Никогда не используйте эту функцию для вызова функций в рамках одного контракта, она только расходует больше бензина, чем обычные местные звонки.

source: Delete on dynamic Array: Use require/assert appropriately
ru_ru: Delete на динамическом массиве: Используйте require/assert соответствующим образом

source: The delete operation when applied to a dynamically sized array in Solidity generates code to delete each of the elements contained. If the array is large, this operation can surpass the block gas limit and raise an OOG exception. Also nested dynamically sized objects can produce the same results.
ru_ru: Операция delete при применении к массиву динамического размера в Solidity генерирует код для удаления каждого из содержащихся в нем элементов. Если массив большой, эта операция может превысить лимит блочного газа и вызвать исключение OOG. Кроме того, вложенные объекты динамического размера могут привести к тем же результатам.

source: For loop over dynamic array: Iterations depend on dynamic array's size
ru_ru: Цикл For над динамическим массивом: Итерации зависят от размера динамического массива

source: Loops that do not have a fixed number of iterations, for example, loops that depend on storage values, have to be used carefully: Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can stall the complete contract at a certain point. Additionally, using unbounded loops can incur in a lot of avoidable gas costs. Carefully test how many items at maximum you can pass to such functions to make it successful.
ru_ru: Циклы, не имеющие фиксированного числа итераций, например, циклы, зависящие от значений хранилища, должны использоваться осторожно: Из-за ограничения количества газа в блоке транзакции могут потреблять только определенное количество газа. Количество итераций в цикле может вырасти за пределы лимита блочного газа, что может застопорить выполнение всего контракта в определенный момент. Кроме того, использование неограниченных циклов может привести к большим затратам газа, которых можно избежать. Тщательно проверьте, какое максимальное количество элементов Вы можете передать таким функциям, чтобы они были успешными.

source: Ether transfer in loop: Transferring Ether in a for/while/do-while loop
ru_ru: Передача Эфира в цикле: Передача эфира в цикле for/while/do-while

source: Ether payout should not be done in a loop. Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can cause the complete contract to be stalled at a certain point. If required, make sure that number of iterations are low and you trust each address involved.
ru_ru: Выплата Эфира не должна осуществляться в цикле. Из-за лимита блочного газа транзакции могут потреблять только определенное количество газа. Количество итераций в цикле может вырасти за пределы лимита блочного газа, что может привести к остановке всего контракта в определенный момент. Если необходимо, убедитесь, что количество итераций невелико, и Вы доверяете каждому задействованному адресу.

source: Category: ERC
ru_ru: Категория: ERC

source: ERC20: 'decimals' should be 'uint8'
ru_ru: ERC20: 'decimals' должно быть 'uint8'.

source: ERC20 Contracts decimals function should have uint8 as return type.
ru_ru: Функция ERC20 Contracts decimals должна иметь в качестве возвращаемого типа uint8.

source: Category: Miscellaneous
ru_ru: Категория: Разное

source: Constant/View/Pure functions: Potentially constant/view/pure functions
ru_ru: Потенциально константные/прозрачные/чистые функции: Потенциально постоянные/прозрачные/чистые функции

source: It warns for the methods which potentially should be constant/view/pure but are not.
ru_ru: Он предупреждает о методах, которые потенциально должны быть постоянными/видными/чистыми, но не являются таковыми.

source: Similar variable names: Variable names are too similar
ru_ru: Похожие имена переменных: Имена переменных слишком похожи

source: It warns on the usage of similar variable names.
ru_ru: Это предупреждает об использовании одинаковых имен переменных.

source: No return: Function with 'returns' not returning
ru_ru: Не возвращается: Функция с 'returns' не возвращается

source: It warns for the methods which define a return type but never explicitly return a value.
ru_ru: Он предупреждает о методах, которые определяют возвращаемый тип, но никогда не возвращают значение в явном виде.

source: Guard conditions: Use 'require' and 'assert' appropriately
ru_ru: Охраняйте условия: Используйте 'require' и 'assert' надлежащим образом

source: Use assert(x) if you never ever want x to be false, not in any circumstance (apart from a bug in your code). Use require(x) if x can be false, due to e.g. invalid input or a failing external component.
ru_ru: Используйте assert(x), если Вы никогда не хотите, чтобы x было ложным, ни при каких обстоятельствах (кроме ошибки в Вашем коде). Используйте require(x), если x может быть ложным, например, из-за некорректного ввода или неработающего внешнего компонента.

source: Result not used: The result of an operation not used
ru_ru: Результат не используется: Результат операции не используется

source: A binary operation yields a value that is not used in the following. This is often caused by confusing assignment (=) and comparison (==).
ru_ru: Бинарная операция дает значение, которое не используется в последующем. Это часто происходит из-за путаницы между присваиванием (=) и сравнением (==).

source: String Length: Bytes length != String length
ru_ru: Длина строки: Длина байта != Длина строки

source: Bytes and string length are not the same since strings are assumed to be UTF-8 encoded (according to the ABI defintion) therefore one character is not nessesarily encoded in one byte of data.
ru_ru: Байт и длина строки - не одно и то же, поскольку предполагается, что строки кодируются в UTF-8 (в соответствии с определением ABI), поэтому один символ не обязательно кодируется в одном байте данных.

source: Delete from dynamic array: 'delete' on an array leaves a gap
ru_ru: Удаление из динамического массива: 'delete' в массиве оставляет пробел

source: Using delete on an array leaves a gap. The length of the array remains the same. If you want to remove the empty position you need to shift items manually and update the length property.
ru_ru: Использование delete в массиве оставляет пробел. Длина массива остается неизменной. Если Вы хотите удалить пустую позицию, Вам необходимо вручную сдвинуть элементы и обновить свойство length.

source: Data Truncated: Division on int/uint values truncates the result
ru_ru: Усечение данных: Деление на int/uint значения усекает результат
