Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: ru_ru

source: remix: Ethereum IDE and tools for the web.
ru_ru: remix: Ethereum IDE и инструменты для Web.

source: web3: The web3.js library is a collection of modules which contain specific functionality for the ethereum ecosystem.
ru_ru: web3: Библиотека web3.js представляет собой набор модулей, которые содержат специфическую функциональность для экосистемы ethereum.

source: swarmgw: This library can be used to upload/download files to Swarm via https://swarm-gateways.net/.
ru_ru: swarmgw: Эта библиотека может использоваться для загрузки/выгрузки файлов в Swarm через https://swarm-gateways.net/.

source: Here's the list of commands
ru_ru: Вот список команд

source: remix.debug(hash): Start debugging a transaction.
ru_ru: remix.debug(hash): Начните отладку транзакции.

source: remix.debugHelp(): Display help message for debugging
ru_ru: remix.debugHelp(): Отображение справочного сообщения для отладки

source: remix.execute(filepath): Run the script specified by file path. If filepath is empty, script currently displayed in the editor is executed.
ru_ru: remix.execute(filepath): Выполните скрипт, указанный путем к файлу. Если filepath пуст, то выполняется скрипт, отображаемый в данный момент в редакторе.

source: remix.exeCurrent(): Run the script currently displayed in the editor.
ru_ru: remix.exeCurrent(): Запустите скрипт, который в данный момент отображается в редакторе.

source: remix.getFile(path): Returns the content of the file located at the given path
ru_ru: remix.getFile(path): Возвращает содержимое файла, расположенного по заданному пути

source: remix.help(): Display this help message.
ru_ru: remix.help(): Выведите на экран это справочное сообщение.

source: remix.loadgist(id): Load a gist in the file explorer.
ru_ru: remix.loadgist(id): Загрузите gist в файловый проводник.

source: remix.loadurl(url): Load the given url in the file explorer. The url can be of type github, swarm or ipfs.
ru_ru: remix.loadurl(url): Загрузите заданный url в файловый проводник. url может быть типа github, swarm или ipfs.

source: remix.setFile(path, content): set the content of the file located at the given path
ru_ru: remix.setFile(path, content): установить содержимое файла, расположенного по заданному пути

source: remix.setproviderurl(url): Change the current provider to Web3 provider and set the url endpoint.
ru_ru: remix.setproviderurl(url): Измените текущий провайдер на провайдер Web3 и установите конечную точку url.

source: swarmgw.get(url, cb): Download files from Swarm via https**://swarm-gateways.net/
ru_ru: swarmgw.get(url, cb): Загрузите файлы из Swarm через https**://swarm-gateways.net/

source: swarmgw.put(content, cb): Upload files to Swarm via https**://swarm-gateways.net/
ru_ru: swarmgw.put(content, cb): Загрузите файлы в Swarm через https**://swarm-gateways.net/

source: ethers.Contract: This API provides a graceful connection to a contract deployed on the blockchain, simplifying calling and querying its functions and handling all the binary protocol and conversion as necessarily.
ru_ru: ethers.Contract: Этот API обеспечивает изящное соединение с контрактом, развернутым на блокчейне, упрощая вызов и запрос его функций и обрабатывая все бинарные протоколы и преобразования по мере необходимости.

source: ethers.HDNode: A Hierarchical Deterministic Wallet represents a large tree of private keys which can reliably be reproduced from an initial seed.
ru_ru: ethers.HDNode: Иерархический детерминированный кошелек представляет собой большое дерево закрытых ключей, которые могут быть надежно воспроизведены из начального семени.

source: ethers.Interface: The Interface Object is a meta-class that accepts a Solidity (or compatible) Application Binary Interface (ABI) and populates functions to deal with encoding and decoding the parameters to pass in and results returned.
ru_ru: ethers.Interface: Объект интерфейса - это мета-класс, который принимает бинарный интерфейс приложения (ABI) Solidity (или совместимый с ним) и наполняет его функциями для работы с кодированием и декодированием передаваемых параметров и возвращаемых результатов.

source: ethers.providers: A Provider abstracts a connection to the Ethereum blockchain, for issuing queries and sending state changing transactions.
ru_ru: ethers.providers: Провайдер абстрагирует соединение с блокчейном Ethereum для выдачи запросов и отправки транзакций, изменяющих состояние.

source: ethers.SigningKey: The SigningKey interface provides an abstraction around the secp256k1 elliptic curve cryptography library.
ru_ru: ethers.SigningKey: Интерфейс SigningKey обеспечивает абстракцию вокруг библиотеки криптографии эллиптических кривых secp256k1.

source: ethers.utils: The utility functions exposed in both the ethers umbrella package and the ethers-utils.
ru_ru: ethers.utils: Утилитарные функции, представленные как в пакете ethers umbrella, так и в пакете ethers-utils.

source: ethers.utils.AbiCoder: Create a new ABI Coder object
ru_ru: ethers.utils.AbiCoder: Создайте новый объект ABI Coder

source: ethers.utils.RLP: This encoding method is used internally for several aspects of Ethereum, such as encoding transactions and determining contract addresses.
ru_ru: ethers.utils.RLP: Этот метод кодирования используется внутри Ethereum для нескольких аспектов, таких как кодирование транзакций и определение адресов контрактов.

source: ethers.Wallet: A wallet manages a private/public key pair which is used to cryptographically sign transactions and prove ownership on the Ethereum network.
ru_ru: ethers.Wallet: Кошелек управляет парой закрытый/публичный ключ, которая используется для криптографической подписи транзакций и подтверждения права собственности в сети Ethereum.

source: ethers.version: Contains the version of the ethers container object.
ru_ru: ethers.version: Содержит версию объекта контейнера ethers.

source: web3.bzz: Bzz module for interacting with the swarm network.
ru_ru: web3.bzz: Модуль Bzz для взаимодействия с сетью роя.

source: web3.eth: Eth module for interacting with the Ethereum network.
ru_ru: web3.eth: Eth-модуль для взаимодействия с сетью Ethereum.

source: web3.eth.accounts: The web3.eth.accounts contains functions to generate Ethereum accounts and sign transactions and data.
ru_ru: web3.eth.accounts: В web3.eth.accounts содержатся функции для генерации учетных записей Ethereum и подписания транзакций и данных.

source: web3.eth.abi: The web3.eth.abi functions let you de- and encode parameters to ABI (Application Binary Interface) for function calls to the EVM (Ethereum Virtual Machine).
ru_ru: web3.eth.abi: Функции web3.eth.abi позволяют Вам де- и кодировать параметры в ABI (Application Binary Interface) для вызовов функций к EVM (Ethereum Virtual Machine).

source: web3.eth.ens: The web3.eth.ens functions let you interacting with ENS.
ru_ru: web3.eth.ens: Функции web3.eth.ens позволяют Вам взаимодействовать с ENS.

source: web3.eth.Iban: The web3.eth.Iban function lets convert Ethereum addresses from and to IBAN and BBAN.
ru_ru: web3.eth.Iban: Функция web3.eth.Iban позволяет конвертировать адреса Ethereum из IBAN и BBAN в IBAN.

source: web3.eth.net: Net module for interacting with network properties.
ru_ru: web3.eth.net: Net-модуль для взаимодействия со свойствами сети.

source: web3.eth.personal: Personal module for interacting with the Ethereum accounts.
ru_ru: web3.eth.personal: Персональный модуль для взаимодействия со счетами Ethereum.

source: web3.eth.subscribe: The web3.eth.subscribe function lets you subscribe to specific events in the blockchain.
ru_ru: web3.eth.subscribe: Функция web3.eth.subscribe позволяет Вам подписаться на определенные события в блокчейне.

source: web3.givenProvider: When using web3.js in an Ethereum compatible browser, it will set with the current native provider by that browser. Will return the given provider by the (browser) environment, otherwise null.
ru_ru: web3.givenProvider: При использовании web3.js в браузере, совместимом с Ethereum, будет установлен текущий собственный провайдер этого браузера. Вернет заданный провайдер в среде (браузера), иначе null.

source: web3.modules: Contains the version of the web3 container object.
ru_ru: web3.modules: Содержит версию объекта контейнера web3.

source: web3.providers: Contains the current available providers.
ru_ru: web3.providers: Содержит текущие доступные провайдеры.

source: web3.shh: Shh module for interacting with the whisper protocol
ru_ru: web3.shh: Модуль Shh для взаимодействия с протоколом whisper

source: web3.utils: This package provides utility functions for Ethereum dapps and other **web3.js packages.
ru_ru: web3.utils: Этот пакет предоставляет служебные функции для Ethereum dapps и других пакетов **web3.js.

source: web3.version: Contains the version of the web3 container object.
ru_ru: web3.version: Содержит версию объекта контейнера web3.

source: web3.eth.clearSubscriptions();: Resets subscriptions.
ru_ru: web3.eth.clearSubscriptions();: Сбрасывает подписки.

source: web3.eth.Contract(jsonInterface[, address][, options]): The **web3.eth.Contract object makes it easy to interact with smart contracts on the ethereum blockchain.
ru_ru: web3.eth.Contract(jsonInterface[, address][, options]): Объект **web3.eth.Contract упрощает взаимодействие со смарт-контрактами на блокчейне ethereum.

source: web3.eth.accounts.create([entropy]);: The web3.eth.accounts contains functions to generate Ethereum accounts and sign transactions and data.
ru_ru: web3.eth.accounts.create([entropy]);: В web3.eth.accounts содержатся функции для создания счетов Ethereum и подписания транзакций и данных.

source: Remixd: Access your Local Filesystem
ru_ru: Remixd: Доступ к Вашей локальной файловой системе

source: To give the Remix-ide (the web app) access to a folder on your local computer, you need to use remixd.
ru_ru: Чтобы предоставить Ремикс-идее (веб-приложению) доступ к папке на Вашем локальном компьютере, Вам необходимо использовать remixd.

source: remixd is both the name of an npm module and the name of a Remix-plugin. You need to install the plugin (from the plugin manager) and you need to install the remixd npm module.
ru_ru: remixd - это и название npm-модуля, и название Remix-плагина. Вам необходимо установить плагин (из менеджера плагинов) и Вам необходимо установить npm-модуль remixd.

source: NOTE: you need to install the remixd npm module & Run its command before activating the remixd plugin.
ru_ru: ПРИМЕЧАНИЕ: Вам необходимо установить модуль remixd npm и выполнить его команду перед активацией плагина remixd.

source: The code of remixd is here .
ru_ru: Код программы remixd находится здесь .

source: remixd Installation
ru_ru: remixd Установка

source: remixd can be globally installed using the following command: npm install -g remixd
ru_ru: remixd может быть установлен глобально с помощью следующей команды: npm install -g remixd.

source: Or just install it in the directory of your choice by removing the -g flag: npm install remixd
ru_ru: Или просто установите его в выбранную Вами директорию, убрав флаг -g: npm install remixd

source: remixd Command
ru_ru: Команда remixd

source: From the terminal, the command remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> will start remixd and will share the given folder with remix-ide.
ru_ru: В терминале выполните команду remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> , которая запустит remixd и предоставит указанную папку в общий доступ remix-ide.

source: For example, to use remixd with Remix IDE, use this command: remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org
ru_ru: Например, чтобы использовать remixd с Remix IDE, используйте эту команду: remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org.

source: Make sure that if you use https://remix.ethereum.org (secure http) in the remixd command (like in the example above), that you are also pointing your browser to https://remix.ethereum.org and not to http://remix.ethereum.org (plain old insecure http). Or if you want to use http in the browser use http in the remixd command.
ru_ru: Убедитесь, что если Вы используете https://remix.ethereum.org (безопасный http) в команде remixd (как в примере выше), то Вы также указываете браузеру на https://remix.ethereum.org, а не на http://remix.ethereum.org (обычный небезопасный http). Или, если Вы хотите использовать http в браузере, используйте http в команде remixd.

source: The folder is shared using a websocket connection between Remix IDE and remixd.
ru_ru: Общий доступ к папке осуществляется с помощью websocket-соединения между Remix IDE и remixd.

source: Be sure the user executing remixd has read/write permission on the folder.
ru_ru: Убедитесь, что пользователь, выполняющий remixd, имеет права на чтение/запись папки.

source: There is an option to run remixd in read-only mode, use --read-only flag.
ru_ru: Существует возможность запуска remixd в режиме только для чтения, используйте флаг --read-only.

source: Warning!
ru_ru: Внимание!

source: remixd provides full read and write access to the given folder for any application that can access the TCP port 65520 on your local host.
ru_ru: remixd обеспечивает полный доступ на чтение и запись к заданной папке для любого приложения, которое может получить доступ к TCP-порту 65520 на Вашем локальном хосте.

source: After the command is running, activate the remixd plugin.
ru_ru: После выполнения команды активируйте плагин remixd.

source: From Remix IDE, in the Plugin Manager, activate the remixd plugin. This plugin is a websocket plugin and it has no UI other than a modal dialog box.
ru_ru: В Remix IDE, в Менеджере плагинов, активируйте плагин remixd. Этот плагин представляет собой плагин для работы с веб-сокетами, и у него нет никакого пользовательского интерфейса, кроме модального диалогового окна.

source: This modal will ask confirmation
ru_ru: Этот модальный запрос запросит подтверждение

source: Accepting this dialog will start a session.
ru_ru: Принятие этого диалога приведет к началу сессии.

source: If you do not have remixd running in the background - another modal will open up and it will say:
ru_ru: Если у Вас не запущен remixd в фоновом режиме, откроется другой модальный экран, в котором будет написано:

source: Assuming you don't get the 2nd modal, your connection to the remixd daemon is successful. The shared folder will be available in the file explorer.
ru_ru: Если Вы не получили 2-го модального окна, то Ваше подключение к демону remixd прошло успешно. Общая папка будет доступна в файловом проводнике.

source: When you click the activation of remixd is successful - there will NOT be an icon that loads in the icon panel.
ru_ru: Когда Вы нажмете кнопку активации remixd успешно - в панели значков НЕ будет загружаться значок.

source: Click the File Explorers icon and in the swap panel you should now see the folder for localhost.
ru_ru: Щелкните на пиктограмме File Explorers, и теперь на панели подкачки Вы должны увидеть папку для localhost.

source: Click on the localhost connection icon:
ru_ru: Щелкните на значке подключения localhost:

source: Remix Github Tutorials
ru_ru: Ремикс учебников Github

source: There are a series of tutorials in our github repo remix-workshops.
ru_ru: В нашем github-репо remix-workshops есть серия обучающих уроков.

source: We are in the process of upgrading these tutorials to use the new Remix layout.
ru_ru: Мы находимся в процессе обновления этих руководств для использования нового макета Remix.

source: In this repo there tutorials for all levels.
ru_ru: В этом репозитории есть учебники для всех уровней.

source: There are tutorials for specific remix functionalities like:
ru_ru: Существуют учебные пособия по конкретным функциональным возможностям ремикса, например:

source: Deploying
ru_ru: Развертывание

source: Testing
ru_ru: Тестирование

source: Remix Plugin Development
ru_ru: Разработка плагинов Remix

source: Other
ru_ru: Другие

source: Additional external workshops
ru_ru: Дополнительные внешние семинары

source: The Deploy & Run module allows you to send transactions to the current environment.
ru_ru: Модуль Deploy & Run позволяет Вам отправлять транзакции в текущую среду.

source: To use this module, you need to have a contract compiled. So, if there is a contract name in the <b>CONTRACT</b> select box (the select box is under the VALUE input field), you can use this module. If nothing is there or you do not see the contract you want, you need to select a contract in the editor to make it active, go to a compiler module and compile it, and then come back to Deploy & Run.
ru_ru: Чтобы использовать этот модуль, у Вас должен быть составлен контракт. Итак, если в поле выбора <b>CONTRACT</b> (поле выбора находится под полем ввода VALUE) есть название контракта, то Вы можете использовать этот модуль. Если там ничего нет или Вы не видите нужного контракта, Вам нужно выбрать контракт в редакторе, чтобы сделать его активным, перейти к компилятору модуля и скомпилировать его, а затем вернуться в Deploy & Run.

source: Environment
ru_ru: Окружающая среда

source: JavaScript VM: All the transactions will be executed in a sandbox blockchain in the browser. This means nothing will be persisted when you reload the page. The JsVM is its own blockchain and on each reload it will start a new blockchain, the old one will not be saved.
ru_ru: JavaScript VM: Все транзакции будут выполняться в блокчейн-песочнице в браузере. Это означает, что при перезагрузке страницы ничего не будет сохранено. JsVM - это свой собственный блокчейн, и при каждой перезагрузке он будет начинать новый блокчейн, старый не будет сохранен.

source: Injected Provider: Remix will connect to an injected web3 provider. Metamask is an example of a provider that inject web3.
ru_ru: Инжектируемый провайдер: Remix будет подключаться к инжектируемому провайдеру web3. Metamask является примером провайдера, который инжектирует web3.

source: Web3 Provider: Remix will connect to a remote node. You will need to provide the URL to the selected provider: geth, parity or any Ethereum client.
ru_ru: Провайдер Web3: Remix подключится к удаленному узлу. Вам нужно будет предоставить URL-адрес выбранного провайдера: geth, parity или любого клиента Ethereum.

source: More about Web3 Provider
ru_ru: Подробнее о Web3 Provider

source: If you are using Geth & https://remix.ethereum.org, please use the following Geth command to allow requests from Remix:
ru_ru: Если Вы используете Geth и https://remix.ethereum.org, пожалуйста, используйте следующую команду Geth для разрешения запросов из Remix:

source: Also see Geth Docs about the rpc server
ru_ru: Также смотрите Geth Docs о rpc-сервере

source: To run Remix using https://remix.ethereum.org & a local test node, use this Geth command:
ru_ru: Чтобы запустить Remix с помощью https://remix.ethereum.org и локального тестового узла, используйте эту команду Geth:

source: If you are using remix-alpha or a local version of remix - replace the url of the --rpccorsdomain with the url of Remix that you are using.
ru_ru: Если Вы используете remix-alpha или локальную версию remix - замените url параметра --rpccorsdomain на url используемого Вами Remix.

source: To run Remix Desktop & a local test node, use this Geth command:
ru_ru: Чтобы запустить Remix Desktop & локальный тестовый узел, используйте эту команду Geth:

source: Also see Geth Docs on Dev mode
ru_ru: Также смотрите Geth Docs по режиму Dev.

source: The Web3 Provider Endpoint for a local node is http://localhost:8545
ru_ru: Конечная точка Web3 Provider Endpoint для локального узла - http://localhost:8545.

source: WARNING: Don't get lazy. It is a bad idea to use the Geth flag <b>--rpccorsdomain</b> with a wildcard: --rpccorsdomain *
ru_ru: ПРЕДУПРЕЖДЕНИЕ: Не поленитесь. Плохая идея использовать флаг Geth <b>--rpccorsdomain</b> с подстановочным знаком: --rpccorsdomain *.

source: If you put the wildcard *, it means everyone can request the node. Whereas, if you put a URL, it restricts the urls to just that one - e.g. --rpccorsdomain 'https://remix-alpha.ethereum.org'
ru_ru: Если Вы вводите подстановочный знак *, это означает, что каждый может запросить узел. В то время как, если Вы указываете URL, это ограничивает количество запросов только этим URL - например, --rpccorsdomain 'https://remix-alpha.ethereum.org'.

source: Only use --rpccorsdomain * when using a test chain AND using only test accounts. For real accounts or on the mainchain specify the url.
ru_ru: Используйте --rpccorsdomain * только при использовании тестовой цепочки И при использовании только тестовых учетных записей. Для реальных счетов или на основной цепочке укажите url.

source: Account:
ru_ru: Счет:

source: Account: the list of accounts associated with the current environment (and their associated balances). On the JsVM, you have a choice of 5 accounts. If using Injected Web3 with MetaMask, you need to change the account in MetaMask.
ru_ru: Account: список счетов, ассоциированных с текущей средой (и связанных с ними балансов). На JsVM у Вас есть выбор из 5 счетов. Если Вы используете Injected Web3 с MetaMask, Вам необходимо изменить счет в MetaMask.

source: Gas Limit:
ru_ru: Предел газа:

source: This sets the maximum amount of gas that will be allowed for all the transactions created in Remix.
ru_ru: Здесь устанавливается максимальное количество газа, которое будет разрешено для всех транзакций, созданных в Remix.

source: Value:
ru_ru: Значение:

source: This sets the amount of ETH, WEI, GWEI etc that is sent to a contract or a payable function. ( Note: payable functions have a red button). The value is always reset to 0 after each transaction execution). The Value field is NOT for gas.
ru_ru: Здесь устанавливается количество ETH, WEI, GWEI и т.д., которое направляется на контракт или функцию выплаты. (Примечание: функции, подлежащие оплате, имеют красную кнопку). Значение всегда сбрасывается в 0 после выполнения каждой транзакции). Поле Value (Значение) НЕ предназначено для газа.

source: Initiate Instance
ru_ru: Инициировать инстанс

source: In the image above, the select box is set to Ballot. This select box will contain the list of compiled contracts.
ru_ru: На изображении выше для поля выбора установлено значение Ballot. Это поле выбора будет содержать список составленных контрактов.

source: Deploy send a transaction that deploys the selected contract. When the transaction is mined, the newly created instance will be added (this might take several seconds). Note that if the constructor has parameters, you need to specify them.
ru_ru: Deploy отправляет транзакцию, которая развертывает выбранный контракт. Когда транзакция будет отработана, вновь созданный экземпляр будет добавлен (это может занять несколько секунд). Обратите внимание, что если конструктор имеет параметры, то Вам необходимо их указать.

source: At Address this is used at access a contract that has already been deployed. It assumes that the given address is an instance of the selected contract. Note: There's no check at this point, so be careful when using this feature, and be sure you trust the contract at that address.
ru_ru: At Address используется для доступа к контракту, который уже был развернут. При этом предполагается, что указанный адрес является экземпляром выбранного контракта. Примечание: На этом этапе нет никакой проверки, поэтому будьте осторожны при использовании этой функции и убедитесь, что Вы доверяете контракту по этому адресу.

source: Pending Instances
ru_ru: Отложенные инстанции
