Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/compile.po
Languages: ja_jp, pt_br, ru_ru

source: Solidity Compiler
ja_jp: Solidityコンパイラ
pt_br: Compilador do Solidity
ru_ru: Компилятор Solidity

source: Clicking the Solidity icon in the icon panel brings you to the Solidity Compiler. The default view of the Solidity Compiler shows the basic configuration. To open the Advanced Configuration panel, click the **Advanced Configuration** button (**C. in fig. 1**). For details on advanced features - see below.
ja_jp: アイコンパネルにあるSolidityアイコンをクリックして、Solidityコンパイラに移動してください。Solidityコンパイラのデフォルトでは、基本設定が表示されます。高度な設定パネルを開くには、 **Advanced Configuration** ボタンをクリックしてください (**C. in fig. 1**)。それらの高度な機能につては後述します。
pt_br: Clicar no ícone Solidity no painel de ícone leva você ao Compilador Solidity. A visualização padrão do Compilador de Solidity mostra a configuração básica. Para abrir o painel de configuração avançada, clique no botão **configuração avançada** (**C. no ficheiro. 1**). Para mais detalhes sobre recursos avançados - veja abaixo.
ru_ru: Щелчок по значку Solidity на панели пиктограмм приводит Вас в Solidity Compiler. Вид компилятора Solidity по умолчанию показывает базовую конфигурацию. Чтобы открыть панель расширенной конфигурации, щелкните на кнопке **Расширенная конфигурация** (**С. на рис. 1**). Подробнее о расширенных возможностях - см. ниже.

source: Solidity Compiler Basics
ja_jp: Solidityコンパイラの基礎
pt_br: Básico do Compilador Solidity
ru_ru: Основы компилятора Solidity

source: Selecting a contract to compile
ja_jp: コンパイルするコントラクトの選択
pt_br: Selecionar um contrato para compilar
ru_ru: Выбор контракта для компиляции

source: To select a contract to compile, choose a file in the File Explorer. Or if there are several files open, make sure the one you want to compile is the active file in the Editor.
ja_jp: コンパイルするコントラクト選択するには、ファイルエクスプローラ内にあるファイルを選択します。または、既に複数のファイルを開いている場合は、エディタ内でコンパイルしたいファイルがアクティブになっていることを確認してください。
pt_br: Para selecionar um contrato para compilação, escolha um arquivo no Gerenciador de Arquivos. Ou se houver vários arquivos abertos, certifique-se que o arquivo que você deseja compilar é o arquivo ativo no Editor.
ru_ru: Чтобы выбрать контракт для компиляции, выберите файл в Проводнике файлов. Или, если открыто несколько файлов, убедитесь, что тот, который Вы хотите скомпилировать, является активным файлом в Редакторе.

source: If there is not an active file in the editor or a file has not already been compiled, then the Solidity compiler will look like this:
ja_jp: アクティブなファイルがエディタにないか、ファイルがコンパイルされていない場合、Solidityコンパイラは次のようになります:
pt_br: Se não houver um arquivo ativo no editor ou se um arquivo já não for compilado, então o compilador Solidity será parecido com isto:
ru_ru: Если в редакторе нет активного файла или файл еще не скомпилирован, то компилятор Solidity будет выглядеть следующим образом:

source: Triggering compilation
ja_jp: コンパイルのトリガー
pt_br: Iniciando compilação
ru_ru: Компиляция триггеров

source: Compiling is triggered when you:
ja_jp: コンパイルは次の場合にトリガーされます:
pt_br: A compilação é acionada quando você:
ru_ru: Компиляция запускается, когда Вы:

source: click the compile button (**D. in fig. 1 below**)
ja_jp: コンパイルボタンをクリック(**D. in fig. 1 below**)
pt_br: clique no botão compilar (**D. no fig. 1 abaixo**)
ru_ru: Нажмите кнопку компиляции (**D. на рис. 1 ниже**)

source: use the shortcut `control + s`.
ja_jp: ショートカットを使用 `control + s`
pt_br: use o atalho `control + s`.
ru_ru: используйте сочетание клавиш `control + s`.

source: right click on a file in the File Explorer and select the **Compile** option
ja_jp: ファイルエクスプローラ内にあるファイルの右クリックし、**Compile** オプションを選択
pt_br: clique com o botão direito em um arquivo no Gerenciador de Arquivos e selecione a opção **Compilar**

source: Auto Compile
ja_jp: 自動コンパイル
pt_br: Compilação automática
ru_ru: Автоматическая компиляция

source: If the auto compile checkbox (**B. in fig. 1 above**) is checked, compilation will occur every few seconds (when the file is auto-saved) as well as when another file is selected. If a contract has a lot of dependencies, it can take a while to compile - so you use autocompilation at your discretion.
ja_jp: 自動コンパイルチェックボックス(**B. in fig. 1 above**)にチェックがされていると、別のファイルが選択された時や数秒経過時にコンパイルが行われます(ファイルが自動保存されている場合)。コントラクトに依存関係が複数ある場合、コンパイルに時間がかかることがあります。そのため、オートコンパイルを自分の判断で使うことができるようになっています。
pt_br: Se a caixa de seleção de compilação automática (**B. no fig. 1 acima**) está marcada, a compilação ocorrerá a cada segundo (quando o arquivo é salvo automaticamente) bem como quando outro arquivo é selecionado. Se um contrato tiver muitas dependências, pode levar um tempo para compilar - então você usa o autocompilação, a seu critério.

source: Solidity versions & Remix functionality
ja_jp: SolidityバージョンとRemix機能
pt_br: Versões de Solidity & funcionalidade Remix
ru_ru: Версии Solidity и функциональность Remix

source: The compiler version is selected in the **COMPILER** dropdown list (**A. in fig. 1 above**).
ja_jp: **COMPILER** ドロップダウンリストでコンパイラバージョンを選択します(**A. in fig. 1 above**)。
pt_br: A versão do compilador é selecionada na lista suspensa **COMPILER** (**A. no arquivo 1 acima**).
ru_ru: Версия компилятора выбирается в выпадающем списке **COMPILER** (**А. на рис. 1 выше**).

source: You can compile (and deploy) contracts with versions of Solidity **older than 0.4.12**. However, the older compilers use a legacy AST — which we no longer support. Consequently, some plugins may not work and some functionality - e.g. source highlighting in the Editor may only be partially working.
ja_jp: **0.4.12よりも古い** Solidityバージョンのコントラクトのコンパイル(とデプロイ)ができます。ただし、古いコンパイラは、現在サポートされていないレガシーASTを使用しています。結果として、いくつかのプラグインや機能が動作しない可能性があります。例: エディタのソースハイライトが部分的に動作するなど
pt_br: Você pode compilar (e implantar) contratos com versões de Solidity **anteriores a 0.4. 2**. No entanto, os compiladores mais velhos usam o AST — ferramenta legada o qual não suportamos mais. Consequentemente, alguns plugins podem não funcionar e algumas funcionalidades - por exemplo, o destaque da fonte no Editor só pode estar parcialmente funcionando.
ru_ru: Вы можете компилировать (и развертывать) контракты с версиями Solidity **старше 0.4.12**. Однако старые компиляторы используют устаревший AST, который мы больше не поддерживаем. Следовательно, некоторые плагины могут не работать, а некоторые функциональные возможности - например, подсветка исходного текста в Редакторе - могут работать лишь частично.

source: Using the Contract select box
ja_jp: コントラクト選択ボックスの使用
pt_br: Usando a caixa de seleção Contrato
ru_ru: Использование окна выбора контракта

source: Because a Solidity file can include multiple contracts and because contracts can import other contracts, multiple contracts are often compiled. **However**, only 1 contract's compilation details can be retrieved at a time.
ja_jp: Solidityファイルに複数のコントラクトを含めることができ、コントラクトは他のコントラクトをインポートできるため、複数のコントラクトがコンパイルされることが頻繁にあります。**だたし**、一度に1つのコントラクトのコンパイル詳細のみしか取得できません。
pt_br: Porque um arquivo Solidity pode incluir múltiplos contratos e porque os contratos podem importar outros contratos, em geral vários contratos são frequentemente compilados. **Contudo**, apenas o detalhe de uma compilação de contrato pode ser recuperado de cada vez.
ru_ru: Поскольку файл Solidity может включать несколько контрактов и поскольку контракты могут импортировать другие контракты, часто компилируется несколько контрактов. **Однако**, за один раз можно получить информацию о компиляции только одного контракта.

source: To select the desired contract, use the **Contract** select box (**F. in fig. 1**). Forgetting to select the right contract is a common mistake - so remember to verify that the contract you want is selected.
ja_jp: 目的のコントラクトを選択するには、 **Contract** 選択ボックス(**F. in fig. 1**)を使用します。正しいコントラクトを選択し忘れることはよくあるミスです。そのため、目的のコントラクトが選択されていることを必ず確認してください
pt_br: Para selecionar o contrato desejado, use a caixa de seleção **Contrato** (**F. na fig. 1**). Esquecer-se de selecionar o contrato certo é um erro comum - lembre-se de verificar se o contrato que você deseja está selecionado.
ru_ru: Чтобы выбрать нужный контракт, используйте поле **Контракт** (**F. на рис. 1**). Забыть выбрать нужный контракт - распространенная ошибка, поэтому не забывайте проверять, что выбран именно тот контракт, который Вам нужен.

source: Compilation Details and Publishing
ja_jp: コンパイラ詳細と公開
pt_br: Detalhes da compilação e publicação
ru_ru: Детали компиляции и публикация

source: Using the publish button, you can upload your contract to **IPFS** or **Swarm** (only non abstract contracts can be published to Swarm).
ja_jp: 公開ボタンを使用することで、コントラクトを **IPFS** または **Swarm** にアップロードすることができます(Swarmでは抽象コントラクトのみ公開できません)。
pt_br: Usando o botão publicar, você pode enviar o seu contrato para **IPFS** ou **Swarm** (somente contratos nao abstratos podem ser publicados no Swarm).
ru_ru: Используя кнопку публикации, Вы можете загрузить Ваш контракт в **IPFS** или **Swarm** (в Swarm могут быть опубликованы только не абстрактные контракты).

source: When publishing a contract that imports other contracts, the main contract and all of its imported contracts will be published - each to their own address.
ja_jp: 他のコントラクトをインポートするコントラクトを公開した場合は、メインコントラクトとすべてのインポートされたコントラクトが公開されます。また、それぞれがアドレスを持ちます。
pt_br: Ao publicar um contrato que importa outros contratos, o contrato principal e todos os seus contratos importados serão publicados - cada um para seu próprio endereço.
ru_ru: При публикации контракта, который импортирует другие контракты, основной контракт и все импортированные им контракты будут опубликованы - каждый по своему адресу.

source: **Published data contains the contract's metadata and the solidity source code.**
ja_jp: **公開されるデータには、コントラクトのメタデータとSolidityのソースコードが含まれます。**
pt_br: **Os dados publicados contêm os metadados do contrato - incluindo o ABI - e o código-fonte solidity.**
ru_ru: **Опубликованные данные содержат метаданные контракта и исходный код solidity.**.

source: After either **Publish on IPFS** or **Publish on Swarm** is clicked a modal will pop up. This modal contains the contract's address as well as the addresses of the contracts that it imported and the address of the contract's **metadata**.
ja_jp: **Publish on IPFS** または **Publish on Swarm** をクリックすると、モーダルがポップアップします。このモーダルは、コントラクトアドレスと、インポートしたコントラクトのアドレスとコントラクトの **メタデータ** のアドレスが含まれています。
pt_br: Depois de **Publicar no IPFS** ou **Publicar no Swarm** é clicado um modal irá aparecer. Este modal contém o endereço do contrato, assim como os endereços dos contratos que importou e o endereço dos **metadados** do contrato.

source: When the "Compilation Details" button is clicked (**G. in fig. 1**), a modal opens displaying detailed information about the current selected contract.
ja_jp: 「Compilation Details」ボタンをクリックした場合(**G. in fig. 1**)、モーダルが開き、現在選択されているコントラクトに関する詳細情報が表示されます。
pt_br: Quando o botão "Detalhes da Compilação" é clicado (**G. in fig. 1**), um modal abre informações detalhadas sobre o contrato selecionado atual.
ru_ru: При нажатии кнопки "Compilation Details" (**Г. на рис. 1**) открывается модальное окно, отображающее подробную информацию о текущем выбранном контракте.

source: If you just want to get the **ABI** or the **Bytecode** - click the appropriate button see **H. in fig. 1**.
ja_jp: **ABI** または **Bytecode**のみ取得したい場合は、**H. in fig. 1** にある適切なボタンをクリックしてください。
pt_br: Se você só quiser obter o **ABI** ou o **Bytecode** - clique no botão apropriado veja **H. no arquivo 1**.
ru_ru: Если Вы хотите получить только **ABI** или **Bytecode** - щелкните на соответствующей кнопке, см. **Г. на рис. 1**.

source: Passive Contract Verification
ja_jp: パッシブコントラクト検証
pt_br: Verificação de contrato passivo
ru_ru: Пассивная верификация контрактов

source: When you publish your metadata to IPFS and deploy your code to the mainnet or a public testnet, the contract verification service **[Sourcify](https://sourcify.dev/)**, will verify your contracts without you needing to do anything.
ja_jp: IPFSにメタデータを公開したり、メインネットもしくは公開テストネットにコードをデプロイする場合は、コントラクト検証サービス **[Sourcify](https://sourcify.dev/)** が自動的に検証してくれます。
pt_br: Quando você publica seus metadados no IPFS e faz deploy do seu código para a rede principal ou pública de testes, o serviço de verificação do contrato **[Sourcify](https://sourcify. ev/)**, irá verificar seus contratos sem que você precise fazer nada.

source: Compile and Run script
ja_jp: コンパイルとスクリプトの実行
pt_br: Compilar e executar script
ru_ru: Компиляция и выполнение скрипта

source: The Compile and Run script button (**E. in fig. 1**) is for compiling and then immediately running a script. It's a time saver so that you can write some code, automatically run script that sets state of the contract - thus allowing you to quickly understand how the code is working. ([more about Compile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
ja_jp: コンパイルとスクリプトの実行を行うボタン(**E. in fig. 1**)は、コンパイルおよびスクリプトを即座に実行するためにあります。コントラクトの状態を設定するスクリプトを自動的に実行することで時間を節約できまます。これにより、コードの動作を素早く理解することができます。 ([詳細は「コンパイルと実行」をご覧ください](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
pt_br: O botão Compilar e Executar script (**E. no fig. 1**) é para compilar e, em seguida, executar um script imediatamente. É uma economia de tempo para que você possa escrever algum código. Automaticamente executar o script que define o estado do contrato permite que você entenda rapidamente como o código está funcionando. ([mais sobre Comile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
ru_ru: Кнопка Compile and Run script (**Е. на рис. 1**) предназначена для компиляции и последующего немедленного запуска скрипта. Это экономия времени, так что Вы можете написать некоторый код, автоматически запустить скрипт, который устанавливает состояние контракта - таким образом, Вы сможете быстро понять, как работает код. ([подробнее о Compile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly)])

source: Compilation Errors and Warning
ja_jp: コンパイルエラーと警告
pt_br: Erros de Compilação e Avisos
ru_ru: Ошибки и предупреждения при компиляции

source: Compilation Errors and Warning are displayed below the contract section. At each compilation, the static analysis tab builds a report.
ja_jp: コンパイルエラーと警告は、コントラクトセクションの下に表示されます。各コンパイルでは、静的解析タブがレポートを作成します。
pt_br: Erros de compilação e avisos são exibidos abaixo da seção do contrato. Em cada compilação, a guia análise estática compila um relatório.
ru_ru: Ошибки компиляции и предупреждения отображаются ниже раздела контрактов. При каждой компиляции вкладка статического анализа строит отчет.

source: It is important to address reported issues even if the compiler doesn't complain. ([more about static analysis](static_analysis.html))
ja_jp: コンパイラで問題がない場合でもレポートされた問題に対応することは重要です。 ([性的解析の詳細](static_analysis.html))
pt_br: É importante resolver os problemas reportados mesmo que o compilador não reclame. ([mais sobre análise estática](static_analyis.html))
ru_ru: Важно устранять обнаруженные проблемы, даже если компилятор не жалуется. ([подробнее о статическом анализе](static_analysis.html))

source: Advanced Compiler Configurations
ja_jp: 高度なコンパイラ設定
pt_br: Configuração Avançada do Compilador
ru_ru: Расширенные конфигурации компилятора

source: Clicking on Advanced Compiler Configurations will open this panel (**M. in fig. 2 below**).
ja_jp: 高度なコンパイラ設定をクリックしてこのパネルが開きます(**M. in fig. 2 below**)。
pt_br: Clicar em Configurações Avançadas do Compilador irá abrir este painel (**M. no fig. 2 abaixo**).
ru_ru: Щелкнув на Advanced Compiler Configurations, Вы откроете эту панель (**М. на рис. 2 ниже**).

source: ![](images/a-sol-comp-adv.png)
ja_jp: ![](images/a-sol-comp-basic.png)

source: There is a radio button to choose whether to configure the compiler through the interface (**N. in fig 2**) or to use a JSON file for the configuration (**R. in fig 2**).
ja_jp: ラジオボタンがあり、インターフェースを通してコンパラの設定するかどうかを選択できます(**N. in fig 2**)、またはJSONファイルを使用して設定することができます(**R. in fig 2**)。
pt_br: Há um botão de rádio para escolher se deseja configurar o compilador através da interface (**N. em fig 2**) ou usar um arquivo JSON para a configuração (**R. no fig 2**).

source: Solidity or YUL
ja_jp: SolidityまたはYUL
pt_br: Solidity ou YUL
ru_ru: Солидность или YUL

source: Since the Solidity version `0.5.7`, it is possible to compile `Yul` files. Please read the ([solidity documentation about Yul](https://docs.soliditylang.org/en/latest/yul.html)) which contain some code examples. You can use the language dropdown (**O. in fig 2**) to switch the language. **This dropdown list is only available for versions greater than or equal to `0.5.7`.**
ja_jp: Solidityバージョン `0.5.7`以降、`Yul`ファイルのコンパイルができるようになりました。[Yulに関するSolidityドキュメント](https://docs.soliditylang.org/en/latest/yul.html)) をご覧ください。コード例を見ることができます。言語ドロップダウン(**O. in fig 2**)を使用して言語を変更できます。 **このドロップダウンリストは、`0.5.7`以降のバージョンからのみ利用可能です。**
pt_br: Desde a versão 0.5.7 do Solidity, é possível compilar arquivos Yul. Por favor, leia a ([documentação do Solidity sobre Yul](https://docs.soliditylang.org/en/latest/yul.html)) que contém alguns exemplos de código. Você pode usar o menu suspenso de idiomas (B. na imagem abaixo) para mudar o idioma. Esta lista suspensa está disponível apenas para versões superiores ou iguais a 0.5.7`.**
ru_ru: Начиная с версии Solidity `0.5.7`, появилась возможность компилировать файлы `Yul`. Пожалуйста, прочитайте ([Solidity documentation about Yul](https://docs.soliditylang.org/en/latest/yul.html)), где приведены некоторые примеры кода. Вы можете использовать выпадающий список языков (**О. на рис. 2**) для переключения языка. **Этот выпадающий список доступен только для версий, больших или равных `0.5.7`.**.

source: Select an EVM version
ja_jp: EVMバージョンの選択
pt_br: Selecione uma versão EVM
ru_ru: Выберите версию EVM

source: The EVM dropdown list (**P. in fig 2**) allows to compile code against a specific **Ethereum hard fork**. The `compiler default` corresponds to the default hard fork used by a specific version.
ja_jp: EVMドロップダウンリスト(**P. in fig 2**)では、特定の **イーサリアムハードフォーク** に対してコードコンパイルすることができます。`compiler default`は、デフォルトで使用されるハードフォークの特定のバージョンに対応します。
pt_br: A lista suspensa EVM (**P. no fig 2**) permite compilar o código em um **Ethereum hard fork** específico. O `compilador padrão` corresponde ao hard fork padrão usado por uma versão específica.
ru_ru: Выпадающий список EVM (**П. на рис. 2**) позволяет компилировать код против определенной **Ethereum hard fork**. Параметр `компилятор по умолчанию` соответствует хард форку по умолчанию, используемому в конкретной версии.

source: To see the name of the hard fork used in the current compilation, click the "Compilation Details" button and in the `Metadata` section there will be a sub-section called **settings**. Open up the **settings** to see the EVM version's name.
ja_jp: 現在のコンパイラで使用されているハードフォークの名前を確認するには、**設定**と呼ばれるサブセクションにある`Metadata` セクションの「Compilation Details」ボタンをクリックしてください。**設定*を開くとEVMバージョンの名前を確認できます。
pt_br: Para ver o nome do hard fork usado na compilação atual, clique no botão "Detalhes da Compilação" e na seção `Metadata` haverá uma sub-seção chamada **configurações**. Abra as **configurações** para ver o nome da versão do EVM.
ru_ru: Чтобы увидеть название хард форка, использованного в текущей компиляции, нажмите кнопку "Compilation Details" и в разделе `Metadata` появится подраздел под названием **settings**. Откройте **настройки**, чтобы увидеть название версии EVM.

source: Enable optimization
ja_jp: 最適化の有効化
pt_br: Habilitar otimização
ru_ru: Включите оптимизацию

source: According to the Solidity Docs, "the optimizer tries to simplify complicated expressions, which reduces both code size and execution cost, i.e., it can reduce gas needed for contract deployment as well as for external calls made to the contract."
ja_jp: Solidityドキュメントによると、「オプティマイザーは、複雑な式を簡素化しようとします。これにより、コードサイズおよび実行コストの両方を削減します。すなわち、コントラクトデプロイメントおよびコントラクトへの外部コールで必要とされるガスを削減します。」と書かれています。
pt_br: De acordo com o Solidity Docs, "o otimizador tenta simplificar expressões complicadas, o que reduz o tamanho do código e o custo de execução. Por exemplo: pode reduzir o gás necessário para a implantação do contrato, bem como para chamadas externas feitas ao contrato."

source: For recent versions of Solidity, it is [recommended to enable optimization](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be).
ja_jp: 最新のSolidityのバージョンでは、[最適化を有効にすることが推奨されています](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be)。
pt_br: Para versões recentes do Solidity, é [recomendado permitir a otimização](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspeit-of-the-optimizer-and-are-they-right-to-be).

source: To learn more about optimization, (**Q. in the fig 2**) visit the [Solidity docs on the optimizer](https://docs.soliditylang.org/en/latest/internals/optimizer.html).
ja_jp: 最適化についてさらに学びたい場合は、(**Q. in the fig 2**) [オプティマイザーに関するSolidityのドキュメント](https://docs.soliditylang.org/en/latest/internals/optimizer.html)をご覧ください。
pt_br: Para aprender mais sobre a otimização, (**P. na fig 2**) visite a [documentação de Solidity no otimizador](https://docs.soliditylang.org/en/latest/internals/optimizer.html).
ru_ru: Чтобы узнать больше об оптимизации, (**Q. в рис. 2**) посетите [Solidity docs on the optimizer](https://docs.soliditylang.org/en/latest/internals/optimizer.html).

source: To the right of the **Enable optimization** checkbox is the box to input the number of Optimization runs. The default value is 200.
ja_jp: **Enable optimization** チェックボックスの右側に最適化の実行回数を入力するボックスがあります。デフォルト値は200になっています。
pt_br: À direita da caixa de seleção de **habilitar otimização** é a caixa de seleção para inserir o número de otimizações a serem executadas. O valor padrão é 200.
ru_ru: Справа от флажка **Включить оптимизацию** находится поле для ввода количества прогонов оптимизации. Значение по умолчанию - 200.

source: You may ask — "What is the right number of runs for my contract?" And the Solidity docs say:
ja_jp: 「自分のコントラクトで実行する最適な数は何ですか？」という疑問に対して、Solidityドキュメントに解答があります:
pt_br: Você pode perguntar — "Qual é o número certo para o meu contrato?" E os documentos do Solidity dizem:
ru_ru: Вы можете спросить - "Какое количество прогонов является правильным для моего контракта?". И в документации Solidity сказано:

source: If you want the initial contract deployment to be cheaper and the later function executions to be more expensive, set it to --optimize-runs=1. If you expect many transactions and do not care for higher deployment cost and output size, set --optimize-runs to a high number.
ja_jp: 最初のコントラクトのデプロイメントを安価に、後の関数の実行を高価にしたい場合は、 --optimize-runs=1 に設定します。コントラクトで多数のトランザクションを想定しており、より高いデプロイメントコストと大きな出力サイズになることを気にしないならば、 --optimize-runs に大きな数を設定します。
pt_br: Se você deseja que a implantação inicial do contrato seja mais barata e que as execuções posteriores sejam mais caras, ative a opção --optimize-runs=1. Se você espera muitas transações e não se importa com um maior custo de implantação e tamanho de saída, defina --optimize-run para um número alto.
ru_ru: Если Вы хотите, чтобы начальное развертывание контракта было более дешевым, а последующие выполнения функций - более дорогими, установите значение --optimize-runs=1. Если Вы ожидаете большое количество транзакций и не заботитесь о более высокой стоимости развертывания и размере выходных данных, установите значение --optimize-runs на большое число.
