Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/compile.po
Languages: ja_jp, pt_br, ru_ru

source: To learn more about the optimization runs, visit the [Solidity docs about Optimizer options](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
ja_jp: 最適化の実行の詳細情報については、[オプティマイザーオプションに関するSolidityドキュメント](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options)を参照してください。
pt_br: Para saber mais sobre as runs de otimização, visite a [documentação do Solidity sobre opções de Optimizador](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
ru_ru: Чтобы узнать больше об оптимизационных прогонах, посетите [Solidity docs about Optimizer options](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).

source: JSON file for Compiler configuration
ja_jp: コンパイラ設定用JSONファイル
pt_br: Arquivo JSON para configuração do Compilador
ru_ru: JSON-файл для конфигурации компилятора

source: Selecting the radio button next to **Use configuration file** will let you set the configuration using a JSON file (**T. in fig 2**). When you switch to **compile with a config file**, a sample compiler config file is created. This file can be edited with all the available options.
ja_jp: **Use configuration file** にあるラジオボタンを選択すると、JSONファイルを使って設定することができます(**T. in fig 2**)。 **設定ファイルを使ってコンパイル**に切り替えると、コンパイラ設定ファイルのサンプルが作成されます。このファイルを編集することで、使用可能なオプションをすべて使うことがでます。
pt_br: Ao selecionar o botão de rádio ao lado de **usar arquivo de configuração**, ele permitirá que você defina a configuração usando um arquivo JSON (**T. no fig 2**). Quando você troca para **compilar com um arquivo de configuração**, uma amostra de arquivo de configuração do compilador é criada. Esse arquivo pode ser editado com todas as opções disponíveis.
ru_ru: Выбор радиокнопки рядом с пунктом **Использовать файл конфигурации** позволит Вам задать конфигурацию с помощью JSON-файла (**Т. в рис. 2**). Когда Вы переключаетесь на **compile with a config file**, создается примерный файл конфигурации компилятора. Этот файл можно редактировать со всеми доступными опциями.

source: Clicking the config file's name will open it up in the Editor. To change the config file click the **Change** button. If you update the text box with a file name of a file that does not exist, a new file will be created containing the default file's contents.
ja_jp: 設定ファイル名をクリックすると、エディタが開きます。設定ファイルを変更するには **Change** ボタンをクリックします。存在しないファイル名にテキストボックスを更新すると新しいファイルが作成されます。そのファイルは、デフォルトの内容を含みます。
pt_br: Clicar no nome do arquivo de configuração vai abri-lo no Editor. Para alterar o arquivo de configuração, clique no botão **mudar**. Se você atualizar o campo caixa de texto com o nome de um arquivo que não existe, um novo arquivo será criado contendo o conteúdo do arquivo padrão.
ru_ru: Щелчок на имени файла конфигурации откроет его в Редакторе. Чтобы изменить файл конфигурации, нажмите кнопку **Change**. Если Вы введете в текстовое поле имя несуществующего файла, будет создан новый файл, содержащий содержимое файла по умолчанию.

source: There is no error checking when using the .json file for configuration settings, so make sure your config file is correct.
ja_jp: .jsonファイルを使う場合、エラーのチェックはありません。そのため、設定ファイルが正しいことを確実にしてください。
pt_br: Não há verificação de erros ao usar o arquivo .json para as configurações de configuração, então certifique-se de que seu arquivo de configuração está correto.
ru_ru: При использовании .json-файла для параметров конфигурации проверка ошибок не производится, поэтому убедитесь, что Ваш конфигурационный файл корректен.

source: Use a Custom Solidity Compiler
ja_jp: カスタムSolidityコンパイラの使用
pt_br: Usar um Compilador de Solidity Personalizado
ru_ru: Использование пользовательского компилятора Solidity

source: For those writing your own custom solidity compiler, you can import that by clicking the **+** button (**X. in fig 1**) to open a modal where you can input the url of the compiler to be loaded.
ja_jp: 独自のカスタムSolidityコンパイラを作成する人々向けに、**+** button (**X. in fig 1**) をクリックすることでロードされるコンパイラのURLを入力するモーダルが開き、インポートすることが可能です。
pt_br: Para aqueles que escrevem seu próprio compilador personalizado Solidity, você pode importá-lo clicando no botão + (X. na imagem) para abrir um modal, onde você pode inserir a url do compilador a ser carregado.
ru_ru: Для тех, кто пишет свой собственный компилятор Solidity, Вы можете импортировать его, нажав на кнопку **+** (**X. на рис. 1**), чтобы открыть модальное окно, в котором Вы можете ввести url компилятора, который необходимо загрузить.

source: right click on a file in the File Explorer and selecting **Compile** option
ru_ru: Щелкните правой кнопкой мыши на файле в Проводнике файлов и выберите опцию **Скомпилировать**.

source: If the auto compile checkbox (**B. in fig. 1 above**) is checked, compiliation will occur every few seconds (when the file is auto-saved) as well as when another file is selected. If a contract has a lot of dependencies, it can take a while to compile - so you use autocompilation at your discretion.
ru_ru: Если флажок автокомпиляции (**В. на рис. 1 выше**) установлен, компиляция будет происходить каждые несколько секунд (при автосохранении файла), а также при выборе другого файла. Если контракт имеет много зависимостей, компиляция может занять некоторое время - поэтому Вы используете автокомпиляцию по своему усмотрению.

source: After either **Publish on IPFS** or **Publish on Swarm** is clicked a modal will pop up. This modal contains the contract's address as well as the addreses of the contracts that it imported and the address of the contract's **metadata**.
ru_ru: После нажатия кнопки **Publish on IPFS** или **Publish on Swarm** на экране появится модальное окно. В этом окне содержится адрес контракта, а также адреса контрактов, которые он импортировал, и адрес **метаданных** контракта.

source: When you publish your metadata to IPFS and deploy your code to the mainnet or a public testnet, the contract verification service **[Sourcify](https://sourcify.dev/)**, will verifiy your contracts without you needing to do anything.
ru_ru: Когда Вы опубликуете свои метаданные на IPFS и развернете свой код в основной сети или публичной тестовой сети, служба проверки контрактов **[Sourcify](https://sourcify.dev/)**, будет проверять Ваши контракты без того, чтобы Вы что-либо делали.

source: There is a radio button to choose whether to configure the compiler through the interface (**N. in fig 2**) or to use a JSON file for the cofiguration (**R. in fig 2**).
ru_ru: Имеется радиокнопка, с помощью которой можно выбрать, конфигурировать ли компилятор через интерфейс (**N. в рис. 2**) или использовать для конфигурации JSON-файл (**R. в рис. 2**).

source: According to the the Solidity Docs, "the optimizer tries to simplify complicated expressions, which reduces both code size and execution cost, i.e., it can reduce gas needed for contract deployment as well as for external calls made to the contract."
ru_ru: Согласно Solidity Docs, "оптимизатор пытается упростить сложные выражения, что уменьшает как размер кода, так и стоимость выполнения, т.е. он может уменьшить количество газа, необходимого для развертывания контракта, а также для внешних вызовов, выполняемых к контракту."

source: For recent versions of Solidity, it is [recommended to enable optimization](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be) .
ru_ru: Для последних версий Solidity [рекомендуется включить оптимизацию](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be) .
