Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/contract_verification.po
Languages: es_es, fr_fr, ja_jp, pt_br, ru_ru

source: Contract Verification
es_es: Verificación de contratos
fr_fr: Vérification des contrats
ja_jp: コントラクトの検証
pt_br: Verificação de contrato
ru_ru: Верификация контракта

source: There are two contract verification services in Remix, Sourcify and Etherscan and the extended [Etherscan family](https://etherscan.io/eaas) of block explorers.
es_es: Existen dos servicios de verificación de contratos en Remix, Sourcify y Etherscan y la familia ampliada [Etherscan family](https://etherscan.io/eaas) de exploradores de bloques.
fr_fr: Remix comprend deux services de vérification des contrats, Sourcify et Etherscan, ainsi que la [famille Etherscan] étendue (https://etherscan.io/eaas) d'explorateurs de blocs.
ja_jp: Remixには、2つのコントラクト検証サービスがあります。それは、SourcifyとEtherscanおよび[Etherscan ファミリー](https://etherscan.io/eaas) を拡張したブロックエクスプローラです。
pt_br: Existem dois serviços de verificação de contrato em Remix, Sourcify e Etherscan e a extensão [família Etherscan](https://etherscan.io/eaas) dos exploradores de blocos.
ru_ru: В Remix есть две службы проверки контрактов, Sourcify и Etherscan, а также расширенное семейство [Etherscan family](https://etherscan.io/eaas) блокчейн-исследователей.

source: Documentation about Sourcify is found [here]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
es_es: Encontrará documentación sobre Sourcify en [here]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
fr_fr: Vous trouverez de la documentation sur Sourcify à l'adresse suivante : [here]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
ja_jp: Sourcifyについてのドキュメントは、[こちら]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin)をご覧ください。
pt_br: Documentação sobre Sourcify está [aqui]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).
ru_ru: Документация о Sourcify находится на сайте [here]( https://docs.sourcify.dev/docs/how-to-verify/#remix-plugin).

source: The Etherscan plugin is called: **CONTRACT VERIFICATION - ETHERSCAN**.
es_es: El plugin Etherscan se llama: **VERIFICACIÓN DE CONTRATOS - ETHERSCAN**.
fr_fr: Le plugin Etherscan s'appelle **VÉRIFICATION DES CONTRATS - ETHERSCAN**.
ja_jp: Etherscanプラグインは、 **CONTRACT VERIFICATION - ETHERSCAN** という名前です。
pt_br: O plugin Etherscan é chamado: **VERIFICAÇÃO DE CONTRATO - ETHERSCAN**.
ru_ru: Плагин Etherscan называется: **ВЕРИФИКАЦИЯ КОНТРАКТОВ - ETHERSCAN**.

source: You can access it from the Plugin Manager.
es_es: Puede acceder a él desde el Gestor de plugins.
fr_fr: Vous pouvez y accéder à partir du gestionnaire de plugins.
ja_jp: プラグインマネージャーからアクセスすることができます。
pt_br: Você pode acessá-lo pelo Gerenciador de Plugins.
ru_ru: Вы можете получить к нему доступ из Менеджера плагинов.

source: The plugin has 3 pages, the **verification** page, the **receipts** page, and the **settings** page.
es_es: El plugin tiene 3 páginas, la página de **verificación**, la página de **recibos** y la página de **configuración**.
fr_fr: Le plugin comporte 3 pages, la page **vérification**, la page **recettes** et la page **réglages**.
ja_jp: このプラグインは、 **verification** ページ、**receipts** ページ、 **settings** ページの３ページがあります。
pt_br: O plugin tem 3 páginas, a página de **verificação**, a página de **recibos** e a página **configurações**.
ru_ru: Плагин имеет 3 страницы, страницу **верификации**, страницу **квитанции** и страницу **настройки**.

source: When you go to the plugin for the first time, the settings page will load for inputting the API key.
es_es: Cuando acceda al plugin por primera vez, se cargará la página de configuración para introducir la clave API.
fr_fr: Lorsque vous accédez au plugin pour la première fois, la page de configuration s'affiche pour vous permettre d'entrer la clé API.
ja_jp: プラグインを最初に利用するときに、APIキーを入力するための設定ページが読み込まれます。
pt_br: Quando você acessar o plugin pela primeira vez, a página de configurações irá abrir para inserir a chave de API.
ru_ru: Когда Вы заходите в плагин в первый раз, загружается страница настроек для ввода ключа API.

source: ![](images/a-cv-etherscan-plugin-api-needed.png)
es_es: ![](images/a-cv-etherscan-plugin-api-need.png)
fr_fr: ![](images/a-cv-etherscan-plugin-api-need.png)

source: Etherscan API Key - settings page
es_es: Etherscan API Key - página de configuración
fr_fr: Etherscan API Key - page de configuration
ja_jp: Etherscan APIキー - 設定ページ
pt_br: Chave de API do Etherscan - página de configurações
ru_ru: Etherscan API Key - страница настроек

source: Etherscan is a block explorer for Ethereum mainnet and they make block explorers for other chains.
es_es: Etherscan es un explorador de bloques para la mainnet de Ethereum y fabrican exploradores de bloques para otras cadenas.
fr_fr: Etherscan est un explorateur de blocs pour le réseau principal Ethereum et fabrique des explorateurs de blocs pour d'autres chaînes.
ja_jp: Etherscanは、イーサリアムメインネットのブロックエクスプローラで、他のチェーンのブロックエクスプローラーも作っています。
pt_br: Etherscan é um explorador de bloco para a rede principal Ethereum e eles fazem exploradores de blocos para outras redes.
ru_ru: Etherscan - это проводник блоков для Ethereum mainnet, и они выпускают проводники блоков для других цепочек.

source: For Ethereum testnets like Goerli or Sepolia, the same API key works.
es_es: Para las redes de prueba de Ethereum como Goerli o Sepolia, funciona la misma clave API.
fr_fr: Pour les testnets Ethereum comme Goerli ou Sepolia, la même clé API fonctionne.
ja_jp: GoerliやSepoliaなどのイーサリアムテストネットでも、同じAPIキーを使えます。
pt_br: Para testnets no Ethereum como Goerli ou Sepolia, a mesma chave de API funciona.
ru_ru: Для тестовых сетей Ethereum, таких как Goerli или Sepolia, работает тот же самый ключ API.

source: If you are trying to verify on L2 chains like Optimism, a different API key is needed for their block explorer. Not all of the block explorers made by Etherscan have API keys. The Remix Contract Verification - Etherscan plugin only works where you can login to that block explorer to get the API key.
es_es: Si está intentando verificar en cadenas L2 como Optimism, se necesita una clave API diferente para su explorador de bloques. No todos los exploradores de bloques realizados por Etherscan tienen claves API. El plugin de Verificación de Contrato Remix - Etherscan sólo funciona donde usted puede acceder a ese explorador de bloques para obtener la clave API.
fr_fr: Si vous essayez de vérifier sur des chaînes L2 comme Optimism, une clé API différente est nécessaire pour leur explorateur de blocs. Tous les explorateurs de blocs fabriqués par Etherscan n'ont pas de clé API. Le plugin Remix Contract Verification - Etherscan ne fonctionne que si vous pouvez vous connecter à cet explorateur de blocs pour obtenir la clé API.
ja_jp: OptimismのようなL2チェーンを検証する場合は、ブロックエクスプローラで別のAPIキーが必要です。Etherscanによって作られたブロックエクスプローラのすべてにAPIキーがあるわけではありません。Remixコントラクト検証のEtherscanプラグインは、ブロックエクスプローラにログインしてAPIキーを取得できる場合のみ可能です。
pt_br: Se você está tentando verificar em cadeias L2 como Optimism, uma chave de API diferente é necessária para seu explorador de blocos. Nem todos os exploradores de blocos feitos pela Etherscan têm as mesmas chaves de API. O plugin de Verificação de contrato Remix - Etherscan só funciona onde você pôde logar no explorador do bloco e obter a chave de API.
ru_ru: Если Вы пытаетесь провести верификацию в цепочках L2, таких как Optimism, то для их блокчейн-проводника потребуется другой API-ключ. Не все блокчейн-проводники, созданные Etherscan, имеют API-ключи. Плагин Remix Contract Verification - Etherscan работает только там, где Вы можете войти в этот блокчейн-проводник, чтобы получить API-ключ.

source: Once the API key is input, the verification page (the homepage) is opened.
es_es: Una vez introducida la clave API, se abre la página de verificación (la página de inicio).
fr_fr: Une fois la clé API saisie, la page de vérification (la page d'accueil) s'ouvre.
ja_jp: APIキーの入力後、検証ページ(ホームページ)が開きます。
pt_br: Uma vez que a chave de API é inserida, a página de verificação (a página inicial) é aberta.
ru_ru: После ввода API-ключа открывается страница верификации (домашняя страница).

source: Verification page
es_es: Página de verificación
fr_fr: Page de vérification
ja_jp: 検証ページ
pt_br: Página de Verificação
ru_ru: Страница верификации

source: The network is NOT selected in the Etherscan plugin. The network is chosen in the Deploy & Run plugin and in your browser's wallet (if using).
es_es: La red NO se selecciona en el plugin Etherscan. La red se selecciona en el plugin Deploy & Run y en el monedero de su navegador (si lo utiliza).
fr_fr: Le réseau n'est PAS sélectionné dans le plugin Etherscan. Le réseau est choisi dans le plugin Deploy & Run et dans le portefeuille de votre navigateur (si vous l'utilisez).
ja_jp: Etherscanプラグインでネットワークが選択されていない場合、ネットワークはデプロイと実行プラグインとブラウザウォレット(使用している場合)によって選ばれます。
pt_br: A rede NÃO está selecionada no plugin Etherscan. A rede é escolhida no plugin Implantação e Execução e na carteira do seu navegador (se usando).
ru_ru: Сеть НЕ выбирается в плагине Etherscan. Сеть выбирается в плагине Deploy & Run и в кошельке Вашего браузера (если он используется).

source: The prerequisites for verification are:
es_es: Los requisitos previos para la verificación son:
fr_fr: Les conditions préalables à la vérification sont les suivantes :
ja_jp: 検証の前提条件:
pt_br: Os requisitos para verificação são:
ru_ru: Предпосылками для проверки являются:

source: The address of a deployed contract on a public network
es_es: La dirección de un contrato desplegado en una red pública
fr_fr: L'adresse d'un contrat déployé sur un réseau public
ja_jp: 公開ネットワーク上にデプロイされたコントラクトのアドレス
pt_br: O endereço de um contrato implantado em uma rede pública
ru_ru: Адрес развернутого контракта в публичной сети

source: That same contract compiled in Remix
es_es: Ese mismo contrato recopilado en Remix
fr_fr: Ce même contrat compilé dans Remix
ja_jp: Remixでコンパイルされた同じコントラクト
pt_br: Que o mesmo contrato compilado esteja compilado no Remix
ru_ru: Этот же контракт, составленный в Remix

source: Constructor parameters same as used during deployment (if required)
es_es: Parámetros del constructor iguales a los utilizados durante el despliegue (si es necesario)
fr_fr: Paramètres du constructeur identiques à ceux utilisés lors du déploiement (si nécessaire)
ja_jp: コンストラクタパラメータがデプロイメント時に使用されるものと同様であること(必要時)
pt_br: Parâmetros do construtor os mesmos que usados durante a implantação (se requerido)
ru_ru: Параметры конструктора те же, что используются при развертывании (если требуется)

source: Receipts page
es_es: Página de recibos
fr_fr: Page des reçus
ja_jp: レシートページ
pt_br: Página de recibos
ru_ru: Страница "Квитанции

source: Verification receipts are found on the receipts page.
es_es: Los recibos de verificación se encuentran en la página de recibos.
fr_fr: Les reçus de vérification se trouvent sur la page des reçus.
ja_jp: レシートページに検証レシートがあります。
pt_br: Os recibos de verificação são encontrados na página de recibos.
ru_ru: Верификационные квитанции находятся на странице квитанций.

source: Verification with constructor arguments
es_es: Verificación con argumentos del constructor
fr_fr: Vérification des arguments du constructeur
ja_jp: コンストラクタ引数を使用した検証
pt_br: Verificação com argumentos de construção
ru_ru: Верификация с аргументами конструктора

source: When a contract has arguments in the constructor, a text box will show for inputting the same constructor inputs as the deployed contract.
es_es: Cuando un contrato tenga argumentos en el constructor, se mostrará un cuadro de texto para introducir las mismas entradas del constructor que el contrato desplegado.
fr_fr: Lorsqu'un contrat a des arguments dans le constructeur, une zone de texte s'affiche pour saisir les mêmes entrées de constructeur que le contrat déployé.
ja_jp: コントラクトのコンストラクタに引数がある場合、デプロイされたコントラクトと同じコンストラクタの入力に対応する入力するためのテキストボックスが表示されます。
pt_br: Quando um contrato tem argumentos no construtor, uma caixa de texto mostrará para inserir as entradas do mesmo construtor que as do contrato implementado.
ru_ru: Когда контракт имеет аргументы в конструкторе, появится текстовое поле для ввода тех же аргументов конструктора, что и в развернутом контракте.

source: ![](images/a-cv-etherscan-constructor-args.png)
fr_fr: ![](images/a-cv-etherscan-constructeur-args.png)

source: Verifying a proxy contract
es_es: Verificación de un contrato de representación
fr_fr: Vérification d'un contrat de mandataire
ja_jp: プロキシコントラクトの検証
pt_br: Verificando um contrato proxy
ru_ru: Проверка прокси-контракта

source: Before verifying a proxy contract, the associated implementation contract must already be verified.
es_es: Antes de verificar un contrato proxy, el contrato de implementación asociado debe estar ya verificado.
fr_fr: Avant de vérifier un contrat de procuration, le contrat de mise en œuvre associé doit déjà être vérifié.
ja_jp: プロキシコントラクトを検証するには、関連する実装コントラクトが事前に検証されている必要があります。
pt_br: Antes de verificar um contrato proxy, o contrato de implementação associado já deve estar verificado.
ru_ru: Прежде чем проверять прокси-контракт, связанный с ним контракт реализации должен быть уже проверен.

source: Just for review, the implementation contract is you wrote or adapted and the proxy is, for example, an ERC1967Proxy.
es_es: Sólo para repasar, el contrato de implementación es el que usted escribió o adaptó y el proxy es, por ejemplo, un ERC1967Proxy.
fr_fr: Pour rappel, le contrat d'implémentation est celui que vous avez écrit ou adapté et le proxy est, par exemple, un ERC1967Proxy.
ja_jp: 確認ですが、実装コントラクトは、作成したものかプロキシに適合しているものです。例えばERC1967Proxyです。
pt_br: Apenas para revisão, o contrato de implementação foi escrito ou adaptado por você e o proxy é, por exemplo, um ERC1967Proxy.
ru_ru: Просто для обзора, контракт на реализацию Вы написали или адаптировали, а прокси - это, например, ERC1967Proxy.

source: **Do not check the proxy box when verifying the implementation.** Then after verifying the implementation contract:
es_es: **No marque la casilla del proxy cuando verifique la aplicación.** A continuación, tras verificar el contrato de aplicación:
fr_fr: **Ne cochez pas la case proxy lors de la vérification de la mise en œuvre ** Puis, après avoir vérifié le contrat de mise en œuvre :
ja_jp: **実装を検証するときにプロキシボックスにチェックをしないでください。** 実装コントラクトを検証した後は次になります:
pt_br: **Não marque a caixa de proxy ao verificar a implementação.** Então, após verificar o contrato de implementação:
ru_ru: **Не устанавливайте флажок "Прокси" при проверке внедрения**. Затем, после проверки контракта на внедрение:

source: Cut out the implementation contract's address from the Contract Address box.
es_es: Recorte la dirección del contrato de ejecución de la casilla Dirección del contrato.
fr_fr: Découpez l'adresse du contrat d'exécution dans la case Adresse du contrat.
ja_jp: コントラクトアドレスボックスから実装コントラクトのアドレスを切り取ります。
pt_br: Corte o endereço da implementação do contrato na caixa de Endereço.
ru_ru: Вырежьте адрес контракта на реализацию из поля Адрес контракта.

source: Click the "It's a proxy contract address" checkbox.
es_es: Haga clic en la casilla "Es una dirección de contrato proxy".
fr_fr: Cochez la case "C'est une adresse de contrat proxy".
ja_jp: 「It's a proxy contract address」チェックボックスをクリックします。
pt_br: Clique na caixa "É um endereço de contrato proxy".
ru_ru: Отметьте флажком опцию "Это адрес прокси-контракта".

source: Paste the verified implementation contract's address in the Expected Implementation Address box.
es_es: Pegue la dirección del contrato de ejecución verificado en la casilla Dirección de ejecución prevista.
fr_fr: Collez l'adresse du contrat de mise en œuvre vérifié dans le champ Adresse de mise en œuvre attendue.
ja_jp: 「 Expected Implementation Address 」ボックス内に検証された実装コントラクトアドレスをペーストしてください。
pt_br: Cole o endereço de implementação do contrato verificado na caixa de endereço de implementação esperada.
ru_ru: Вставьте адрес проверенного контракта на внедрение в поле Ожидаемый адрес внедрения.

source: Paste in the proxy contract address into the Contract Address box.
es_es: Introduzca la dirección del contrato proxy en la casilla Dirección del contrato.
fr_fr: Collez l'adresse du contrat de procuration dans le champ Adresse du contrat.
ja_jp: プロキシコントラクトアドレスの内容をContract Address ボックスにペーストしてください
pt_br: Cole o endereço do contrato proxy na caixa do endereço do contrato.
ru_ru: Вставьте адрес прокси-контракта в поле Адрес контракта.

source: To explain this visually, verify the implmentation contract:
es_es: Para explicarlo visualmente, compruebe el contrato de implantación:
fr_fr: Pour l'expliquer visuellement, vérifiez le contrat d'implémentation :
ru_ru: Чтобы объяснить это наглядно, проверьте контракт на имплантацию:

source: Then check the "It's a proxy contract" checkbox and cut and paste the implementation address from the contract address to the implementation contract box:
es_es: A continuación, marque la casilla "Es un contrato proxy" y corte y pegue la dirección de ejecución desde la dirección del contrato a la casilla del contrato de ejecución:
fr_fr: Cochez ensuite la case "Il s'agit d'un contrat de mandataire" et faites un copier-coller de l'adresse de mise en œuvre depuis l'adresse du contrat jusqu'à la case du contrat de mise en œuvre :
ja_jp: 次のように「It's a proxy contract」チェックボックスにチェックを入れ、実装アドレスをコントラクトアドレスから実装コントラクトボックスにカットアンドペーストしてください。
pt_br: Em seguida, marque a caixa "É um contrato de proxy" e recorte e cole o endereço de implementação do endereço do contrato para a caixa de implementação de contrato:
ru_ru: Затем установите флажок "Это прокси-контракт" и вырежьте и вставьте адрес реализации из адреса контракта в поле "Контракт реализации":

source: And then paste the address of the proxy contract into the Contract Address box. ![](images/a-cv-etherscan-verify-proxy2.png)
es_es: Y luego pegue la dirección del contrato proxy en la casilla Dirección del contrato. ![](images/a-cv-etherscan-verify-proxy2.png)
fr_fr: Collez ensuite l'adresse du contrat de procuration dans le champ Adresse du contrat. ![](images/a-cv-etherscan-verify-proxy2.png)
ja_jp: そして、プロキシコントラクトのアドレスをContract Addressボックスの中にペーストしてください。![](images/a-cv-etherscan-verify-proxy2.png)
pt_br: E em seguida, cole o endereço do contrato na caixa de endereços do contrato. ![](images/a-cv-etherscan-verify-proxy2.png)
ru_ru: А затем вставьте адрес прокси-контракта в поле Contract Address (Адрес контракта). ![](images/a-cv-etherscan-verify-proxy2.png)

source: Generate Verfication Scripts
es_es: Generar guiones de verificación
fr_fr: Générer des scripts de vérification
ru_ru: Создание сценариев верификации

source: Clicking the Generate Verification Scripts on the Verification page, will create a folder named etherscan in the Workspace's scripts folder that contains .ts files for verifying and returning the receipt status.
es_es: Al hacer clic en Generar scripts de verificación en la página de verificación, se creará una carpeta llamada etherscan en la carpeta de scripts del área de trabajo que contiene archivos .ts para verificar y devolver el estado de recepción.
fr_fr: En cliquant sur Générer des scripts de vérification sur la page de vérification, vous créez un dossier nommé etherscan dans le dossier scripts de l'espace de travail, qui contient des fichiers .ts pour la vérification et le renvoi de l'état de réception.
ja_jp: 検証ページにある「Generate Verification Scripts」をクリックすると、検証およびレシートステータスを返す.tsファイルを含んだワークスペース内のスクリプトフォルダーにetherscanという名のフォルダーが作成されます。
pt_br: Clicando em Gerar Scripts de Verificação na página de Verificação irá criar uma pasta chamada etherscan na pasta de scripts do Espaço de Trabalho que contém arquivos de typescript para verificação e devolução do status do recibo.
ru_ru: Щелчок по Generate Verification Scripts на странице Verification создаст в папке сценариев рабочей области папку с именем etherscan, содержащую .ts файлы для верификации и возврата статуса квитанции.

source: To explain this visually, verify the implementation contract:
ja_jp: 画像で説明するので、次の実装コントラクトの検証をします:
pt_br: Para explicar isso visualmente, verifique o contrato de implementação:

source: ![](images/a-cv-etherscan-verify-implementation.png)
ja_jp: ![](images/a-cv-etherscan-move-addr.png)

source: Generate Verification Scripts
ja_jp: 検証スクリプトの生成
pt_br: Gerar Scripts de Verificação
