Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/contract_metadata.po
Languages: ja_jp, pt_br, ru_ru

source: Compilation Artifacts
ja_jp: コンパイルアーティファクト
pt_br: Artefatos de Compilação
ru_ru: Артефакты компиляции

source: When a compilation for a Solidity file succeeds, Remix creates three JSON files for each compiled contract. Files can be seen in the `File Explorers plugin` as:
ja_jp: Solidityファイルのコンパイルが作成すると、各コンパイルされるコントラクトに対してRemixは3つのJSONファイルを作成します。ファイルは`File Explorers plugin`で以下のように確認できます。
pt_br: Quando uma compilação de um arquivo Solidity for bem-sucedida, o Remix cria três arquivos JSON para cada contrato compilado. Os arquivos podem ser vistos no `plugin do Explorador de Arquivo` como:
ru_ru: Когда компиляция для файла Solidity проходит успешно, Remix создает три JSON-файла для каждого скомпилированного контракта. Файлы можно увидеть в плагине `File Explorers` как:

source: `artifacts/<contractName>.json`: contains the link to the libraries, the bytecode, the deployed bytecode, the gas estimation, the method identifiers, and the ABI. It is used for linking a library address to the file.
ja_jp: `artifacts/<contractName>.json`: ライブラリ、バイトコード、デプロイされたバイトコード、ガス見積り、メソッド識別子、ABIなどのリンクを含みます。これはライブラリアドレスをファイルへリンクする場合に使用されます。
pt_br: `artifacts/<contractName>.json`: contém o link para as bibliotecas, o bytecode, o bytecode implantado, a estimativa de gás, os identificadores de método e a ABI. É usado para vincular um endereço de biblioteca ao arquivo.
ru_ru: `artifacts/<contractName>.json`: содержит ссылку на библиотеки, байткод, развернутый байткод, оценку газа, идентификаторы методов и ABI. Он используется для привязки адреса библиотеки к файлу.

source: `artifacts/<contractName_metadata>.json`: contains the metadata from the output of Solidity compilation.
ja_jp: `artifacts/<contractName_metadata>.json`: Solidityコンパイラからの出力がメタデータに含まれます。
pt_br: `artifacts/<contractName_metadata>.json`: contém os metadados de saída da compilação do Solidity.
ru_ru: `artifacts/<contractName_metadata>.json`: содержит метаданные, полученные на выходе компиляции Solidity.

source: `artifacts/build-info/<dynamic_hash>.json`: contains info about `solc` compiler version, compiler input and output. This file is generated similar to the files generated through Hardhat compilation. You can also try [Hardhat compilation](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) from Remix.
ja_jp: `artifacts/build-info/<dynamic_hash>.json`: `solc‘コンパイラバージョン、コンパイラの入力と出力などの情報を含みます。Hardhatコンパイルで生成されたファイルと同じようなファイルが生成されます。Remixから[Harhatコンパイル](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation)も試せます。
pt_br: `artifacts/build-info/<dynamic_hash>.json`: contém informações sobre a versão do compilador `solc`, a entrada e saída do compilador. Este arquivo é gerado de forma similar aos arquivos gerados pela compilação do Hardhat. Você também pode tentar a compilação com o [Hardhat](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) do Remix.
ru_ru: `artifacts/build-info/<dynamic_hash>.json`: содержит информацию о версии компилятора `solc`, входных и выходных данных компилятора. Этот файл генерируется аналогично файлам, генерируемым при компиляции Hardhat. Вы также можете попробовать [Hardhat compilation](https://remix-ide.readthedocs.io/en/latest/hardhat.html#enable-hardhat-compilation) от Remix.

source: Please note that in order to generate these artifact files, the **Generate contract metadata** box in the **General settings** section of the **Settings** module needs to be checked. By default, it is checked.
ja_jp: それらのアーティファクトファイルを生成するためには、** Settings** モジュールの **General settings** セクションにある **Generate contract metadata** ボックスにチェックが入っている必要があります。デフォルトではチェックされています。
pt_br: Por favor, note que para gerar esses arquivos de artefato, a caixa **Gerar metadados de contrato** na seção **Configurações gerais** do módulo de **Configurações** precisa estar marcada. Por padrão, está marcado.
ru_ru: Обратите внимание, что для генерации этих артефактных файлов необходимо установить флажок **Генерировать метаданные контракта** в разделе **Общие настройки** модуля **Настройки**. По умолчанию он установлен.

source: You can write scripts that can access either of these files.
ja_jp: これらのファイルのいずれかにアクセス可能なスクリプトを作成できます。
pt_br: Você pode escrever scripts que podem acessar qualquer um destes arquivos.
ru_ru: Вы можете написать сценарии, которые могут обращаться к любому из этих файлов.

source: Library Deployment with filename.json
ja_jp: filename.jsonを使用したライブラリのデプロイ
pt_br: Implantação de biblioteca com nomedoarquivo.json
ru_ru: Развертывание библиотеки с помощью файла filename.json

source: By default Remix automatically deploys needed libraries.
ja_jp: Remixでは、デフォルトで必要なライブラリを自動デプロイします。
pt_br: Por padrão, o Remix implanta automaticamente as bibliotecas necessárias.
ru_ru: По умолчанию Remix автоматически развертывает необходимые библиотеки.

source: When you open the metadata file for the libraries - **artifact/filename.json** you will see the following sections:
ja_jp: ライブラリのメタデータ - **artifact/filename.json** を開くと、次のセクションがあります:
pt_br: Quando você abrir o arquivo de metadados das bibliotecas - **artifact/nomedoarquivo.json** você verá as seguintes seções:
ru_ru: Когда Вы откроете файл метаданных для библиотек - **artifact/filename.json**, Вы увидите следующие разделы:

source: `linkReferences` contains a map representing libraries which depend on the current contract. Values are addresses of libraries used for linking the contract.
ja_jp: `linkReferences`には、現在のコントラクトに依存しているライブラリを表すマップが含まれています。値はライブラリのアドレスで、コントラクトをリンクするのに使用されます。
pt_br: `linkReferences` contém um mapa representando bibliotecas que dependem do contrato atual. Os valores são endereços de bibliotecas usadas para vincular o contrato.
ru_ru: `linkReferences` содержит карту, представляющую библиотеки, которые зависят от текущего контракта. Значениями являются адреса библиотек, используемых для связывания контракта.

source: `autoDeployLib` defines if the libraries should be auto deployed by Remix or if the contract should be linked with libraries described in `linkReferences`
ja_jp: `autoDeployLib` には、ライブラリがRemixによって自動デプロイされるか、`linkReferences`に記載されているライブラリとコントラクトをリンクするかが定義されています。
pt_br: `autoDeployLib` define se as bibliotecas deveriam ser implantadas automaticamente pelo Remix ou se o contrato deveria ser vinculado às bibliotecas descritas em `linkReferences`
ru_ru: `autoDeployLib` определяет, должны ли библиотеки быть автоматически развернуты Remix или контракт должен быть скомпонован с библиотеками, описанными в `linkReferences`.

source: Note that Remix will resolve addresses corresponding to the current network. By default, a configuration key follows the form: `<network_name>:<networkd_id>`, but it is also possible to define `<network_name>` or `<network_id>` as keys.
ja_jp: Remixは現在のネットワークに対応するアドレスに解決することに注意してください。デフォルトでは、設定キーはフォーム: `<network_name>:<networkd_id>` に従います。しかし、`<network_name>`または`<network_id>` をキーとして定義することも可能です。
pt_br: Note que o Remix resolverá os endereços correspondentes à rede atual. Por padrão, uma chave de configuração segue a forma: `<network_name>:<networkd_id>`, mas também é possível definir `<network_name>` ou `<network_id>` como chaves.
ru_ru: Обратите внимание, что Ремикс будет разрешать адреса, соответствующие текущей сети. По умолчанию ключ конфигурации имеет вид: `<network_name>:<networkd_id>`, но можно также определить в качестве ключей `<network_name>` или `<network_id>`.

source: Here is a sample metadata file for linking a library:
ja_jp: 以下は、ライブラリにリンクされるメタデータファイルのサンプルです:
pt_br: Aqui está um exemplo de arquivo de metadados para vincular uma biblioteca:
ru_ru: Здесь приведен пример файла метаданных для связывания библиотеки:
