Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/create_deploy.po
Languages: es_es, ja_jp, pt_br, ru_ru

source: Creating and Deploying a Contract
es_es: Crear y desplegar un contrato
ja_jp: コントラクトの作成とデプロイ
pt_br: Criando e implantando um contrato
ru_ru: Создание и развертывание контракта

source: Let's go through a basic workflow:
es_es: Vamos a pasar por un flujo de trabajo básico:
ja_jp: 以下が基本的なワークフローです:
pt_br: Vamos avançar por um fluxo de trabalho básico:

source: create a new file
es_es: crear un nuevo archivo
ja_jp: 新しいファイルを作成
pt_br: criar um novo arquivo

source: code a contract in the file
es_es: codificar un contrato en el archivo
ja_jp: ファイルにあるコントラクトのコーディング
pt_br: codifique um contrato no arquivo

source: compile the contract
es_es: compilar el contrato
ja_jp: コントラクトのコンパイル
pt_br: compile o contrato

source: deploy it to the local simulated blockchain (Remix VM)
es_es: desplegarlo en la cadena de bloques local simulada (Remix VM)
ja_jp: ローカルにシミュレートされているブロックチェーン(Remix VM)にデプロイ
pt_br: faça deploy dele para a blockchain simulada local (Remix VM)

source: interact with the deployed contract's functions
es_es: interactuar con las funciones del contrato desplegado
ja_jp: デプロイされたコントラクト関数とやり取りする
pt_br: interaja com as funções do contrato implantado

source: Creating a new file
es_es: Crear un nuevo archivo
ja_jp: 新しいファイルの作成
pt_br: Criando um novo arquivo

source: In the File Explorer, create a new file by clicking on the new file icon, and name it. The `.sol` is default extension in Remix, if a file is named without an extension, `.sol` will appended.
es_es: En el Explorador de archivos, cree un nuevo archivo haciendo clic en el icono del nuevo archivo y nómbrelo. El `.sol` es la extensión predeterminada en Remix, si un archivo se nombra sin una extensión, se añadirá `.sol`.
ja_jp: ファイルエクスプローラ内で、新規ファイルのアイコンをクリックして新しいファイルを作成し、名前を付けます。Remixにある'.sol'はデフォルトの拡張子です。拡張子を付けなかった場合は、自動的に'.sol'が加えられます。
pt_br: No Gerenciador de Arquivos, crie um novo arquivo clicando no novo ícone de arquivo e nomeando-o. A extensão `.sol` é padrão no Remix, se um arquivo for nomeado sem uma extensão, `.sol` será adicionado ao nome do arquivo.

source: **NOTE:** For information about templates or workspaces, see the [File Explorer docs](file_explorer.html).
es_es: **NOTA:** Para obtener información sobre plantillas o espacios de trabajo, consulte los [documentos del Explorador de archivos](file_explorer.html).
ja_jp: **注意:** テンプレートもしくはワークスペースについては、[ファイルエクスプローラのドキュメント](file_explorer.html)を参照してください。
pt_br: **NOTA:** Para obter informações sobre templates ou espaços de trabalho, consulte a [Documentação de Explorador de Arquivos](file_explorer.html).

source: In the editor, paste in the following contract into the empty file:
es_es: En el editor, pegue el siguiente contrato en el archivo vacío:
ja_jp: エディタで、空のファイルに次のコントラクトをペーストしてください:
pt_br: No editor, cole o seguinte contrato no arquivo vazio:

source: When pasting in code, make sure you understand it before deploying or interacting with it. Don't get scammed!
es_es: Al pegar código, asegúrese de entenderlo antes de implementarlo o interactuar con él. ¡No deje que le engañen!
ja_jp: コードを張り付ける時に、事前に内容を理解してから、デプロイまたは動作をさせてください。詐欺に引っかからないようにしましょう！
pt_br: Ao colar um código, certifique-se de entendê-lo antes de implantar ou interagir com ele. Não seja enganado!

source: Compile the Contract
es_es: Redactar el contrato
ja_jp: コントラクトのコンパイル
pt_br: Compilar o contrato
ru_ru: Составьте Контракт

source: With the contract above as the active tab in the Editor, compile the contract. A quick way to compile is to hit **ctrl + s**. You can also compile by going to the Solidity compiler and clicking the compile button, or by right clicking a file in the File Explorer, or by clicking the play button at the top of the Editor.
es_es: Con el contrato anterior como la pestaña activa en el Editor, compile el contrato. Una forma rápida de compilar es pulsar **ctrl + s**. También puede compilar yendo al compilador de Solidity y haciendo clic en el botón de compilación, o haciendo clic con el botón derecho en un archivo en el Explorador de archivos, o haciendo clic en el botón de reproducción en la parte superior del Editor.
ja_jp: エディタのアクティブなタブのコントラクトで、コントラクトのコンパイルをします。手早くコンパイルするには、 **ctrl + s** を押してください。または、Solidityコンパイラへ行きコンパイルすることもできます。その場合は、コンパイルボタンでクリックしてください。ファイルエクスプローラにあるファイルを右クリック、エディタのPlayボタンをクリックすることでも可能です。
pt_br: Com o contrato acima na aba ativa do Editor, compile o contrato. Uma maneira rápida de compilar é apertar **ctrl + s**. Você também pode compilar indo para o compilador Solidity e clicando no botão de compilação, ou clicando com o botão direito do mouse em um arquivo no Gerenciador de Arquivos, ou clicando no botão play no topo do Editor.

source: **For More Info** see the docs on the [Solidity Compiler](compile.html).
es_es: **Para obtener más información**, consulte los documentos en el [Compilador de Solidity](compile.html).
ja_jp: **より詳細な情報は**、 [Solidityコンパイラ](compile.html)のドキュメントをご覧ください。
pt_br: **Para mais informações** veja a documentação no [Compilador Solidity](compile.html).

source: Deploy the contract
es_es: Despliegue del contrato
ja_jp: コントラクトのデプロイ
pt_br: Implantar o contrato
ru_ru: Развертывание контракта

source: Go to the **Deploy & Run Transactions** plugin.
es_es: Vaya al plugin **Desplegar y ejecutar transacciones**.
ja_jp: **Deploy & Run Transactions** プラグインに移動します。
pt_br: Vá para o plugin **Implantar e Executar Transações**.
ru_ru: Перейдите к плагину **Deploy & Run Transactions**.

source: At the top of this plugin is the Environment select box. Here you can choose where you want to deploy your contract. There are many choices. For more info about these options see [this section](run.html#environment) of the docs.
es_es: En la parte superior de este complemento se encuentra el cuadro de selección de entorno. Aquí puede elegir dónde desea implementar su contrato. Hay muchas opciones. Para obtener más información sobre estas opciones, consulte [esta sección](run.html#environment) de los documentos.
ja_jp: Environment選択ボックスは、プラグインの最上部にあります。ここでは、あなたのコントラクトをデプロイしたい環境を選択できます。選択項目が多数あります。詳細については、ドキュメントの[こちらのセクション](run.html#environment)をご覧ください。
pt_br: Na parte superior deste plugin está a caixa de seleção do ambiente. Aqui você pode escolher onde quer implantar seu contrato. Há muitas escolhas. Para mais informações sobre essas opções, consulte [esta seção](run.html#environment) da documentação.

source: For a brief synopsis:
es_es: Para una breve sinopsis:
ja_jp: 概要:
pt_br: Para um breve sinopse:

source: **Injected Provider** is used to connect Remix with a Browser Wallet (e.g. Metamask) which is generally for deploying to a public network.
es_es: **Proveedor inyectado** se utiliza para conectar Remix con una cartera del navegador (por ejemplo, Metamask) que generalmente es para desplegar en una red pública.
ja_jp: **Injected Provider** は、ブラウザーウォレット(例: MetaMask)でRemixに接続する際に使われます。一般的に、これでパブリックネットワークにデプロイします。
pt_br: O **Provedor Injetado** é usado para conectar a Remix com uma Carteira do navegador (por exemplo, Metamask) que é usado geralmente para implantação em uma rede pública.

source: **Remix VM** is a test blockchain in the browser. There are quite a few "flavors" of the Remix VM. Each "flavor" is associated with a different hard fork with the name in parathesies - e.g. Remix VM (Shanghai) or for the choice of a chain to fork into the Remix VM.
es_es: **Remix VM** es una cadena de bloques de prueba en el navegador. Hay bastantes "sabores" del Remix VM. Cada "sabor" se asocia con una bifurcación diferente con el nombre en paréntesis, por ejemplo, Remix VM (Shanghai) o para la elección de una cadena a bifurcar en el Remix VM.
ja_jp: **Remix VM** は、ブラウザ上のテスト用ブロックチェーンです。Remix VMには、いくつかの「種類」があります。各「種類」には、それぞれ違うハードフォークの名前がカッコ内に記述されており関連付けられています。例: Remix VM (Shanghai)は、すなわちRemix VMでフォークのチェーンを選択したことになります。
pt_br: **Remix VM** é uma blockchain de teste no navegador. Existem alguns "sabores" da Remix VM. Cada "sabor" é associado a um fork diferente com o nome em parenteses - ex.: Remix VM (Shanghai) ou para a escolher uma rede para fazer o fork no Remix VM.

source: The **Remix VM** is convenient because it is a blockchain that runs in the browser and nothing else needs to be installed in order to run it.
es_es: La **Remix VM** es conveniente porque es una cadena de bloques que se ejecuta en el navegador y no es necesario instalar nada más para ejecutarla.
ja_jp: **Remix VM** は、ブラウザー上で実行されるブロックチェーンなので、実行するのにインストールが不要なため便利です。
pt_br: O **Remix VM** é conveniente porque é uma blockchain que executa no navegador e nada mais precisa ser instalado para poder executá-lo.

source: **Dev** is for connecting Remix to a local chain running on your computer.
es_es: **Dev** es para conectar Remix a una cadena local que se ejecuta en su computadora.
ja_jp: **Dev** は、Remixをあなたのコンピュータ上で実行しているローカルチェーンに接続します。
pt_br: **Dev** é para conectar Remix a uma rede local em execução no seu computador.

source: **L2** is for connecting Remix to Optimism or Abritrum via a browser wallet. Its essentially the same as Injected Provider, but it sets the wallet with the configuration of the specified L2.
es_es: **L2** es para conectar Remix a Optimism o Abritrum a través de una cartera de navegador. Es esencialmente lo mismo que el proveedor inyectado, pero establece la cartera con la configuración del L2 especificado.
ja_jp: **L2** は、RemixをOptimismやArbitrumへブラウザーウォレット経由で接続します。Injected Providerと本質的に違いはありませんが、特定のL2用に設定されたウォレットがセットされています。
pt_br: **L2** é para conectar Remix no Optimism ou Abritrum através de uma carteira do navegador. É essencialmente o mesmo que o Provedor Injetado, mas define a carteira com a configuração do L2 especificado.

source: (For details see [Running transactions](https://remix-ide.readthedocs.io/en/latest/run.html))
es_es: (Para más detalles, consulte [Transacciones en curso](https://remix-ide.readthedocs.io/en/latest/run.html))
ja_jp: (詳細は、[トランザクションの実行](https://remix-ide.readthedocs.io/en/latest/run.html)を参照してください)
pt_br: (Para mais detalhes, veja [Executando transações](https://remix-ide.readthedocs.io/en/latest/run.html))
ru_ru: (Подробнее см. раздел [Выполнение транзакций](https://remix-ide.readthedocs.io/en/latest/run.html))

source: Select the top Remix VM environment
es_es: Seleccione el mejor entorno de Remix VM
ja_jp: 最上部のRemix VM環境を選択する
pt_br: Selecione o ambiente Remix VM superior

source: Choose the top first Remix VM in the dropdown list.
es_es: Elija la primera máquina virtual de Remix en la lista desplegable.
ja_jp: ドロップダウンリストの最上部の最初にあるRemix VMを選択します。
pt_br: Escolha o primeiro Remix VM na lista de seleção.

source: The Remix VM comes with 10 accounts funded with 100 ether.
es_es: El Remix VM viene con 10 cuentas financiadas con 100 ether.
ja_jp: Remix VMには、100イーサを保有している10個のアカウントが付属しています。
pt_br: O Remix VM vem com 10 contas financiadas com 100 ether.

source: **NOTE:** When you are in the **Remix VM** and you reload the browser - the **Remix VM** will also restart to its fresh & default state. For a more realistic testing environment, use a public testnet.
es_es: **NOTA:** Cuando esté en la **Remix VM** y vuelva a cargar el navegador, la **Remix VM** también se reiniciará a su estado fresco y predeterminado. Para un entorno de prueba más realista, utilice una red de pruebas pública.
ja_jp: **注意:** **Remix VM**使用中に、ブラウザーをリロードすると、 **Remix VM** もまた再起動してリフレッシュされデフォルト状態に戻ります。よりリアルなテスト環境には、パブリックテストネットを使ってください。
pt_br: **NOTA:** Quando você estiver no **Remix VM** e você recarregar o navegador - o **Remix VM** também irá reiniciar para seu estado novo e padrão. Para um ambiente de teste mais realista, use uma rede de testes pública.

source: Deploying a contract
es_es: Desplegar un contrato
ja_jp: コントラクトのデプロイ
pt_br: Implantando um contrato
ru_ru: Развертывание контракта

source: The constructor of `testContract` needs a parameter of the type `uint256`. Input a uint256 and click on `Deploy`.
es_es: El constructor de `testContract` necesita un parámetro del tipo `uint256`. Introduzca un uint256 y haga clic en "Desplegar".
ja_jp: `testContract` のコンストラクタは、 `uint256`型のパラメータが必要です。 uint256を入力して`Deploy`をクリックしてください。
pt_br: O construtor do `testContract` precisa de um parâmetro do tipo `uint256`. Insira um uint256 e clique em `Implantar`.

source: The transaction is created which deploys the instance of `testContract` .
es_es: Se crea la transacción que despliega la instancia de `testContract` .
ja_jp: `testContract` のインスタンスがトランザクションのデプロイによって作成されます。
pt_br: A transação é criada que implementa a instância do `testContract`.
ru_ru: Создается транзакция, которая развертывает экземпляр `testContract`.

source: In a more realistic blockchain, you would have to approve the transaction and then wait for the transaction to be mined. However, because we are using the `Remix VM`, the execution is immediate.
es_es: En una cadena de bloques más realista, tendría que aprobar la transacción y luego esperar a que se extraiga la transacción. Sin embargo, debido a que estamos utilizando la `Remix VM`, la ejecución es inmediata.
ja_jp: 実際のブロックチェーンにおいては、トランザクションを承認し、トランザクションが作成されるのを待つ必要があります。しかし、 `Remix VM`を利用する場合は、即座に実行されます。
pt_br: Em uma blockchain mais realista, você teria que aprovar a transação e, em seguida, esperar até que a transação fosse minerada. No entanto, como estamos usando o `Remix VM`, a execução é imediata.

source: The terminal will give information about the transaction.
es_es: El terminal dará información sobre la transacción.
ja_jp: ターミナルにトランザクションに関する情報が表示されます。
pt_br: O terminal fornecerá informações sobre a transação.
ru_ru: Терминал выдаст информацию о транзакции.

source: The newly created instance is displayed in the **Deployed Contracts** section.
es_es: La instancia recién creada aparece en la sección **Contratos desplegados**.
ja_jp: **Deployed Contracts** セクションに新しく作成されたインスタンスが表示されます。
pt_br: A instância recém-criada é exibida na seção **Contratos implantados**.
ru_ru: Вновь созданный экземпляр отображается в разделе **Развернутые контракты**.

source: Interacting with the deployed instance
es_es: Interactuar con la instancia desplegada
ja_jp: デプロイされたインスタンスとのやり取り
pt_br: Interagindo com a instância do Contrato Inteligente implantada

source: Clicking on the caret to the left of the instance of TESTCONTRACT will expand it so its functions are visible.
es_es: Al hacer clic en la función a la izquierda de la instancia de TESTCONTRACT, se expandirá para que sus funciones sean visibles.
ja_jp: TESTCONTRACTのインスタンスの左にあるキャレットをクリックすると、その関数が展開され表示されます。
pt_br: Clicando no cursor à esquerda da instância do TESTCONTRACT irá expandi-lo para que suas funções sejam visíveis.

source: This new instance contains the 3 functions (`setP`, `setPN`, `get`).
es_es: Esta nueva instancia contiene las 3 funciones (`setP`, `setPN`, `get`).
ja_jp: 新しいインスタンスには3つの関数が含まれています(`setP`, `setPN`, `get`)。
pt_br: Esta nova instância contém 3 funções (`setP`, `setPN`, `get`).

source: Clicking on `setP` or `setPN` will create a new transaction.
es_es: Al hacer clic en `setP` o `setPN` se creará una nueva transacción.
ja_jp: `setP`または`setPN`をクリックして新しいトランザクションを作成してください。
pt_br: Clicando no `setP` ou `setPN` criará uma nova transação.

source: `setP` is a `payable` function (payable functions have red buttons). With a payable function, value (ETH) can be sent to the contract. The amount of ETH is chosen in the VALUE input field and the unit of ETH is selected in the box to the right.
es_es: `setP` es una función de "pago" (las funciones de pago tienen botones rojos). Con una función para pagos, el valor (ETH) se puede enviar al contrato. La cantidad de ETH se elige en el campo de entrada VALOR y la unidad de ETH se selecciona en el cuadro de la derecha.
ja_jp: `setP`は、 `payable` 関数(Payable関数は赤いボタン)。payable関数で、値(ETH)をコントラクトへ送信できます。ETHの総量は、VALUEフィールドで選択し、ETHの単位は右にあるボックスで選びます。
pt_br: `setP` é uma função `payable` (funções pagáveis têm botões vermelhos). Com uma função pagável, o valor (ETH) pode ser enviado para o contrato. A quantidade de ETH é escolhida no campo de entrada VALUE e a unidade de ETH está selecionada na caixa para a direita.

source: `setPN` is not payable (an orange button - depending on the theme). It is not possible to send value (Ether) to this function.
es_es: `setPN` no es función de pago (un botón naranja, dependiendo del tema). No es posible enviar valor (Ether) a esta función.
ja_jp: `setPN` はpayableではありません(テーマによって色が変わりますがオレンジボタンです) 。この関数に値(Ether)を送信することはできません。
pt_br: `setPN` não é pagável (um botão laranja - dependendo do tema). Não é possível enviar valor (Ether) para esta função.

source: `get` is a **view function** (a blue button - depending on the theme). It doesn't execute a transaction because a `get` does not modify the state (it is only returning the value of the variable `value`).
es_es: `get` es una **función de vista** (un botón azul, dependiendo del tema). No ejecuta una transacción porque un "get" no modifica el estado (solo devuelve el valor de la variable "valor").
ja_jp: `get`は、**ビュー関数**です(テーマによって変わりますがブルーのボタンです)。これはトランザクションを実行しません。理由としては、`get`は状態を変更しないためです(`value`変数の値を返すのみ)。
pt_br: `get` é uma **função de visualização** (um botão azul - dependendo do tema). Ele não executa uma transação porque um `get` não modifica o estado (ele está apenas retornando o valor da variável `value`).

source: The value that gets returned appears just below the `get` button.
es_es: El valor que se devuelve aparece justo debajo del botón "get".
ja_jp: 返された値は、`get` ボタンのすぐ下に表示されます。
pt_br: O valor que é retornado aparece logo abaixo do botão 'get'.

source: This page contains the process of creating a contract, compiling it, deploying and then interacting with it.
ru_ru: На этой странице описан процесс создания контракта, его компиляции, развертывания и последующего взаимодействия с ним.

source: A sample contract
ru_ru: Образец договора

source: This contract is very basic. The goal is to quickly start to create and to interact with a sample contract.
ru_ru: Этот контракт является очень базовым. Цель состоит в том, чтобы быстро начать создавать и взаимодействовать с образцом контракта.

source: Go to the File Explorer, create a new file, name it and in the editor paste the contract below.
ru_ru: Перейдите в Проводник файлов, создайте новый файл, назовите его и в редакторе вставьте приведенный ниже контракт.

source: With the contract above as the active tab in the Editor, compile the contract.
ru_ru: С контрактом, указанным выше, в качестве активной вкладки в Редакторе, скомпилируйте контракт.

source: **For More Info** see the docs on the ([Solidity Compiler](compile.html)).
ru_ru: **Для получения дополнительной информации** смотрите документацию по компилятору ([Solidity Compiler](compile.html)).

source: There are 3 type of environments Remix can be plugged to:
ru_ru: Существует 3 типа сред, к которым может быть подключен Remix:

source: Injected Web3
ru_ru: Инжектированный Web3

source: Web3 Provider
ru_ru: Провайдер Web3

source: Both **Injected Web3** and **Web3 Provider** require the use of an external tool.
ru_ru: Как **Injected Web3**, так и **Web3 Provider** требуют использования внешнего инструмента.

source: An external tool for **Injected provider** is Metamask. Some external tools used with **Web3 provider** are a Truffle Ganache-CLI, Hardhat node, or an Ethereum node itself.
ru_ru: Внешним инструментом для **Injected provider** является Metamask. Некоторые внешние инструменты, используемые с **Web3-провайдером**, - это Truffle Ganache-CLI, узел Hardhat или сам узел Ethereum.

source: The **JavaScript VM** is convenient because it is a blockchain that runs in your browser and you don't need any other software or Ethereum node to run it.
ru_ru: ВМ на **JavaScript** удобна тем, что это блокчейн, который запускается в Вашем браузере, и для его работы Вам не нужно никакого другого программного обеспечения или узла Ethereum.

source: **NOTE:** When you are in the **Javascript VM** and you reload the browser - the **Javascript VM** will restart to its fresh & default state.
ru_ru: **ПРИМЕЧАНИЕ:** Когда Вы находитесь в **Javascript VM** и перезагружаете браузер - **Javascript VM** перезапустится в свое свежее и стандартное состояние.

source: For performance purposes ( which is to say - for testing in an environment that is closest to the mainnet), it can be better to use an external node.
ru_ru: Для целей производительности (т.е. для тестирования в среде, наиболее приближенной к основной сети) может быть лучше использовать внешний узел.

source: Select the VM environment
ru_ru: Выберите среду ВМ

source: Make sure the VM mode is selected. All accounts displayed in **ACCOUNT** should have 100 ether.
ru_ru: Убедитесь, что выбран режим VM. Все счета, отображаемые в **ACCOUNT**, должны иметь 100 эфиров.

source: The constructor of `testContract` needs a parameter (of type `uint256`). Input a uint256 and click on `Deploy`.
ru_ru: Конструктору `testContract` необходим параметр (типа `uint256`). Введите uint256 и щелкните на кнопке `Deploy`.

source: In a "normal" blockchain, you would have to wait for the transaction to be mined. However, because we are using the `JavaScript VM`, our execution is immediate.
ru_ru: В "обычном" блокчейне Вам пришлось бы ждать, пока транзакция будет добыта. Однако, поскольку мы используем `JavaScript VM`, наша транзакция выполняется немедленно.

source: Interacting with an instance
ru_ru: Взаимодействие с экземпляром

source: Clicking on the caret to the left of the instance of TESTCONTRACT will open it up so you can see its function.
ru_ru: Щелчок по каретке слева от экземпляра TESTCONTRACT откроет его, чтобы Вы могли увидеть его функцию.

source: This new instance contains 3 actions which corresponds to the 3 functions (`setP`, `setPN`, `get`). Clicking on `setP` or `setPN` will create a new transaction.
ru_ru: Этот новый экземпляр содержит 3 действия, которые соответствуют 3 функциям (`setP`, `setPN`, `get`). Щелчок на `setP` или `setPN` приведет к созданию новой транзакции.

source: Note that `setP` is `payable` (red button) : it is possible to send value (Ether) to the contract.
ru_ru: Обратите внимание, что `setP` является `оплачиваемым` (красная кнопка): можно отправить стоимость (Ether) в контракт.

source: `setPN` is not payable (orange button - depending on the theme) : it is not possible to send value (Ether) to the contract.
ru_ru: `setPN` не оплачивается (оранжевая кнопка - в зависимости от темы) : невозможно отправить ценность (Ether) в контракт.

source: Clicking on `get` will not execute a transaction (usually its a blue button - depending on the theme). It doesn't execute a transaction because a `get` does not modify the state (the variable `value`) of this instance.
ru_ru: Щелчок на `get` не приведет к выполнению транзакции (обычно это синяя кнопка - в зависимости от темы). Транзакция не выполняется, потому что `get` не изменяет состояние (переменную `value`) данного экземпляра.

source: Because `get` is a **view function**, you can see the return value just below the `get` button.
ru_ru: Поскольку `get` - это **просмотровая функция**, Вы можете увидеть возвращаемое значение чуть ниже кнопки `get`.
