Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/debugger.po
Languages: pt_br, ru_ru

source: Debugger
pt_br: Depurador
ru_ru: Отладчик

source: The Debugger shows the contract's state while stepping through a transaction.
pt_br: O depurador mostra o estado do contrato enquanto executa passo-a-passo etapas de uma transação.
ru_ru: Отладчик показывает состояние контракта при прохождении транзакции.

source: It can be used on transactions created on Remix or by providing a transaction's hash. The latter assumes that you have the contract's source code or that you have input the address of a verified contract.
pt_br: Ele pode ser usado em transações criadas no Remix ou fornecendo hash de uma transação. O último presume que você tem o código-fonte do contrato ou que você inseriu o endereço de um contrato verificado.
ru_ru: Ее можно использовать для транзакций, созданных на Remix, или предоставив хэш транзакции. В последнем случае предполагается, что у Вас есть исходный код контракта или что Вы ввели адрес верифицированного контракта.

source: To start a debugging session either:
pt_br: Para iniciar uma sessão de depuração tanto:
ru_ru: Чтобы начать сеанс отладки, либо:

source: **Click** the debug button in the Terminal when a successful or failed transaction appears there. The Debugger will be activated and will gain the focus in the **Side Panel**.
pt_br: **Clique** no botão de depuração quando uma transação com sucesso ou com falha aparecer lá. O Depurador será ativado e ganhará o foco no **Painel Lateral**.
ru_ru: **Нажмите** кнопку отладки в Терминале, когда там появится успешная или неудачная транзакция. Отладчик будет активирован и получит фокус на **Боковой панели**.

source: **Activate** the Debugger in the Plugin Manager and then click the bug in the icon panel. To start the debugging session, input the address of a deployed transaction - while having the source code in the editor and then click the **Start debugging** button.
pt_br: **Ative** o Depurador no Gerenciador de Plugin e, em seguida, clique no bug no painel de ícone. Para iniciar a sessão de depuração, entrada o endereço de uma transação implantada - enquanto tem o código-fonte no editor e, em seguida, clique no botão **Iniciar depuração**.
ru_ru: **Активируйте** отладчик в Менеджере плагинов, а затем щелкните по ошибке на панели пиктограмм. Чтобы начать сеанс отладки, введите адрес развернутой транзакции - при этом исходный код должен находиться в редакторе, а затем щелкните на кнопке **Начать отладку**.

source: The debugger will highlight the relevant code in the Editor. If you want to go back to editing the code without the Debugger's highlights, then click the **Stop Debugging** button.
pt_br: O depurador irá destacar o código relevante no Editor. Se você quiser voltar para editar o código sem os destaques do Depurador, então clique no botão **Parar depuração**.
ru_ru: Отладчик выделит соответствующий код в Редакторе. Если Вы хотите вернуться к редактированию кода без подсветки отладчика, то щелкните на кнопке **Стоп отладки**.

source: To learn more about how to use this tool go to the [Debugging Transactions](tutorial_debug.html) page.
pt_br: Para saber mais sobre como usar esta ferramenta, vá para a página [Transações de Depuração](tutorial_debug.html).
ru_ru: Чтобы узнать больше о том, как использовать этот инструмент, перейдите на страницу [Отладка транзакций](tutorial_debug.html).

source: This page will go over the Debugger's *Use generated sources* option, its navigation and its panels.
pt_br: Esta página detalhará a opção *Usar fontes geradas do depurador*, sua navegação e seus painéis.
ru_ru: На этой странице мы рассмотрим опцию *Использовать сгенерированные источники* Отладчика, его навигацию и панели.

source: Use generated sources
pt_br: Usar fontes geradas
ru_ru: Используйте сгенерированные источники

source: This option is available for contracts using Solidity 0.7.2 or greater. See the solidity blog for more details about [generated sources](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).
pt_br: Esta opção está disponível para contratos usando Solidity 0.7.2 ou superior. Veja o blog do Solidity para mais detalhes sobre [fontes geradas](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).

source: Using **generated sources** will make it easier to audit your contracts. When the option is checked, you can step into those compiler outputs — while debugging.
pt_br: Usar **fontes geradas** tornará mais fácil a auditoria de seus contratos. Quando a opção é marcada, você pode entrar nessas saídas do compilador — durante a depuração.
ru_ru: Использование **генерируемых исходных текстов** облегчит аудит Ваших контрактов. Когда опция отмечена, Вы можете зайти в эти выходные данные компилятора - во время отладки.

source: These compiler outputs will appear in a separate .yul file in the Remix editor.
pt_br: Essas saídas do compilador aparecerão em um arquivo .yul separado no editor Remix.
ru_ru: Эти выходные данные компилятора появятся в отдельном файле .yul в редакторе Remix.

source: The Debugger's Navigation
pt_br: Navegação do Deputador
ru_ru: Навигация отладчика

source: Slider & buttons
pt_br: Slider e botões
ru_ru: Слайдер и кнопки

source: Moving the slider will highlight the relevant code in the **Editor**. On the most granular level, it scrolls through a transaction's opcodes (**see the opcode section below**). At each opcode, the transaction's state changes and these changes are reflected in the **Debugger's panels**.
pt_br: Mover o controle deslizante irá destacar o código relevante no **Editor**. No nível mais granular, ele rola através de opcodes da transação (**veja a seção opcode abaixo**). Em cada opcode, o estado da transação muda e essas alterações são refletidas nos **painéis do depurador**.
ru_ru: Перемещение ползунка выделит соответствующий код в **Редакторе**. На самом подробном уровне он прокручивает опкоды транзакции (**см. раздел "Опкоды" ниже**). При каждом опкоде состояние транзакции изменяется, и эти изменения отражаются на панелях **Отладчика**.

source: Step over back
pt_br: Voltar um passo atrás
ru_ru: Шаг назад

source: This button goes to the previous opcode. If the previous step involves a **function call**, function will not be entered.
pt_br: Este botão vai para o opcode anterior. Se a etapa anterior envolve uma **chamada de função**, essa função não será entrada.
ru_ru: Эта кнопка переходит к предыдущему опкоду. Если предыдущий шаг включает **вызов функции**, функция не будет введена.

source: Step back
pt_br: Voltar um passo
ru_ru: Шаг назад

source: This button steps back to the previous opcode.
pt_br: Este botão volta para o opcode anterior.
ru_ru: Эта кнопка выполняет возврат к предыдущему опкоду.

source: Step into
pt_br: Entrar em
ru_ru: Шаг в

source: This button advances to the next opcode. If the next line contains a function call, **Step into** will go into the function.
pt_br: Este botão avança para o próximo opcode. Se a próxima linha contiver uma chamada de função, **Passo em** entrará na função.
ru_ru: Эта кнопка переводит к следующему опкоду. Если следующая строка содержит вызов функции, то **Step into** перейдет в функцию.

source: Step over forward
pt_br: Passar adiante
ru_ru: Шаг вперед

source: This button advances to the next opcode. If the next step involves a **function call**, function will not be entered.
pt_br: Este botão avança para o próximo opcode. Se a próxima etapa envolve uma **chamada de função**, não entraremos na função.
ru_ru: Эта кнопка переводит к следующему опкоду. Если следующий шаг включает в себя **вызов функции**, функция не будет введена.

source: Jump to the previous breakpoint
pt_br: Ir para o ponto de interrupção anterior
ru_ru: Переход к предыдущей точке останова

source: Breakpoints can be placed in the gutter of the Editor. If the current step in the call has passed a breakpoint, this button will move the slider to the most recently passed breakpoint.
pt_br: Pontos de interrupção podem ser colocados no espaçamento do Editor. Se a etapa atual na chamada tiver passado um ponto de quebra, este botão irá mover o controle deslizante para o ponto de interrupção mais recentemente passado.
ru_ru: Точки останова могут быть размещены в желобе Редактора. Если на текущем шаге вызова была пройдена точка останова, эта кнопка переместит ползунок на последнюю пройденную точку останова.

source: Jump out
pt_br: Saltar para fora
ru_ru: Выпрыгнуть

source: When you are in a call and click on this button, the slider will be moved to the end of the call.
pt_br: Quando estiver em uma chamada e clicar neste botão, o controle deslizante será movido para o final da chamada.
ru_ru: Когда Вы находитесь в разговоре и щелкаете на этой кнопке, слайдер будет перемещен в конец разговора.

source: Jump to the next breakpoint
pt_br: Ir para o próximo ponto de interrupção
ru_ru: Переход к следующей точке останова

source: If a breakpoint is ahead in the code, this button will advance to that point.
pt_br: Se um ponto de interrupção estiver à frente no código, este botão avançará para esse ponto.
ru_ru: Если впереди в коде находится точка останова, эта кнопка переместит Вас к этой точке.

source: The Debugger's Panels
pt_br: Os painéis do depurador
ru_ru: Панели отладчика

source: Function Stack
pt_br: Pilha de função
ru_ru: Стек функций

source: The Function stack lists the functions that the transaction is interacting with.
pt_br: A pilha de função lista as funções com que a transação está interagindo.
ru_ru: В стеке Function перечислены функции, с которыми взаимодействует транзакция.

source: Solidity Locals
pt_br: Variáveis Solidity Locais

source: The Solidity Locals are the local variables inside a function.
pt_br: As variáveis Solidity locais são as variáveis locais dentro de uma função.
ru_ru: Локальные переменные Solidity Locals - это локальные переменные внутри функции.

source: Solidity State
pt_br: Estado do Solidity
ru_ru: Состояние солидности

source: These are the state variables of the contract.
pt_br: Estas são as variáveis de estado do contrato.
ru_ru: Это переменные состояния контракта.

source: This panel shows the step number and the **opcode** that the debugger is currently on.
pt_br: Este painel mostra o número do passo e o **opcode** em que o depurador está ativado.
ru_ru: На этой панели отображается номер шага и **опкод**, на котором в данный момент находится отладчик.

source: ![](images/a-debug-opcodes1.png)
pt_br: ![](images/a-debug-sol-locals.png)

source: As you drag the **slider** (which is above the navigation buttons), the focussed step number & opcode changes.
pt_br: À medida que você arrasta o **controle deslizante** (que está acima dos botões de navegação), o número do passo focado e as alterações de opcode.
ru_ru: По мере того, как Вы перетаскиваете **слайдер** (который находится над кнопками навигации), номер и опкод фокусируемого шага изменяются.

source: Step details
pt_br: Detalhes do passo
ru_ru: Детали шага

source: Step details shows more info about the opcode step.
pt_br: Detalhes do passo mostra mais informações sobre a etapa de opcode.
ru_ru: Детали шага показывают более подробную информацию о шаге опкода.

source: Stack
pt_br: Pilha
ru_ru: Стек

source: This panel shows the EVM Stack.
pt_br: Este painel mostra o stack EVM.
ru_ru: На этой панели показан стек EVM.

source: For more info about the [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).
pt_br: Para obter mais informações sobre o [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).
ru_ru: Более подробная информация о [stack](https://en.wikipedia.org/wiki/Stack_(abstract_data_type)).

source: Memory
pt_br: Memória
ru_ru: Память

source: Memory is cleared for each new message call. Memory is linear and can be addressed at byte level. **Reads** are limited to a width of 256 bits while **writes** can be either 8 bits or 256 bits wide.
pt_br: A memória é limpa para cada nova chamada de mensagem. A memória é linear e pode ser tratada no nível de byte. **Leituras** são limitadas a uma largura de 256 bits, enquanto **escrita** pode ter 8 bits ou 256 bits de largura.
ru_ru: Память очищается для каждого нового вызова сообщения. Память является линейной и может быть адресована на уровне байтов. Ширина **чтения** ограничена 256 битами, а **записи** могут быть как 8, так и 256 битами.

source: The Memory panel consists of 3 columns. You might need to make Remix's side panel a bit wider to get the formatting to be correct. (Drag the border between the main panel and the side panel to the right).
pt_br: O painel de memória consiste em 3 colunas. Você precisará fazer o painel do lado do Remix um pouco mais largo para que a formatação esteja correta. (Arraste a borda entre o painel principal e o painel lateral para a direita).
ru_ru: Панель Memory состоит из 3 колонок. Возможно, Вам придется сделать боковую панель Ремикса немного шире, чтобы форматирование было правильным. (Перетащите границу между основной и боковой панелью вправо).

source: The 1st column is the location in memory. The 2nd column is the hex encoded value. The 3rd column is the decoded value. If there is nothing, then the question marks (**?**) will show - like this:
pt_br: A primeira coluna é o local na memória. A segunda coluna é o valor codificado em hexadecimal. A terceira coluna é o valor decodificado. Se não houver nada, as interrogações (**?**) serão mostradas - como esta:
ru_ru: 1-я колонка - это место в памяти. 2-й столбец - закодированное в шестнадцатеричном формате значение. 3-я колонка - декодированное значение. Если ничего нет, то будут показаны знаки вопроса (**?**) - примерно так:

source: Here is a full example of the **Memory** panel,
pt_br: Aqui está um exemplo completo do painel **Memória**,
ru_ru: Здесь приведен полный пример панели **Память**,

source: Some address slots have hex encoded values and those values are then decoded. For example, check position **0xa0** and **0x140**.
pt_br: Alguns slots de endereços têm valores hexadecimais e esses valores são então decodificados. Por exemplo, verifique a posição **0xa0** e **0x140**.
ru_ru: Некоторые адресные позиции имеют значения в шестнадцатеричной кодировке, и эти значения затем декодируются. Например, проверьте позиции **0xa0** и **0x140**.

source: Storage
pt_br: Armazenamento
ru_ru: Хранение

source: This is the persistent storage.
pt_br: Este é o armazenamento persistente.

source: Call Stack
pt_br: Pilha de chamadas
ru_ru: Стек вызовов

source: All computations are performed on a data array called the **call stack**. It has a maximum size of 1024 elements and contains words of 256 bits.
pt_br: Todos os cálculos são executados em um array de dados chamado **pilha de chamadas**. Tem um tamanho máximo de 1024 elementos e contém palavras de 256 bits.
ru_ru: Все вычисления выполняются в массиве данных, называемом **стеком вызовов**. Он имеет максимальный размер 1024 элемента и содержит слова по 256 бит.

source: Call Data
pt_br: Dados da chamada
ru_ru: Данные о звонках

source: The call data contains the functions parameters.
pt_br: Os dados da chamada contêm os parâmetros das funções.
ru_ru: Данные вызова содержат параметры функций.

source: Return Value
pt_br: Valor de retorno
ru_ru: Возвращаемое значение

source: The refers to the value that the function will return.
pt_br: A referência ao valor que a função retornará.
ru_ru: The ссылается на значение, которое вернет функция.

source: Full Storage Changes
pt_br: Mudanças no Armazenamento completo
ru_ru: Полные изменения в хранилище

source: This shows the persistent storage at the end of the function.
pt_br: Isto mostra o armazenamento persistente no final da função.

source: Breakpoints
pt_br: Pontos de interrupção
ru_ru: Точки останова

source: Breakpoints can be placed in the gutter of the Editor to pause the debugger.
pt_br: Pontos de interrupção podem ser colocados no espaçamento do Editor para pausar o depurador.
ru_ru: Точки останова могут быть размещены в желобе Редактора для приостановки работы отладчика.

source: Additional Info
pt_br: Informações Adicionais
ru_ru: Дополнительная информация

source: The debugger's granular information gives users detailed information about what is happening in a transaction - so not only is the debugger good for debugging, it is also an excellent teaching tool.
pt_br: As informações granular do depurador dão aos usuários informações detalhadas sobre o que está acontecendo em uma transação - então não só o depurador é bom para depuração, é também um excelente instrumento de ensino.
ru_ru: Гранулированная информация отладчика дает пользователям подробную информацию о том, что происходит в транзакции - поэтому отладчик не только хорош для отладки, но и является отличным инструментом обучения.

source: To learn about using the debugger, go to [Debugging Transactions](tutorial_debug.html).
pt_br: Para aprender a usar o depurador, vá para [Transações de depuração](tutorial_debug.html).
ru_ru: Чтобы узнать об использовании отладчика, перейдите к разделу [Отладка транзакций](tutorial_debug.html).

source: This option is available for contracts using Solidity 0.7.2 or greater. See the solidity blog for more details about [generated sourcess](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features).
ru_ru: Эта опция доступна для контрактов, использующих Solidity 0.7.2 или более позднюю версию. Более подробную информацию о [generated sourcess](https://blog.soliditylang.org/2020/09/28/solidity-0.7.2-release-announcement/#notable-new-features) см. в блоге Solidity.

source: Slider
ru_ru: Слайдер

source: Opcodes
ru_ru: Опкоды

source: This is the persistant storage.
ru_ru: Это персистентное хранилище.

source: This shows the persistant storage at the end of the function.
ru_ru: Это показывает персистентное хранилище в конце функции.
