Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/FAQ.po
Languages: pt_br, ru_ru

source: FAQ
pt_br: Perguntas frequentes (FAQ)
ru_ru: ЧаВо

source: Supported devices & Browsers
pt_br: Dispositivos & Navegadores Suportados
ru_ru: Поддерживаемые устройства и браузеры

source: **Q:** What browsers will Remix work on?
pt_br: **P:** Em quais navegadores o Remix funcionará?
ru_ru: **Q:** На каких браузерах будет работать Remix?

source: **A:** We support Firefox, Chrome, and Brave. We do not test or look for errors in Safari, Edge or other browsers.
pt_br: **R:** Oferecemos suporte ao Firefox, Chrome e Brave. Não testamos ou procuramos por erros no Safari, Edge ou outros navegadores.
ru_ru: **А:** Мы поддерживаем Firefox, Chrome и Brave. Мы не тестируем и не ищем ошибки в Safari, Edge или других браузерах.

source: **Q:** Will Remix work on a tablet or mobile device?
pt_br: **P:** O Remix funcionará em um tablet ou dispositivo móvel?
ru_ru: **В:** Будет ли Remix работать на планшете или мобильном устройстве?

source: **A:** We do not support the use of Remix on tablets or mobile phones.
pt_br: **R:** Não oferecemos suporte para o uso do Remix em tablets ou celulares.
ru_ru: **А:** Мы не поддерживаем использование Ремикса на планшетах или мобильных телефонах.

source: General
pt_br: Geral
ru_ru: Общие

source: **Q:** Are there keyboard shortcuts in Remix?
pt_br: **P:** Há atalhos de teclado no Remix?
ru_ru: **В:** Существуют ли в Ремиксе комбинации клавиш?

source: **A:** Yes - here is the list of keyboard shortcuts:
pt_br: **R:** Sim - aqui está a lista de atalhos de teclado:
ru_ru: **A:** Да - вот список комбинаций клавиш:

source: `Ctrl+S`: Compiles the active Solidity file
pt_br: `Ctrl+S`: Compila o arquivo Solidity ativo
ru_ru: `Ctrl+S`: Компилирует активный файл Solidity

source: `Ctrl+Shift+S`: Compiles a Solidity file and runs a script when the script is displayed in the editor.<br>(go [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) for more info about this functionality)
pt_br: `Ctrl+Shift+S`: Compila um arquivo Solidity e executa um script quando o script é mostrado no editor.<br>(vá [here](running_js_scripts.html#compile-a-contract-and-run-a- script-on-the-fly) para mais informações sobre esta funcionalidade)

source: `Ctrl+Shift+F` : Opens the File Explorer
pt_br: `Ctrl+Shift+F` : Abre o Explorador de Arquivos
ru_ru: `Ctrl+Shift+F` : Открывает Проводник файлов.

source: `CTRL+Alt+F` : Formats the code in the current file
pt_br: `CTRL+Alt+F` : Formata o código no arquivo atual

source: `Ctrl+Shift+A` : Opens the Plugin Manager
pt_br: `Ctrl+Shift+A` : Abre o Gerenciador de Plugins
ru_ru: `Ctrl+Shift+A` : Открывает Менеджер Плагинов.

source: Solidity compiler
pt_br: Compilador do Solidity
ru_ru: Компилятор Solidity

source: **Q:** Error: compiler might be in a non-sane state
pt_br: **P:** Erro: o compilador pode estar em um estado instável
ru_ru: **Q:** Ошибка: компилятор может находиться в невменяемом состоянии

source: **A:** Old versions of solidity compiler had this problem with chrome. Please change the compiler version in Solidity Plugin to the newer one or use another browser.
pt_br: **R:** Versões antigas do compilador do Solidity apresentavam esse problema com o Chrome. Por favor, altere a versão do compilador do Solidity Plugin para a mais recente ou use outro navegador.
ru_ru: **A:** Старые версии компилятора Solidity имели эту проблему с хромом. Пожалуйста, измените версию компилятора в Solidity Plugin на более новую или используйте другой браузер.

source: **Q:** I’m getting an issue with Maximum call stack exceed and various other errors, can't compile.
pt_br: **P:** Estou tendo um problema com a pilha de chamadas máxima excedida e vários outros erros, não consigo compilar.
ru_ru: **Q:** Я получаю проблему с превышением максимального стека вызовов и различные другие ошибки, не могу скомпилировать.

source: **A:** Try a different browser or a newer solidity compiler version.
pt_br: **R:** Tente um navegador diferente ou uma versão mais recente do compilador do Solidity.
ru_ru: **A:** Попробуйте использовать другой браузер или более новую версию компилятора solidity.

source: **Q:** How to verify a contract that imports other contracts?
pt_br: **P:** Como verificar um contrato que importa outros contratos?
ru_ru: **Q:** Как проверить контракт, который импортирует другие контракты?

source: **A:** The verification tool does not recursively go through the import statements in a contract. So can only verify a 'flattened' contract.
pt_br: **R:** A ferramenta de verificação não analisa recursivamente as declarações de importação de um contrato. Portanto, só podemos verificar um contrato 'simplificado'.
ru_ru: **A:** Инструмент проверки не рекурсивно просматривает операторы импорта в контракте. Поэтому он может проверить только "сглаженный" контракт.

source: A contract can be 'flattened' by right-clicking on it in the File Explorer and choosing the `Flatten` option. This will assemble all the original code as well as the imported code into a single file.
pt_br: Um contrato pode ser 'unificado' clicando com o botão direito nele no Explorador de Arquivos e escolhendo a opção `Unificar`. Isso montará todo o código original, bem como o código importado, em um único arquivo.

source: Deploy & Run
pt_br: Implantar & Executar
ru_ru: Развертывание и запуск

source: **Q:** I am using an Infura endpoint in my app, but when I try to deploy against that endpoint in Remix IDE selecting "External HTTP Provider" and putting my endpoint in, it's telling me that it can't connect
pt_br: **P:** Estou usando um endpoint Infura em meu aplicativo, mas quando tento implantar nesse endpoint na IDE do Remix, selecionando o "Provedor HTTP Externo" e inserindo o meu endpoint, ele informa que não pode se conectar
ru_ru: **Вопрос:** Я использую конечную точку Infura в своем приложении, но когда я пытаюсь развернуть его в Remix IDE, выбрав "External HTTP Provider" и вставив свою конечную точку, он сообщает мне, что не может подключиться.

source: **A:** If the endpoint you are using is http, it won't work.
pt_br: **R:** Se o endpoint que você está usando for http, não funcionará.
ru_ru: **A:** Если конечная точка, которую Вы используете, является http, то это не сработает.

source: **Q:** Where is deploy button?
pt_br: **P:** Onde está o botão de implantação?
ru_ru: **Q:** Где находится кнопка развертывания?

source: **A:** It's in the **Deploy & Run Transactions** module.
pt_br: **R:** Está no módulo **Implantar & Executar Transações**.

source: **Q:** How to pass a tuple to a public function in Remix?
pt_br: **P:** Como passar uma tupla para uma função pública no Remix?
ru_ru: **В:** Как передать кортеж в публичную функцию в Remix?

source: **A:** Pass it as an array [].
pt_br: **R:** Passe-o como uma matriz [].
ru_ru: **А:** Передайте его в виде массива [].

source: **Q:** How to input a struct as input to a parameter of a function in the Deploy & Run module?
pt_br: **P:** Como inserir um struct (estrutura) como entrada para um parâmetro de uma função no módulo Implantar & Executar?
ru_ru: **Q:** Как ввести struct в качестве входного параметра функции в модуле Deploy & Run?

source: **A:** For inputting a struct, just like a tuple, pass it in as an array []. Also you need to put in the line:
pt_br: **R:** Para inserir um struct, assim como uma tupla, passe-o como um array []. Você também precisa colocar na linha:
ru_ru: **A:** Для ввода структуры, как и кортежа, передавайте ее в виде массива []. Также Вам необходимо вставить строку:

source: `pragma experimental ABIEncoderV2;` at the top of the solidity file.
pt_br: `pragma experimental ABIEncoderV2;` no topo do arquivo solidity.
ru_ru: `pragma experimental ABIEncoderV2;` в верхней части файла solidity.

source: For example, here's a solidity file with a struct as an input parameter.
pt_br: Por exemplo, aqui está um arquivo Solidity com um struct como parâmetro de entrada.

source: The input of initPeepToPeeps takes a struct. If you input `[1,2]` the transaction will go through.
pt_br: A entrada de initPeepToPeeps usa um struct. Se você inserir `[1,2]` a transação será concluída.
ru_ru: На вход initPeepToPeeps принимается структура. Если Вы введете `[1,2]`, то транзакция пройдет.

source: Plugin Developers
pt_br: Desenvolvedores de Plugins
ru_ru: Разработчики плагинов

source: **Q:** Where do plugin developers go with their questions?
pt_br: **P:** Para onde os desenvolvedores de plugins vão com suas dúvidas?
ru_ru: **В:** Куда разработчики плагинов обращаются со своими вопросами?

source: **A:** First, join our [Discord server](https://discord.gg/zUNteAzJs3) and then go to the development-plugin channel.
pt_br: **R:** Primeiro, entre em nosso [servidor do Discord](https://discord.gg/zUNteAzJs3) e então vá para o canal de plugins de desenvolvimento.

source: Analytics
pt_br: Estatísticas
ru_ru: Аналитика

source: **Q:** What information does Remix save when Matomo Analytics is enabled?
pt_br: **P:** Quais informações o Remix salva quando o Matomo Analytics está ativado?
ru_ru: **В:** Какую информацию сохраняет Remix, когда включена функция Matomo Analytics?

source: **A:** We want to know:
pt_br: **R:** Queremos saber:
ru_ru: **A:** Мы хотим знать:

source: Which plugins get activated & deactivated
pt_br: Quais plugins são ativados e desativados
ru_ru: Какие плагины активируются и деактивируются

source: If users check the box to publish a contract's metadata when deploying
pt_br: Se os usuários marcarem a caixa para publicar os metadados do contrato ao implantar
ru_ru: Если пользователи устанавливают флажок для публикации метаданных контракта при развертывании

source: Which themes are used/used most/not used at all
pt_br: Quais temas são usados/mais usados/não usados de forma alguma
ru_ru: Какие темы используются / используются чаще всего / не используются вообще

source: The usage of the links to documentation
pt_br: O uso dos links para documentação
ru_ru: Использование ссылок на документацию

source: On the homepage, which file importing buttons are used
pt_br: Na página inicial, quais botões de importação de arquivos são usados
ru_ru: На главной странице, какие кнопки импорта файлов используются

source: **Q:** Is it opt-in or opt-out?
pt_br: **P:** É opcional ou não?
ru_ru: **В:** Это opt-in или opt-out?

source: **A:** We use Matomo as an opt-in analytics platform.
pt_br: **R:** Usamos o Matomo como uma plataforma de análise de adesões.
ru_ru: **А:** Мы используем Matomo в качестве платформы аналитики по выбору.

source: **Q:** Where is the info stored? Is the info shared with 3rd parties?
pt_br: **P:** Onde as informações estão armazenadas? As informações são compartilhadas com terceiros?
ru_ru: **Вопрос:** Где хранится информация? Передается ли информация третьим лицам?

source: **A:** All data collected through Matomo is stored on our server. No data is given to third parties.
pt_br: **R:** Todos os dados coletados pelo Matomo são armazenados em nosso servidor. Nenhum dado é fornecido a terceiros.

source: We respect your privacy and do not collect nor store any personally identifiable information (PII).
pt_br: Respeitamos a sua privacidade e não coletamos nem armazenamos nenhuma informação pessoal identificável (PII).
ru_ru: Мы уважаем вашу конфиденциальность и не собираем и не храним никакой личной информации (PII).

source: **Q:** What does Remix do with this info?
pt_br: **P:** O que o Remix faz com essas informações?
ru_ru: **В:** Что Remix делает с этой информацией?

source: **A:** Our goal is to understand how many users we have, what plugins people are using, what is not getting used, what is not being used to its full potential.
pt_br: **R:** Nosso objetivo é entender quantos usuários nós temos, quais plugins as pessoas estão usando, o que não está sendo usado, o que não está sendo usado em todo o seu potencial.
ru_ru: **A:** Наша цель - понять, сколько у нас пользователей, какие плагины люди используют, что не используется, что используется не в полной мере.

source: With this understanding, we can make adjustments to the UI as well as providing more tips and documentation. It's a way of getting constant anonymous feedback from our users.
pt_br: Com esse entendimento, nós podemos fazer ajustes na UI, bem como fornecer mais dicas e documentação. É uma forma de obter feedback anônimo constante de nossos usuários.
ru_ru: Понимая это, мы можем вносить коррективы в пользовательский интерфейс, а также предоставлять больше советов и документации. Это способ получения постоянной анонимной обратной связи от наших пользователей.

source: **Q:** After I agree opt-in, can I change my mind?
pt_br: **P:** Depois que eu concordar com a adesão, eu posso mudar de ideia?
ru_ru: **В:** После того, как я соглашусь с opt-in, могу ли я изменить свое решение?

source: **A:** You can turn off or on Matomo in the Settings panel. There are no consequences for not opting-in or opting-out.
pt_br: **R:** Você pode ativar ou desativar o Matomo no painel Configurações. Não há consequências por não aderir ou não.
ru_ru: **А:** Вы можете отключить или включить Matomo в панели Настройки. Отказ от включения или выключения не влечет за собой никаких последствий.

source: `Ctrl+Shift+S`: Compiles a Solidity file and runs a script when the script is displayed in the editor.<br>(go [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) more info about this functionality)
ru_ru: `Ctrl+Shift+S`: Компилирует файл Solidity и запускает скрипт, когда скрипт отображается в редакторе.<br>(перейдите по ссылке [here](running_js_scripts.html#compile-a-contract-and-run-a-script-on-the-fly) больше информации об этой функциональности)

source: There is a plugin called `Flattener` which will stuff all the original code and the imported code into a single file.
ru_ru: Существует плагин под названием `Flattener`, который запихнет весь оригинальный код и импортированный код в один файл.

source: **A:** Its in the Deploy & Run module. If you haven't activated that module, you should do that by clicking Deploy & Run module in the Plugin Manager. You could also activate everything you need to work with solidity on the landing page ( click the remix logo at the top left for the screen) and click the "Solidity" button in the environment section.
ru_ru: **A:** Он находится в модуле Deploy & Run. Если Вы не активировали этот модуль, Вам следует сделать это, щелкнув на модуле Deploy & Run в Менеджере плагинов. Вы также можете активировать все необходимое для работы с solidity на целевой странице (щелкните на логотипе remix в левом верхнем углу экрана) и щелкните на кнопке "Solidity" в разделе окружения.

source: For example, here's a solidity file with a struct is an input parameter.
ru_ru: Например, вот файл solidity, структура которого является входным параметром.

source: **A:** The Gitter Remix plugin developers room https://gitter.im/ethereum/remix-dev-plugin
ru_ru: **A:** Комната разработчиков плагина Gitter Remix https://gitter.im/ethereum/remix-dev-plugin.

source: **A:** All data collected through Matomo is stored on our own server. No data is given to third parties.
ru_ru: **А:** Все данные, собранные с помощью Matomo, хранятся на нашем собственном сервере.Никакие данные не передаются третьим лицам.
