Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/file_explorer.po
Languages: pt_br, ru_ru

source: File Explorer
pt_br: Explorador de Arquivos
ru_ru: Проводник файлов

source: The File Explorer is for managing workspaces and files. This plugin also contains many shortcuts and commands. For a quick tour, right-click on a file to get a pop-up menu and also check the hamburger menu at the top right of the plugin.
pt_br: O Gerenciador de Arquivos é para gerenciar áreas de trabalho e arquivos. Este plugin também contém muitos atalhos e comandos. Para um tour rápido, clique com o botão direito em um arquivo para obter um menu pop-up e também marque o menu do hambúrguer no canto superior direito do plugin.
ru_ru: File Explorer предназначен для управления рабочими пространствами и файлами. Этот плагин также содержит множество ярлыков и команд. Для быстрого просмотра щелкните правой кнопкой мыши на файле, чтобы получить всплывающее меню, а также загляните в гамбургер-меню в правом верхнем углу плагина.

source: To find the File Explorer module - click the File Explorer icon.
pt_br: Para encontrar o módulo Gerenciador de Arquivos - clique no ícone do Gerenciador de Arquivos.
ru_ru: Чтобы найти модуль File Explorer - щелкните на значке File Explorer.

source: The green checkmark at the top of the page means that this plugin is maintained by Remix Team. When the caret is clicked, more info about the plugin will be shown -including a link to this documentation.
pt_br: A marca verde no topo da página significa que este plugin é mantido pelo time Remix. Quando o cursor é clicado, mais informações sobre o plugin serão mostradas -incluindo um link para esta documentação.
ru_ru: Зеленая галочка в верхней части страницы означает, что этот плагин поддерживается командой Remix Team. При нажатии на галочку будет показана дополнительная информация о плагине, включая ссылку на эту документацию.

source: File Storage
pt_br: Armazenamento de arquivo
ru_ru: Хранение файлов

source: By default, Remix IDE stores files in **IndexedDB**.
pt_br: Por padrão, Remix IDE armazena arquivos em **IndexedDB**.
ru_ru: По умолчанию Remix IDE хранит файлы в **IndexedDB**.

source: Coding in Remix IDE Online is different from writing in a Google doc.
pt_br: A codificação no Remix IDE Online é diferente de escrever em um documento do Google.
ru_ru: Кодирование в Remix IDE Online отличается от написания в Google doc.

source: A Google doc saves your work to your account on Google’s servers.
pt_br: Um documento do Google salva seu trabalho em sua conta nos servidores do Google.
ru_ru: Документ Google сохраняет Вашу работу в Вашем аккаунте на серверах Google.

source: Remix has no user accounts. By default, files are ONLY saved locally in the browser’s storage. So tread carefully, browser storage is not permanent!
pt_br: Remix não tem contas de usuário. Por padrão, os arquivos são salvos localmente no armazenamento do navegador. Então tenha cuidado, o armazenamento do navegador não é permanente!
ru_ru: В Remix нет учетных записей пользователей. По умолчанию файлы сохраняются ТОЛЬКО локально в хранилище браузера. Так что будьте осторожны, хранилище браузера не является постоянным!

source: It is very important to have a file backup & file saving strategy.
pt_br: É muito importante ter uma estratégia de backup e salvamento de arquivos.
ru_ru: Очень важно иметь стратегию резервного копирования и сохранения файлов.

source: **Check the following techniques for:**
pt_br: **Verifique as seguintes técnicas para:**
ru_ru: **Проверьте следующие техники на:**.

source: [saving to your hard drive](#file-storage-on-your-hard-drive)
pt_br: [salvar no seu disco rígido](#file-storage-on-your-hard-drive)
ru_ru: [сохранение на жестком диске](#file-storage-on-your-hard-drive)

source: using [remote Git repos](#connecting-remix-to-remote-git-repos)
pt_br: usando [repositórios Git remoto](#connecting-remix-to-remote-git-repos)
ru_ru: использование [удаленных Git-репозиториев](#connecting-remix-to-remote-git-repos)

source: [backing up workspaces](#backup).
pt_br: [backup de espaços de trabalho](#backup).
ru_ru: [резервное копирование рабочих пространств](#backup).

source: **Important Note:** Clearing the browser storage & IndexedDB will **permanently delete** all the files stored there. It is prudent to backup your workspaces before deleting them...just in case.
pt_br: **Nota Importante:** Limpar o armazenamento do navegador e IndexedDB irá **excluir permanentemente** todos os arquivos armazenados lá. É prudente fazer backup de suas áreas de trabalho antes de excluí-las... por precaução.
ru_ru: **Важное замечание:** Очистка хранилища браузера и IndexedDB приведет к **постоянному удалению** всех хранящихся там файлов. Будет разумно создать резервную копию рабочих пространств перед их удалением... на всякий случай.

source: File Storage on your hard drive
pt_br: Armazenamento de arquivos no seu disco rígido
ru_ru: Хранение файлов на жестком диске

source: For storing files on your computer's hard drive when using Remix Online IDE, use **[Remixd](remixd.html)**
pt_br: Para armazenar arquivos no disco rígido do seu computador ao usar Remix Online IDE, use **[Remixd](remixd.html)**
ru_ru: Для хранения файлов на жестком диске Вашего компьютера при использовании Remix Online IDE используйте **[Remixd](remixd.html)**.

source: Remixd is an NPM module that runs on your computer. It allows you to share a specified folder on your computer with Remix IDE.
pt_br: Remixd é um módulo NPM que é executado no seu computador. Ele permite que você compartilhe uma pasta específica no seu computador com Remix IDE.
ru_ru: Remixd - это модуль NPM, который запускается на Вашем компьютере. Он позволяет Вам совместно использовать указанную папку на Вашем компьютере с Remix IDE.

source: Remix Desktop is a version of Remix IDE in an Electron app. Note that when using Remix Desktop, you cannot use a browser wallet like MetaMask, because Remix Desktop does not run in a browser. To connect to public networks, you need to use service like Infura and then use the WalletConnect plugin to approve transactions on your mobile device.
pt_br: Remix Desktop é uma versão do Remix IDE em um aplicativo Electron. Note que ao usar Remix Desktop, você não pode usar uma carteira de navegador como MetaMask, porque Remix Desktop não é executado em um navegador. Para conectar a redes públicas você precisa usar serviços como a Infura e, em seguida, usar o plugin WalletConnect para aprovar transações no seu dispositivo móvel.
ru_ru: Remix Desktop - это версия Remix IDE в приложении Electron. Обратите внимание, что при использовании Remix Desktop Вы не можете использовать браузерный кошелек, такой как MetaMask, поскольку Remix Desktop не работает в браузере. Для подключения к публичным сетям Вам необходимо воспользоваться сервисом типа Infura, а затем использовать плагин WalletConnect для одобрения транзакций на Вашем мобильном устройстве.

source: Connecting Remix to remote Git repos
pt_br: Conectando Remix a repositórios remotos de Git
ru_ru: Подключение Remix к удаленным Git-репозиториям

source: **If you are not using Remixd, it is highly recommended that you save to a remote repo.** (Browsers do crash causing localstorage & indexedDB to be corrupted)
pt_br: **Se você não estiver usando Remix, é altamente recomendado que você salve em um repositório remoto. * (Navegadores falham fazendo com que o armazenamento local e indexedDB sejam corrompidos)
ru_ru: **Если Вы не используете Remixd, настоятельно рекомендуется сохранять в удаленном репозитории** (Браузеры могут сбоить, что приводит к повреждению localstorage и indexedDB).

source: Remix IDE can be connected to remote Git repos hosted in GitHub (or similar service) or in IPFS. Most of the Git operations are done in the **DGit** plugin. (DGit stands for Decentralized GIT).
pt_br: O Remix IDE pode ser conectado a repositórios Git remotos hospedados no GitHub (ou serviço similar) ou no IPFS. A maioria das operações do Git são feitas no plugin **DGit**. (DGit significa GIT descentralizado).

source: [Branch management](#branch-management) is also available at the bottom of the File Explorer when the Workspace is Git initialized.
pt_br: [Gerenciamento de branch](#branch-management) também está disponível na parte inferior do Gerenciador de Arquivos quando o Workspace é Git inicializado.
ru_ru: [Управление ветвями](#branch-management) также доступно в нижней части Проводника файлов, когда рабочая область инициализирована Git.

source: Also see this article about [securing your files in Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)
pt_br: Veja também este artigo sobre [proteger seus arquivos em Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)
ru_ru: Также смотрите эту статью о [защите Ваших файлов в Remix](https://medium.com/remix-ide/securing-you-file-in-remix-how-to-clone-and-push-f1350111aa13?source=friends_link&sk=a3dbd0d3b0b44a29a28e8c10f8821fde)

source: Workspaces
pt_br: Espaços de Trabalho
ru_ru: Рабочие места

source: Workspaces in Remix are special folders that separate projects. Files in one workspace cannot import or access files in different workspace. Choosing a workspace is done with the **Workspaces** select box.
pt_br: Espaços de trabalho no Remix são pastas especiais que separam projetos. Arquivos em uma área de trabalho não podem importar ou acessar arquivos em área de trabalho diferente. Escolher um espaço de trabalho é feito com a caixa de seleção **Espaços de Trabalho**.
ru_ru: Рабочие пространства в Remix - это специальные папки, разделяющие проекты. Файлы в одном рабочем пространстве не могут импортировать или обращаться к файлам в других рабочих пространствах. Выбор рабочего пространства осуществляется с помощью поля **Рабочие пространства**.

source: New Workspace
pt_br: Novo Espaço de Trabalho
ru_ru: Новая рабочая область

source: Workspaces are created by clicking the + button or by going to the hamburger menu in the upper right side of the File Explorer.
pt_br: Espaços de trabalho são criados clicando no botão + ou acessando o menu do hambúrguer no lado superior direito do Gerenciador de Arquivos.
ru_ru: Рабочие пространства создаются щелчком по кнопке + или с помощью гамбургер-меню в правой верхней части Проводника файлов.

source: When making a new workspace, Remix offers the following templates:
pt_br: Ao criar um novo espaço de trabalho, o Remix oferece os seguintes modelos:
ru_ru: При создании нового рабочего пространства Ремикс предлагает следующие шаблоны:

source: Blank
pt_br: Vazio
ru_ru: Заготовка

source: Remix Default
pt_br: Remix Padrão

source: Gnosis MultiSig
pt_br: MultiSig da Gnosis

source: When choosing an OpenZeppelin template, additional functionality can be added. ![](images/a-fe-modal-oz.png)
pt_br: Ao escolher um template OpenZeppelin funcionalidade adicional pode ser adicionada. ![](images/a-fe-modal-oz.png)
ru_ru: При выборе шаблона OpenZeppelin может быть добавлена дополнительная функциональность. ![](images/a-fe-modal-oz.png)

source: Workspace operations
pt_br: Operações do espaço de trabalho
ru_ru: Операции с рабочим пространством

source: The **Workspace hamburger menu** is for operations that work on an entire workspace.
pt_br: O **menu de hambúrguer do espaço de trabalho** é para operações que funcionam em toda uma área de trabalho.
ru_ru: Гамбургер-меню **Рабочее пространство** предназначено для операций, которые работают со всем рабочим пространством.

source: Clone
pt_br: Clonar
ru_ru: Клон

source: When clicking Clone, you’ll be asked for the url of a remote repo. A new workspace will be created that will contain the cloned repo. To manage the Git repo, go to the Dgit plugin.
pt_br: Quando clicar em Clone, você verá a url de um repositório remoto. Será criado um novo espaço de trabalho que irá conter o repositório clonado. Para gerenciar o repositório Git, vá ao plugin Dgit.
ru_ru: Когда Вы нажмете кнопку Clone, Вам будет предложено ввести url удаленного репо. Будет создано новое рабочее пространство, которое будет содержать клонированное репо. Чтобы управлять Git-репо, перейдите к плагину Dgit.

source: Backup is for downloading all the Workspaces in a .zip file. The zip file will have a folder called **.workspaces** that will contain a folder of each Workspace. Depending on your OS, you may need to change the preferences on .workspaces folder to make it visible.
pt_br: O backup é para baixar todos os espaços de trabalho em um arquivo .zip. O arquivo zip terá uma pasta chamada **.workspaces** que conterá uma pasta de cada espaço de trabalho. Dependendo do seu sistema operacional, talvez seja necessário alterar as preferências da pasta .workspaces para torná-lo visível.
ru_ru: Резервное копирование предназначено для загрузки всех Рабочих пространств в .zip-файле. В zip-файле будет папка под названием **.workspaces**, которая будет содержать папку с каждой рабочей областью. В зависимости от Вашей ОС, Вам может потребоваться изменить настройки папки .workspaces, чтобы сделать ее видимой.

source: Restore
pt_br: Restaurar
ru_ru: Восстановить

source: Restore is only for uploading the backup zip file.
pt_br: Restaurar é apenas para o upload do arquivo zip de backup.
ru_ru: Восстановление предназначено только для загрузки zip-файла резервной копии.

source: Create GitHub Actions
pt_br: Criar GitHub Actions
ru_ru: Создание действий на GitHub

source: The Workspace operations to create **Solidity Test Workflow**, **Mocha Chai Test Workflow**, and **Slither Workflow** are for creating GitHub actions. When clicked, a .yml file is created in the .workflows folder of the active Workspace.
pt_br: As operações do espaço de trabalho para criar o **fluxo de trabalho de teste da Solidity**, **Mocha Chai Test Workflow** e **Slither Workflow** são para criar ações do GitHub. Quando clicado, um arquivo .yml é criado na pasta .workflows do espaço de trabalho ativo.
ru_ru: Операции Рабочего пространства для создания **Solidity Test Workflow**, **Mocha Chai Test Workflow** и **Slither Workflow** предназначены для создания действий на GitHub. При нажатии на кнопку создается файл .yml в папке .workflows активного Рабочего пространства.

source: Workspaces initialized with Git
pt_br: Espaços de trabalho inicializados com Git
ru_ru: Рабочие пространства, инициализированные с помощью Git

source: Git initialized workspaces will have the Git icon next to them in the **Workspaces** select box.
pt_br: Espaços de trabalho inicializados do Git tem o ícone ao lado deles na caixa de seleção **Área de Trabalho**.

source: To initialize a new Workspace for GIT, check the box at the bottom of the Create Workspace modal. ![](images/a-fe-create-ws-modal.png)
pt_br: Para inicializar um novo Espaço de Trabalho para o GIT, marque a caixa no final da janela Criar Área de Trabalho. ![](images/a-fe-create-ws-modal.png)
ru_ru: Чтобы инициализировать новое рабочее пространство для GIT, установите флажок в нижней части модального окна Create Workspace. ![](images/a-fe-create-ws-modal.png)

source: Working with Files
pt_br: Trabalhar com arquivos
ru_ru: Работа с файлами

source: When a file is clicked on it will appear in the Editor.
pt_br: Quando um arquivo for clicado, ele aparecerá no Editor.
ru_ru: Когда на файле щелкнут мышью, он появится в Редакторе.

source: Under the **Workspaces** select box are a number of icons that perform operations on files. More operations can be accessed by right-clicking on a file or folder ([see below](#right-click-on-a-file-or-folder)).
pt_br: Sob a caixa de seleção **Espaços de Trabalho** estão vários ícones que executam operações em arquivos. Mais operações podem ser acessadas clicando com o botão direito em um arquivo ou pasta ([ver abaixo](#right-click-on-a-file-or-folder)).
ru_ru: Под окном выбора **Рабочие пространства** находится ряд пиктограмм, выполняющих операции над файлами. Дополнительные операции можно получить, щелкнув правой кнопкой мыши на файле или папке ([см. ниже](#right-click-on-a-file-or-folder)).

source: **A.** Create a file <br>
pt_br: **A.** Crie um arquivo <br>
ru_ru: **A.** Создайте файл <br>.

source: **B.** Create a folder <br>
pt_br: **B.** Crie uma pasta <br>
ru_ru: **B.** Создайте папку <br>.

source: **C.** Publish all the file in this Workspace to a GIST<br>
pt_br: **C.** Publique todo o arquivo neste espaço de trabalho em um GIST<br>
ru_ru: **C.** Опубликуйте все файлы в этой рабочей области в GIST<br>.

source: **D.** Upload a file into the current Workspace<br>
pt_br: **D.** Envie um arquivo para o espaço de trabalho atual<br>
ru_ru: **D.** Загрузите файл в текущую рабочую область<br>.

source: **E.** Upload a folder into the current Workspace<br>
pt_br: **E.** Envie uma pasta para o Espaço de trabalho atual<br>
ru_ru: **E.** Загрузите папку в текущую рабочую область<br>.

source: Creating new files
pt_br: Criando um novo arquivo
ru_ru: Создание новых файлов

source: There are 2 ways of creating files:
pt_br: Há duas maneiras de criar arquivos:
ru_ru: Существует 2 способа создания файлов:

source: The first is to click on the new file icon (**H.** in fig.1), then an input for the new file’s name will appear in the **File Explorer**. Once a name is entered, a new empty file will open in the Editor. If the file's name is entered **without** a file extension, the extension **.sol** will be appended by default.
pt_br: A primeira é clicar no novo ícone de arquivo (**H.** na fig.), em seguida, uma entrada para o nome do novo arquivo irá aparecer no **Explorador de Arquivos**. Uma vez inserido um nome, um novo arquivo vazio será aberto no Editor. Se o nome do arquivo for inserido **sem** uma extensão de arquivo, a extensão **.sol** será anexada por padrão.
ru_ru: Первое - это щелкнуть на пиктограмме нового файла (**Н.** на рис.1), после чего в **File Explorer** появится окно для ввода имени нового файла. Как только имя будет введено, в Редакторе откроется новый пустой файл. Если имя файла введено **без** расширения файла, то по умолчанию будет добавлено расширение **.sol**.

source: ![](images/a-file-explorer-new-file2.png)
pt_br: ![](images/a-file-explorer-new-file2a.png)

source: The second way of creating a file is to right-click on a file or folder to get a popup menu.
pt_br: A segunda maneira de criar um arquivo é clicar com o botão direito do mouse em um arquivo ou pasta para obter um menu pop-up.
ru_ru: Второй способ создания файла - щелкнуть правой кнопкой мыши на файле или папке, чтобы получить всплывающее меню.

source: The new file will be placed in **the currently selected folder** of the Workspace. If a file and not a folder is selected, then the new file will be placed in that file’s folder. And if nothing is selected, then the file will be placed in the root of the current workspace's folder. Or to be brief — just be mindful of what folder it lands in.
pt_br: O novo arquivo será colocado na **pasta atualmente selecionada** do espaço de trabalho. Se um arquivo e não uma pasta for selecionado, então o novo arquivo será colocado na pasta do arquivo. E se nada for selecionado, então o arquivo será colocado na raiz da pasta do espaço de trabalho atual. Ou para ser breve — fique atento a qual pasta inclui.
ru_ru: Новый файл будет помещен в **выбранную в данный момент папку** рабочей области. Если выбран файл, а не папка, то новый файл будет помещен в папку этого файла. А если ничего не выбрано, то файл будет помещен в корень папки текущей рабочей области. Или, если быть кратким - просто следите за тем, в какую папку он попадает.

source: Publish to Gist
pt_br: Publicar no Gist
ru_ru: Опубликовать в Gist

source: The icon (marked **J.** in fig.1) publishes all files from the current Workspace to a gist. **The Gist API requires users to be authenticated** to be able to publish a gist.
pt_br: O ícone (marcado **J** no fig.1) publica todos os arquivos do espaço de trabalho atual para um GIST. **A API do Gist requer que os usuários sejam autenticados** para poderem publicar um gist.
ru_ru: Пиктограмма (обозначенная **J.** на рис. 1) публикует все файлы из текущей рабочей области в gist. **Интерфейс Gist API требует аутентификации пользователей**, чтобы иметь возможность опубликовать gist.

source: Click [this link](https://github.com/settings/tokens) to Github tokens setup and select Generate new token. Then check the **Create gists** checkbox and generate a new token. Also make sure you check the box to enable the creation of Gists with this token.
pt_br: Clique [este link](https://github.com/settings/tokens) para configurar tokens no Github e selecione Gerar novo token. Então marque a caixa de seleção **Criar gists** e gere um novo token. Também tenha certeza de que você seleciona a caixa para habilitar a criação de Gists com este token.
ru_ru: Перейдите по [этой ссылке](https://github.com/settings/tokens) в раздел Github tokens setup и выберите Generate new token. Затем установите флажок **Create gists** и сгенерируйте новый токен. Также убедитесь, что Вы установили флажок, разрешающий создание Gists с помощью этого токена.

source: Take the token and paste it in Remix's **Settings** module in the **Github Access Token** section. And then click Save.
pt_br: Pegue o token e cole-o no módulo **Configurações** do Remix, na seção **Token de Acesso do Github**. Depois clique em Salvar.
ru_ru: Возьмите токен и вставьте его в модуль **Настройки** Ремикса в раздел **Github Access Token**. Затем нажмите кнопку Сохранить.

source: You can also publish by right-clicking on the file or folder.
pt_br: Você também pode publicar clicando com o botão direito no arquivo ou pasta.
ru_ru: Вы также можете опубликовать, щелкнув правой кнопкой мыши на файле или папке.

source: Right-Click popup menu
pt_br: Menu Popup - Clique direito
ru_ru: Всплывающее меню по правой кнопке мыши

source: Right-Click on a folder
pt_br: Clique-Direito em uma pasta
ru_ru: Щелкните правой кнопкой мыши на папке

source: Right-clicking on a folder will bring a popup menu for operations you can do on that folder.
pt_br: Clicar com o botão direito em uma pasta irá trazer o menu pop-up para operações que você pode fazer nessa pasta.
ru_ru: Щелчок правой кнопкой мыши на папке вызовет всплывающее меню для операций, которые Вы можете выполнить с этой папкой.

source: The right-click popup menu also works with Remixd (which gives you access to a folder on your hard drive).
pt_br: O menu do botão direito do mouse também funciona com Remixd (que lhe dá acesso a uma pasta no seu disco rígido).
ru_ru: Всплывающее меню, вызываемое щелчком правой кнопки мыши, также работает с Remixd (который предоставляет Вам доступ к папке на жестком диске).

source: **Note:** When working with RemixD, and when adding files to the shared folder from your computer (and not from Remix), you'll need to open and close the containing folder or switch in and out of **localhost** workspace to refresh the view.
pt_br: **Nota:** Ao trabalhar com RemixD, e ao adicionar arquivos à pasta compartilhada de seu computador (e não do Remix), você precisará abrir e fechar a pasta contendo ou alternar para dentro e para fora da área de trabalho **localhost** para atualizar a exibição.
ru_ru: **Примечание:** При работе с RemixD и при добавлении файлов в общую папку с Вашего компьютера (а не из Remix), Вам придется открывать и закрывать содержащую папку или входить и выходить из рабочего пространства **localhost**, чтобы обновить представление.

source: Right-Click on a Solidity file
pt_br: Clique-Direito em um arquivo de Solidity
ru_ru: Щелкните правой кнопкой мыши на файле Solidity
