Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/file_explorer.po
Languages: pt_br, ru_ru

source: Right-clicking on a file with a .sol extension will bring up a popup menu - which includes options for compiling & flattening, creating UML diagrams, and generating documentation.
pt_br: Clicar com o botão direito em um arquivo com a extensão .sol o plug-in abrirá um menu pop-up, que inclui opções para compilação e nivelamento, criação de diagramas UML e geração de documentação.
ru_ru: Щелчок правой кнопкой мыши на файле с расширением .sol вызовет всплывающее меню, включающее опции компиляции и сглаживания, создания UML-диаграмм и генерации документации.

source: Right-Click on a Script
pt_br: Clique direito em um script
ru_ru: Щелкните правой кнопкой мыши на сценарии

source: Right-click on any file with a .js or .ts extension to get the **Run** option in the popup menu to run the script.
pt_br: Clique com o botão direito do mouse em qualquer arquivo com uma extensão .js ou .ts para fazer a opção **Executar** no menu popup executar o script.
ru_ru: Щелкните правой кнопкой мыши на любом файле с расширением .js или .ts, чтобы получить во всплывающем меню опцию **Run** для запуска сценария.

source: If the script you want to run is the active file in the Editor, you can also run it by using play button at the top left of the Editor or by inputting the command `remix.exeCurrent()` in the console.
pt_br: Se o script que deseja executar for o arquivo ativo no Editor, você também pode executá-lo usando o botão play no canto superior esquerdo do editor ou inserindo o comando `remix.exeCurrent()` no console.
ru_ru: Если сценарий, который Вы хотите запустить, является активным файлом в Редакторе, Вы также можете запустить его с помощью кнопки play в левом верхнем углу Редактора или введя команду `remix.exeCurrent()` в консоли.

source: Git in the File Explorer
pt_br: Git no Gerenciador de Arquivos
ru_ru: Git в Проводнике файлов

source: In Remix, a workspace can be initialized with Git. The Git commands then operate on the workspace.
pt_br: No Remix, um espaço de trabalho pode ser inicializado através do Git. Os comandos Git então operam no espaço de trabalho.
ru_ru: В Remix рабочее пространство может быть инициализировано с помощью Git. Затем команды Git работают с рабочим пространством.

source: Initialize
pt_br: Inicializar
ru_ru: Инициализация

source: For information about initializing a workspace, see this [section](#workspaces-initialized-with-git).
pt_br: Para obter informações sobre a inicialização de um espaço de trabalho, consulte [esta seção](#workspaces-initialized-with-git).
ru_ru: Информацию об инициализации рабочего пространства см. на этом сайте [section](#workspaces-initialized-with-git).

source: The clone command is located in the **Workspace hamburger menu**. For more information, see the section about [workspace operations](#workspace-operations)
pt_br: O comando de clone está localizado no **menu hambúrguer do espaço de trabalho**. Para obter mais informações, consulte a seção sobre [operações do espaço de trabalho](#workspace-operations)
ru_ru: Команда clone находится в гамбургер-меню **Workspace**. Более подробную информацию Вы найдете в разделе об операциях с [рабочим пространством](#workspace-operations).

source: Branch Management
pt_br: Gerenciamento de branch
ru_ru: Управление филиалом

source: When you are in a workspace that is initialized with Git, at the bottom of the File Explorer, you’ll see the place for managing branches.
pt_br: Quando você estiver em um espaço de trabalho que é inicializada com Git, na parte inferior do Explorador de Arquivos, você verá o lugar para gerenciar os branches.
ru_ru: Когда Вы находитесь в рабочей области, инициализированной с помощью Git, в нижней части Проводника файлов Вы увидите место для управления ветвями.

source: Then when you click on the branch name, this section will expand with an interface for switching branches and for creating a new branch.
pt_br: Em seguida, quando você clicar no nome do branch, esta seção irá expandir com uma interface para alternar branches e para criar um novo branch.
ru_ru: Затем, когда Вы щелкните на названии ветви, эта секция расширится с интерфейсом для переключения ветвей и для создания новой ветви.

source: For the rest of the Git commands, go to the DGit plugin.
pt_br: Para o resto dos comandos do Git, vá para o plugin DGit.
ru_ru: Для получения информации об остальных командах Git обратитесь к плагину DGit.

source: For more info about the DGit plugin, see ![this article](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).
pt_br: Para obter mais informações sobre o plugin DGit, consulte [este artigo](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).
ru_ru: Более подробную информацию о плагине DGit смотрите в ![этой статье](https://medium.com/remix-ide/github-in-remix-ide-356de378f7da).

source: this article
pt_br: este artigo
ru_ru: эта статья

source: Remix IDE can be connected to remote Git repos hosted in GitHub (or similar service) or in IPFS. Most of the Git operations are done in the **DGit** pluin. (DGit stands for Decentralized GIT).
ru_ru: Remix IDE может быть подключена к удаленным Git-репозиториям, размещенным на GitHub (или аналогичном сервисе) или в IPFS. Большинство операций с Git выполняются в **DGit** pluin. (DGit расшифровывается как Decentralized GIT).

source: Backup
ru_ru: Резервное копирование

source: Git intialized workspaces will have the Git icon next to them in the **Workspaces** select box.
ru_ru: Рабочие пространства, инициализированные Git, будут иметь значок Git рядом с ними в поле выбора **Рабочие пространства**.
