Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/foundry.po
Languages: pt_br, ru_ru

source: _(Supported since Remix IDE v0.25.0)_
pt_br: _(Suportado desde Remix IDE v0.25.0)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.25.0)_.

source: Foundry Provider
pt_br: Provedor Foundry
ru_ru: Провайдер литейного производства

source: **Foundry Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Foundry's built-in **Anvil** blockchain. `Foundry Provider` can be chosen from the list of environments in `Deploy & Run Transactions` plugin.
pt_br: **Provedor Foundry** é um plugin no Remix IDE, que permite aos usuários implantarem o contrato na blockchain **Anvil** integrada ao Foundry. O 'Provedor Foundry' pode ser escolhido a partir da lista de ambientes no plugin 'Implantar e Executar Transações'.
ru_ru: **Foundry Provider** - это плагин для Remix IDE, который позволяет пользователям развернуть контракт на встроенном в Foundry блокчейне **Anvil**. `Foundry Provider` может быть выбран из списка сред в плагине `Deploy & Run Transactions`.

source: As soon as you select `Foundry Provider`, a modal is opened asking for the `Anvil JSON-RPC Endpoint`.
pt_br: Assim que você selecionar `Provedor Foundry`, uma janela é aberta pedindo o `Anvil JSON-RPC Endpoint`.
ru_ru: Как только Вы выберете `Foundry Provider`, откроется модальное окно, запрашивающее `Anvil JSON-RPC Endpoint`.

source: If Foundry Anvil node is running with default options, the default endpoint value in modal will not need any change. In case, Anvil node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
pt_br: Se o nó da Foundry Anvil estiver executando com as opções padrão, o valor padrão de endpoint na janela não precisará ser alterado. No caso do host do nó Anvil e a porta serem diferentes, o endpoint JSON-RPC deve ser atualizado na caixa de texto dentro da janela.
ru_ru: Если узел Foundry Anvil работает с опциями по умолчанию, значение конечной точки по умолчанию в модальном окне менять не нужно. В случае, если хост и порт узла Anvil отличаются, конечную точку JSON-RPC следует обновить в текстовом поле модального окна.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Anvil node will be loaded in the `ACCOUNT` section. Network id will also be shown.
pt_br: Uma vez que o endpoint correto é preenchido na janela, apenas clique em `OK` e as contas do nó Anvil serão carregadas na seção `CONTA`. A identificação da rede também será mostrada.
ru_ru: После того, как в модальном окне будет заполнена правильная конечная точка, просто нажмите `OK`, и учетные записи из узла Anvil будут загружены в раздел `ACCOUNT`. Также будет показан идентификатор сети.

source: Now, one can start deploying the contract from Remix IDE to the local Anvil node as usual.
pt_br: Agora, pode-se começar a implantar o contrato de Remix IDE para o nó local do Anvil.
ru_ru: Теперь можно приступить к развертыванию контракта из Remix IDE на локальном узле Anvil, как обычно.

source: Foundry Remappings
pt_br: Remapeamentos Foundry
ru_ru: Ремаппинг литейного производства

source: Foundry manages dependencies using git submodules and can remap dependencies to make them easier to import. So import defined by remappings can have compilation errors on Remix IDE.
pt_br: O Foundry gerencia dependências usando submódulos do git e pode remapear dependências para torná-los mais fáceis de importar. Por isso, a importação definida pelos remapeamentos pode ter erros de compilação no Remix IDE.
ru_ru: Foundry управляет зависимостями с помощью git-подмодулей и может перемапировать зависимости, чтобы облегчить их импорт. Поэтому импорт, определенный с помощью ремаппинга, может приводить к ошибкам компиляции в Remix IDE.

source: To support such compilation, Remix suggests running [compilation using a compiler config file](https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Remix adds some default Forge remappings in the compiler config file when a Foundry project is loaded in Remix IDE using remixd.
pt_br: Para suportar tal compilação, Remix sugere executar [compilação usando um arquivo de configuração](https://remix-ide.readthedocs.io/en/latest/compile. tml#json-file-for-compiler-configuration). Remix adiciona algumas remapeamentos padrão do Forge no arquivo de configuração do compilador quando um projeto Foundry é carregado no IDE Remix usando remixd.
ru_ru: Для поддержки такой компиляции Ремикс предлагает выполнить команду [compilation using a compiler config file](https://remix-ide.readthedocs.io/en/latest/compile.html#json-file-for-compiler-configuration). Remix добавляет некоторые стандартные ремаппинги Forge в файл конфигурации компилятора, когда проект Foundry загружается в Remix IDE с помощью remixd.

source: Further, more remappings can be added manually, if required.
pt_br: Além disso, podem ser adicionados mais remapeamentos, se necessário.
ru_ru: Далее, при необходимости, можно вручную добавить большее количество ремаппингов.
