Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/hardhat.po
Languages: pt_br, ru_ru

source: _(Supported since Remix IDE v0.12.0 and Remixd v0.3.6)_
pt_br: _(Suportado desde Remix IDE v0.12.0 e Remixd v0.3.6)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.12.0 и Remixd v0.3.6)_.

source: Remixd and Hardhat
pt_br: Remix e Hardhat
ru_ru: Remixd и Hardhat

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
pt_br: **Nota:** Se você não usou `remixd` antes, leia mais sobre ele [aqui](./remixd.html)
ru_ru: **Примечание:** Если Вы раньше не использовали `remixd`, почитайте о нем подробнее [here](./remixd.html).

source: If `remixd` is running locally on your device and shared folder is a **Hardhat project**, an additional websocket plugin will be listening on port `65522`. According to its documentation,
pt_br: Se o arquivo `remixd` estiver sendo executado localmente no seu dispositivo e a pasta compartilhada for um **Hardhat project**, um plugin de websocket adicional estará escutando na porta `65522`. De acordo com sua documentação,
ru_ru: Если `remixd` запущен локально на Вашем устройстве и общая папка является проектом **Hardhat**, то дополнительный плагин websocket будет прослушивать порт `65522`. Согласно его документации,

source: _Hardhat projects are npm projects with the hardhat package installed and a hardhat.config.js or hardhat.config.ts file._
pt_br: _Projetos de Hardhat são projetos npm com o pacote de hardhat instalado e um arquivo hardhat.config.js ou hardhat.config.ts._
ru_ru: _Проекты hardhat - это проекты npm с установленным пакетом hardhat и файлом hardhat.config.js или hardhat.config.ts._.

source: Remixd looks for the `hardhat.config.js` or `hardhat.config.ts` file in shared folder, and if it finds the file, the Hardhat websocket listener will run.
pt_br: Remixd procura o arquivo `hardhat.config.js` ou `hardhat.config.ts` em uma pasta compartilhada, e se encontrar o arquivo, o ouvinte do Hardhat websocket será executado.
ru_ru: Remixd ищет файл `hardhat.config.js` или `hardhat.config.ts` в общей папке, и если находит его, то запускается прослушиватель веб-сокетов Hardhat.

source: The Hardhat websocket listener is a websocket plugin similar to `remixd` and is used to perform Hardhat specific actions with Remix IDE.
pt_br: O ouvinte de websocket Hardhat é um plugin de websocket semelhante a `remixd` e é usado para executar ações específicas de Hardhat com a Remix IDE.
ru_ru: Слушатель веб-сокетов Hardhat представляет собой плагин веб-сокетов, аналогичный `remixd`, и используется для выполнения специфических для Hardhat действий с Remix IDE.

source: It doesn't need any separate installation as it is shipped with [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module.
pt_br: Não precisa de nenhuma instalação separada, pois é enviada com o módulo [remixd NPM](https://www.npmjs.com/package/@remix-project/remix).
ru_ru: Он не требует отдельной установки, поскольку поставляется с модулем [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).

source: Enable Hardhat Compilation
pt_br: Habilitar Compilação Hardhat
ru_ru: Включить компиляцию Hardhat

source: Prerequisites
pt_br: Pré-Requisitos
ru_ru: Пререквизиты

source: To use Hardhat compilation with Remix IDE efficiently:
pt_br: Para usar a compilação Hardhat com Remix IDE eficientemente:
ru_ru: Для эффективного использования компиляции Hardhat с Remix IDE:

source: **Hardhat** should be installed locally on the system [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)
pt_br: **Hardhat** deve ser instalado localmente no sistema [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)
ru_ru: **Hardhat** должен быть установлен локально в системе [https://hardhat.org/getting-started/#installation](https://hardhat.org/getting-started/#installation)

source: Shared folder should be a Hardhat project containing `hardhat.config.js` or `hardhat.config.ts`
pt_br: A pasta compartilhada deve ser um projeto Hardhat contendo 'hardhat.config.js' ou 'hardhat.config.ts'
ru_ru: В общей папке должен находиться проект Hardhat, содержащий `hardhat.config.js` или `hardhat.config.ts`.

source: `Remixd` Hardhat websocket listener should be running at `65522`
pt_br: `Remixd` Ouvinte de websocket Hardhat deve estar rodando em `65522`
ru_ru: `Remixd` Hardhat websocket listener должен быть запущен по адресу `65522`.

source: How to use
pt_br: Como usar
ru_ru: Как использовать

source: If a hardhat project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Compiler` plugin with the label `Enable Hardhat Compilation`.
pt_br: Se um projeto hardhat é compartilhado através de remixd e o espaço de trabalho `localhost` é carregado no Remix IDE, haverá uma caixa de seleção extra mostrada no plugin `Solidity Compiler` com o rótulo `Ativar Compilação Hardhat `.
ru_ru: Если проект hardhat совместно используется через remixd и рабочее пространство `localhost` загружено в Remix IDE, то в плагине `Solidity Compiler` появится дополнительный флажок с надписью `Enable Hardhat Compilation`.

source: There is an info icon alongside the label which redirects to a specific section of Remix official documentation that explains how to use Hardhat compilation.
pt_br: Há um ícone informativo junto ao rótulo que redireciona para uma seção específica do Remix oficial que explica como usar a compilação Hardhat.

source: One can check the `Enable Hardhat Compilation` box to run the compilation for Hardhat along with the Remix using the compiler configuration in `Solidity Compiler` plugin.
pt_br: Uma pessoa pode marcar a caixa `Habilitar Compilação Hardhat ` para executar a compilação de Hardhat juntamente com o Remix usando a configuração do compilador no plugin `Compilador Solidity`.
ru_ru: Можно установить флажок `Enable Hardhat Compilation`, чтобы запустить компиляцию для Hardhat вместе с Remix, используя конфигурацию компилятора в плагине `Solidity Compiler`.

source: On clicking `Compile` button, a file with `remix-compiler.config.js` will be created on the project root which will be storing compiler configuration set in Remix's `Solidity Compiler` plugin. It is passed to Hardhat for compilation.
pt_br: Ao clicar no botão `Compilar`, um arquivo `remix-compiler.config.js` será criado na raiz do projeto que estará armazenando a configuração do compilador definido no plugin `Compilador Solidity` do Remix. É transmitido ao Hardhat para compilação.
ru_ru: После нажатия кнопки `Compile` в корне проекта будет создан файл `remix-compiler.config.js`, в котором будет храниться конфигурация компилятора, установленная в плагине Remix `Solidity Compiler`. Он передается в Hardhat для компиляции.

source: The result of the compilation will be shown in the Remix IDE terminal
pt_br: O resultado da compilação será mostrado no terminal de Remix IDE
ru_ru: Результат компиляции будет показан в терминале Remix IDE

source: and also in the **remixd** terminal.
pt_br: e também no terminal **remixd**.
ru_ru: а также в терминале **remixd**.

source: Hardhat Provider
pt_br: Provedor Hardhat
ru_ru: Поставщик касок

source: _In Hardhat, contracts are deployed by starting a local node. Read more about it in [Hardhat documentation](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_
pt_br: _Em Hardhat, contratos são implantados iniciando um nó local. Leia mais sobre isso em [Documentação Hardhat](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_
ru_ru: _В Hardhat контракты развертываются путем запуска локального узла. Подробнее об этом читайте в [Hardhat documentation](https://hardhat.org/getting-started/#connecting-a-wallet-or-dapp-to-hardhat-network)_.

source: **Hardhat Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Hardhat 'localhost' network. This can be chosen from the `ENVIRONMENT` dropdown of `Deploy and Run Transactions` plugin.
pt_br: **Provedor de hardhat** é um plugin no Remix IDE que permite que os usuários implantem o contrato para a rede 'localhost'. Isso pode ser escolhido no menu suspenso `ENVIRONMENT` do plugin `Implantar e Executar Transações`.
ru_ru: **Hardhat Provider** - это плагин для Remix IDE, который позволяет пользователям развернуть контракт в сети Hardhat 'localhost'. Это можно выбрать из выпадающего списка `ENVIRONMENT` плагина `Deploy and Run Transactions`.

source: As soon as you select `Hardhat Provider`, a modal is opened asking for the `Hardhat JSON-RPC Endpoint`.
pt_br: Assim que você selecionar `Provedor de Hardhat`, uma janela é aberta pedindo o `Hardhat JSON-RPC Endpoint`.
ru_ru: Как только Вы выберете `Hardhat Provider`, откроется модальное окно, запрашивающее `Hardhat JSON-RPC Endpoint`.

source: If Hardhat node is running with default options, then the default endpoint value in modal will not need any change. In case, Hardhat node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
pt_br: Se o nó de Hardhat estiver rodando com as opções padrão, então o valor padrão do endpoint na janela não precisará ser alterado. No caso de o host e a porta do nó de Hardhat serem diferentes, o endpoint JSON-RPC deve ser atualizado na caixa de texto da janela.
ru_ru: Если узел Hardhat работает с опциями по умолчанию, то значение конечной точки по умолчанию в модальном окне менять не нужно. В случае, если хост и порт узла Hardhat отличаются, конечная точка JSON-RPC должна быть обновлена в текстовом поле модального окна.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Hardhat node will be loaded in the `ACCOUNT` section. Network id will also be shown.
pt_br: Uma vez que o enpoint correto é preenchido na janela, apenas clique em `OK` e as contas do nó Hardhat serão carregadas na seção `CONTA`. A identificação da rede também será mostrada.
ru_ru: Как только в модальном окне будет заполнена правильная конечная точка, просто нажмите `OK`, и учетные записи из узла Hardhat будут загружены в раздел `ACCOUNT`. Также будет показан идентификатор сети.

source: Now, one can start deploying the contract from Remix IDE to the Hardhat local node as usual.
pt_br: Agora, pode-se começar a implantar o contrato de Remix IDE para o nó local Hardhat como de costume.
ru_ru: Теперь можно приступить к развертыванию контракта из Remix IDE на локальном узле Hardhat, как обычно.

source: `console.log` in Remix IDE
pt_br: `console.log` no IDE do Remix
ru_ru: `console.log` в Remix IDE

source: _(Supported since Remix IDE v0.17.0)_
pt_br: _(Suportado desde Remix IDE v0.17.0)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.17.0)_.

source: Remix IDE supports hardhat console library while using `Remix VM`. It can be used while making a transaction or running unit tests.
pt_br: Remix IDE suporta biblioteca de console hardhat enquanto usa `Remix VM`. Ele pode ser usado enquanto faz uma transação ou execução de testes de unidade.
ru_ru: Remix IDE поддерживает консольную библиотеку hardhat при использовании `Remix VM`. Ее можно использовать при выполнении транзакции или при выполнении модульных тестов.

source: Deploy and Run Transactions
pt_br: Implantar e executar transações
ru_ru: Развертывание и выполнение транзакций

source: To try it out, you need to put an import statement and use `console.log` to print the value as shown in image.
pt_br: Para experimentar, você precisa colocar uma declaração de importação e usar `console.log` para imprimir o valor como mostrado na imagem.
ru_ru: Чтобы опробовать его, Вам необходимо поместить оператор импорта и использовать `console.log` для печати значения, как показано на рисунке.

source: Further, once you execute the `changeOwner` method, the value from console statement will be shown in Remix terminal after transaction details as below:
pt_br: Além disso, assim que você executar o método `changeOwner`, o valor do console será mostrado no terminal Remix após os detalhes da transação abaixo:
ru_ru: Далее, когда Вы выполните метод `changeOwner`, значение из консольного оператора будет показано в терминале Remix после деталей транзакции, как показано ниже:

source: Solidity Unit Testing
pt_br: Teste Unidade de Solidity
ru_ru: Модульное тестирование Solidity

source: Similarly, `console.log` can be used while running unit tests using Remix Solidity Unit Testing plugin. See image below.
pt_br: Da mesma forma, `console.log` pode ser usado durante a execução de testes unitários usando o plugin de Testes de Remix Solidity Units. Veja a imagem abaixo.
ru_ru: Аналогично, `console.log` можно использовать при выполнении модульных тестов с помощью плагина Remix Solidity Unit Testing. См. рисунок ниже.

source: For the tests including logging message, it will display in the Remix Terminal corresponding to test name.
pt_br: Para testes incluindo mensagem de registro, ela será exibida no Terminal Remix correspondente ao nome do teste.
ru_ru: Для тестов, включающих сообщение о регистрации, оно будет отображаться в Ремикс Терминале, соответствующем названию теста.

source: There is an info icon along side the label which redirects to a specific section of Remix official documentation that explains how to use Hardhat compilation.
ru_ru: Рядом с ярлыком имеется информационная иконка, которая перенаправляет на определенный раздел официальной документации Remix, объясняющий, как использовать компиляцию Hardhat.
