Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/import.po
Languages: pt_br, ru_ru

source: Importing & Loading Source Files in Solidity
pt_br: Importando e carregando arquivos fonte em Solidity
ru_ru: Импорт и загрузка исходных файлов в Solidity

source: There are two main reasons for loading external files into Remix:
pt_br: Existem duas razões principais para a carga de arquivos externos para o Remix:
ru_ru: Существует две основные причины для загрузки внешних файлов в Ремикс:

source: **to import a library or dependency** (for files you will NOT be editing)
pt_br: **para importar uma biblioteca ou dependência** (para arquivos que você NÃO irá editar)
ru_ru: **для импорта библиотеки или зависимости** (для файлов, которые Вы НЕ будете редактировать)

source: **to load some files for manipulation, editing and play** (for files you might want to edit)
pt_br: **para carregar alguns arquivos para manipulação, edição e reprodução** (para arquivos que você pode querer editar)
ru_ru: **для загрузки некоторых файлов для манипулирования, редактирования и воспроизведения** (для файлов, которые Вы, возможно, захотите отредактировать)

source: Importing a library or dependency
pt_br: Importando uma biblioteca ou dependência
ru_ru: Импорт библиотеки или зависимости

source: When importing from NPM, or a URL (like github, an IPFS gateway, or a Swarm gateway) you do not need to do anything more than use the `import` statement in your contract. The dependencies do not need to be "preloaded" into the File Explorer's current Workspace before the contract is compiled.
pt_br: Ao importar de NPM, ou uma URL (como github, um gateway IPFS, ou um gateway Swarm) você não precisa mais do que usar a instrução `importar` no seu contrato. As dependências não precisam ser "pré-carregadas" no espaço de trabalho atual do Gerenciador de Arquivos antes do contrato ser compilado.

source: Files loaded from the import statement are placed in the **Files Explorer's** current Workspace's `.deps` folder.
pt_br: Arquivos carregados a partir da declaração de importação são colocados na pasta `.deps` do **Explorador de Arquivos** do Espaço de Trabalho atual.
ru_ru: Файлы, загруженные из оператора импорта, помещаются в папку `.deps` **Files Explorer'а** текущей Рабочей области.

source: Under the hood, Remix checks to see if the files are already loaded in the **.deps** directory. If not, it gets them via unpkg if it is an NPM lib.
pt_br: Sob o capô, Remix verifica se há arquivos já estão carregados na pasta **.deps**. Se não, os recebe via unpkg se for uma biblioteca NPM.
ru_ru: Под капотом Remix проверяет, не загружены ли уже файлы в каталог **.deps**. Если нет, то он получает их через unpkg, если это NPM lib.

source: Here are some example import statements:
pt_br: Aqui estão alguns exemplos de instruções de importação:
ru_ru: Приведем несколько примеров операторов импорта:

source: Import from NPM
pt_br: Importar de NPM
ru_ru: Импорт из NPM

source: **Note:** In the example above, **@openzeppelin** is the name of the npm library. In the following example the library's name does not begin with an @ - but Remix will go and check npm for a library of that name.
pt_br: **Nota:** No exemplo acima, **@openzeppelin** é o nome da biblioteca npm. No exemplo a seguir, o nome da biblioteca não começa com @ - mas Remix vai ir e checar o npm para uma biblioteca com esse nome.
ru_ru: **Примечание:** В приведенном выше примере **@openzeppelin** - это имя библиотеки npm. В следующем примере имя библиотеки не начинается с символа @ - но Remix пойдет и проверит npm на наличие библиотеки с таким именем.

source: Import from a Github URL
pt_br: Importar de uma URL do Github
ru_ru: Импорт из URL-адреса Github

source: You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example above imports from OpenZeppelin Contracts v2.5.0.
pt_br: Você deve especificar a tag de versão (quando disponível), caso contrário você receberá o código mais recente no ramo principal. Para Contratos OpenZeppelin você deve usar somente código publicado em um lançamento oficial, o exemplo acima das importações de Contratos OpenZeppelin v2.5.0.
ru_ru: Вы должны указать метку релиза (если таковая имеется), иначе Вы получите последнюю версию кода в мастер-ветке. Для OpenZeppelin Contracts Вы должны использовать только код, опубликованный в официальном релизе. В приведенном выше примере импортируется код из OpenZeppelin Contracts v2.5.0.

source: Import from Swarm
pt_br: Importando do Swarm
ru_ru: Импорт из Swarm

source: Import from IPFS
pt_br: Importando do IPFS
ru_ru: Импорт из IPFS

source: Importing a local file not in .deps
pt_br: Importando um arquivo local não está em .deps
ru_ru: Импортирование локального файла, не входящего в .deps

source: To import a file NOT in the **.deps** folder, use a relative path (**./**). For example:
pt_br: Para importar um arquivo NÃO está na pasta **.deps**, use um caminho relativo (**./**). Por exemplo:
ru_ru: Чтобы импортировать файл, находящийся НЕ в папке **.deps**, используйте относительный путь (**./**). Например:

source: **Note:** It is not possible to import across Workspaces.
pt_br: **Nota:** Não é possível importar através de espaços de trabalho.
ru_ru: **Примечание:** Импорт между рабочими пространствами невозможен.

source: Importing a file from your computer's filesystem
pt_br: Importando um arquivo do sistema de arquivos do seu computador
ru_ru: Импорт файла из файловой системы Вашего компьютера

source: This method uses **remixd** - the remix daemon. Please go to the [remixd docs](remixd.html) for instructions about how to bridge the divide between the browser and your computer's filesystem.
pt_br: Esse método usa **remixd** - o remix daemon. Por favor, vá para [remixd docs](remixd. tml) para instruções sobre como fazer a ponte entre o navegador e o sistema de arquivos do seu computador.

source: More about the import keyword
pt_br: Saiba mais sobre a palavra-chave de importação
ru_ru: Подробнее о ключевом слове import

source: For a detailed explanation of the `import` keyword see the [Solidity documentation](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files)
pt_br: Para uma explicação detalhada da palavra-chave `import` veja a [documentação de Solidity](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files)
ru_ru: Подробное объяснение ключевого слова `import` см. в [документации Solidity](https://docs.soliditylang.org/en/latest/layout-of-source-files.html?highlight=import#importing-other-source-files).

source: Importing files for manipulation
pt_br: Importando arquivos para manipulação

source: When importing from the home tab widgets or with a remix command in the console, the files are placed in the **root of the current Workspace** inside a folder that shows their source - eg github or gists.
pt_br: Quando importar de widgets da aba inicial ou com um comando de remix no console, os arquivos são colocados na **raiz da área de trabalho atual** dentro de uma pasta que mostra seu código - por exemplo, github ou gist.

source: Import buttons on the Remix home tab
pt_br: Importar botões na aba Remix
ru_ru: Кнопки импорта на главной вкладке Remix

source: The Gist, Github, Swarm, IPFS, & HTTPS buttons are to assist in getting files into Remix so you can explore.
pt_br: Os botões do Gist, Github, Swarm, IPFS e HTTPS devem ajudar a colocar arquivos no Remix para que você possa explorar.
ru_ru: Кнопки Gist, Github, Swarm, IPFS и HTTPS предназначены для помощи в получении файлов в Remix, чтобы Вы могли их исследовать.

source: Clicking on any of the Import buttons will bring up a modal like this one:
pt_br: Clicando em qualquer um dos botões de importação abrirá uma modal como esta:
ru_ru: При нажатии на любую из кнопок Импорта появится модальное окно, подобное этому:

source: No need to wrap the input in quotes.
pt_br: Não há necessidade de encapsular a entrada entre aspas.
ru_ru: Нет необходимости оборачивать вводимые данные в кавычки.

source: Loading with a remix command in the console
pt_br: Carregando com um comando de remix no console
ru_ru: Загрузка с помощью команды remix в консоли

source: The 2 remix commands for loading are:
pt_br: Os 2 comandos de remix para carregamento são:
ru_ru: 2 ремикс-команды для загрузки - это:

source: Accessing files loaded from the Home tab or from a remix command
pt_br: Acessar arquivos carregados a partir da aba Início ou de um comando de remix
ru_ru: Доступ к файлам, загруженным с вкладки Home или из команды remix

source: When you load from github, a folder named `github` folder is created in the root of your current workspace. To import a file from the `github` folder, you would use a command like this:
pt_br: Quando você carrega do github, uma pasta chamada `github` é criada na raiz do seu espaço de trabalho atual. Para importar um arquivo da pasta `github`, você usaria um comando como este:
ru_ru: Когда Вы загружаетесь с github, в корне Вашей текущей рабочей области создается папка с именем `github`. Чтобы импортировать файл из папки `github`, Вы используете команду следующего вида:

source: Notice that this import statement doesn't include the version information that was in the remix.load(url) command. So it is recommended that you use the methods described at the top of this page for importing dependencies that you are not intending to edit.
pt_br: Observe que esta declaração de importação não inclui as informações da versão que estava no comando remix.load(url). Portanto, é recomendável que você use os métodos descritos no topo desta página para importar dependências que você não pretende editar.
ru_ru: Заметьте, что это утверждение импорта не включает информацию о версии, которая была в команде remix.load(url). Поэтому рекомендуется использовать методы, описанные в верхней части этой страницы, для импорта зависимостей, которые Вы не собираетесь редактировать.

source: Assume the .sol file that contained the import statement above is in the contracts folder. Notice that this import statement didn't need to traverse back to the github folder with a relative path like: **../github**.
pt_br: Suponha que o arquivo .sol que continha a instrução de importação acima está na pasta de contratos. Observe que este comando de importação não precisava percorrer o caminho de volta para a pasta do github com um caminho relativo como: **../github**.
ru_ru: Предположим, что файл .sol, содержащий оператор импорта выше, находится в папке contracts. Обратите внимание, что этому оператору импорта не нужно было возвращаться в папку github с относительным путем, например: **../github**.

source: When importing from NPM, or a URL (like github, a IPFS gateway, or a Swarm gateway) you do not need to do anything more than use the `import` statement in your contract. The dependencies do not need to be "preloaded" into the File Explorer's current Workspace before the contract is compiled.
ru_ru: При импорте из NPM или URL (например, github, шлюз IPFS или шлюз Swarm) Вам не нужно делать ничего, кроме использования оператора `import` в Вашем контракте. Зависимости не нужно "предварительно загружать" в текущую рабочую область File Explorer'а перед компиляцией контракта.

source: This method uses **remixd** - the remix daemon. Please go to the [remixd docs](remixd.html) for instructions about how to bridge the divide between the browser and your computers filesystem.
ru_ru: В этом методе используется **remixd** - демон remix. Пожалуйста, обратитесь к [remixd docs](remixd.html) за инструкциями о том, как преодолеть разрыв между браузером и файловой системой Вашего компьютера.

source: Importing a files for manipulation
ru_ru: Импорт файлов для манипуляций

source: When importing from the home tab widgets or with a remix command in the console, the files are placed in the **root of the current Workspace** inside a folder the shows their source - eg github or gists.
ru_ru: При импорте из виджетов домашней вкладки или с помощью команды remix в консоли, файлы помещаются в **корень текущей рабочей области** в папку с указанием их источника - например, github или gists.
