Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es_es, pt_br, ru_ru

source: Introduction
pt_br: Introdução
ru_ru: Введение

source: Core Modules
pt_br: Módulos principais
ru_ru: Основные модули

source: Solidity modules
pt_br: Módulos de Solidity
ru_ru: Модули Solidity

source: Unit Testing
pt_br: Testes unitários
ru_ru: Модульное тестирование

source: External Tool Integrations
pt_br: Integrações de ferramentas externas
ru_ru: Интеграции с внешними инструментами

source: Guides
pt_br: Guias
ru_ru: Гиды

source: Advanced
pt_br: Avançado
ru_ru: Расширенный

source: Miscellaneous
es_es: Varios
pt_br: Outros
ru_ru: Разное

source: Welcome to Remix's documentation!
es_es: Bienvenido a la documentación de Remix
pt_br: Bem-vindo à documentação do Remix!
ru_ru: Добро пожаловать в документацию Ремикса!

source: **Remix IDE** is used for the entire journey of smart contract development by users at every knowledge level. It requires no setup, fosters a fast development cycle, and has a rich set of plugins with intuitive GUIs. The IDE comes in two flavors (web app or desktop app) and as a VSCode extension.
es_es: **El IDE Remix** es utilizado durante todo el trayecto de desarrollo de contratos inteligentes por usuarios de todos los niveles de conocimiento. No requiere configuración, fomenta un ciclo de desarrollo rápido y cuenta con un rico conjunto de plugins con interfaces gráficas de usuario intuitivas. El IDE viene en dos sabores (aplicación web o aplicación de escritorio) y como extensión de VSCode.
pt_br: O **Remix IDE** é usado para toda a jornada de desenvolvimento de contratos inteligentes por usuários em todos os níveis de conhecimento. Ele não requer configuração, promove um ciclo de desenvolvimento rápido e tem um conjunto de plugins com interfaces gráficas intuitivas. O IDE vem em duas versões (web app ou app desktop) e como uma extensão VSCode.
ru_ru: **Remix IDE** используется на протяжении всего пути разработки смарт-контрактов пользователями с любым уровнем знаний. Она не требует установки, способствует быстрому циклу разработки и имеет богатый набор плагинов с интуитивно понятным графическим интерфейсом. IDE поставляется в двух вариантах (веб-приложение или настольное приложение) и как расширение VSCode.

source: **Remix Online IDE**, see: `https://remix.ethereum.org <https://remix.ethereum.org>`__
es_es: **Remix Online IDE**, véase: `https://remix.ethereum.org <https://remix.ethereum.org>`__
pt_br: **IDE Remix Online**, veja: `https://remix.ethereum.org <https://remix.ethereum.org>`__
ru_ru: **Remix Online IDE**, см: `https://remix.ethereum.org <https://remix.ethereum.org>`__.

source: Supported browsers: Firefox, Chrome, Brave. We do not support use of Remix on tablets or mobile devices.
es_es: Navegadores compatibles: Firefox, Chrome, Brave. No admitimos el uso de Remix en tabletas o dispositivos móviles.
pt_br: Navegadores suportados: Firefox, Chrome, Brave. Não suportamos o uso de Remix em tablets ou dispositivos móveis.
ru_ru: Поддерживаемые браузеры: Firefox, Chrome, Brave. Мы не поддерживаем использование Ремикс на планшетах или мобильных устройствах.

source: **Remix Desktop IDE**, see releases: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__
es_es: **Remix Desktop IDE**, consulte las versiones: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__
pt_br: **Remix Desktop IDE**, consulte releases: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__
ru_ru: **Remix Desktop IDE**, см. релизы: `https://github.com/ethereum/remix-desktop/releases <https://github.com/ethereum/remix-desktop/releases>`__.

source: **Ethereum Remix**, the VSCode extension, see `here <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. Documentation for the VSCode extension is located `here <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.
es_es: **Ethereum Remix**, la extensión VSCode, consulte `aquí <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. La documentación de la extensión VSCode se encuentra `aquí <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.
pt_br: **Ethereum Remix**, a extensão VSCode, veja `here <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. A documentação para a extensão VSCode está localizada `aqui <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.
ru_ru: **Ethereum Remix**, расширение VSCode, смотрите `здесь <https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix>`__. Документация по расширению VSCode находится `здесь <https://github.com/ethereum/remix-vscode#ethereum-remix-project-extension-for-visual-studio-code>`__.

source: **Remix Documentation Translations** The Remix docs are currently in `English <https://remix-ide.readthedocs.io/en/latest/>`__ and `Simplified Chinese <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. More languages are on the way.
pt_br: **Traduções da Documentação do Remix** A documentação do Remix está atualmente em `Inglês <https://remix-ide.readthedocs.io/en/latest/>`__ e `Chinês Simplificado <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. Mais idiomas estão a caminho.

source: Remix Project
es_es: Proyecto Remix
pt_br: Projeto Remix
ru_ru: Проект Remix

source: Remix IDE is part of the `Remix Project <https://github.com/ethereum/remix-project>`__ which also includes the `Remix Plugin Engine <https://github.com/ethereum/remix-plugin>`__ and `Remix Libraries <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, which are low-level tools for wider use.
es_es: Remix IDE forma parte del `Proyecto Remix <https://github.com/ethereum/remix-project>`__ que también incluye el `Motor de Plugins Remix <https://github.com/ethereum/remix-plugin>`__ y las `Librerías Remix <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, que son herramientas de bajo nivel para un uso más amplio.
pt_br: Remix IDE é parte do `Remix Project <https://github.com/ethereum/remix-project>`__ que também inclui o `Remix Plugin Engine <https://github.com/ethereum/remix-plugin>`__ e o `Remix Libraries <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, que são ferramentas de baixo nível para uma utilização mais ampla.
ru_ru: Remix IDE является частью проекта `Remix Project <https://github.com/ethereum/remix-project>`__, который также включает в себя `Remix Plugin Engine <https://github.com/ethereum/remix-plugin>`__ и `Remix Libraries <https://github.com/ethereum/remix-project/tree/master/libs#remix-libraries>`__, которые представляют собой низкоуровневые инструменты для более широкого использования.

source: Remix IDE is available at `remix.ethereum.org <https://remix.ethereum.org>`__ and more information can be found in these docs. Our IDE tool is available at `our GitHub repository <https://github.com/ethereum/remix-project>`__.
es_es: Remix IDE está disponible en `remix.ethereum.org <https://remix.ethereum.org>`__ y puede encontrar más información en estos documentos. Nuestra herramienta IDE está disponible en `nuestro repositorio GitHub <https://github.com/ethereum/remix-project>`__.
pt_br: O IDE do Remix está disponível em `remix.ethereum.org <https://remix.ethereum.org>`__ e mais informações podem ser encontradas nestes documentos. Nossa IDE está disponível em `nosso repositório GitHub <https://github.com/ethereum/remix-project>`__.
ru_ru: Remix IDE доступна по адресу `remix.ethereum.org <https://remix.ethereum.org>`__, а дополнительную информацию можно найти в этой документации. Наш инструмент IDE доступен на `нашем репозитории GitHub <https://github.com/ethereum/remix-project>`__.

source: This set of documents covers instructions on how to use Remix. Additional information can be found in our `blog <https://medium.com/remix-ide>`__ and in our tutorial tool, `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ located inside of Remix IDE.
es_es: Este conjunto de documentos cubre las instrucciones sobre cómo utilizar Remix. Puede encontrar información adicional en nuestro `blog <https://medium.com/remix-ide>`__ y en nuestra herramienta tutorial, `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ ubicada dentro de Remix IDE.
pt_br: Este conjunto de documentos cobre instruções sobre como usar o Remix. Informações adicionais podem ser encontradas em nosso `blog <https://medium.com/remix-ide>`__ e em nossa ferramenta de tutorial, em `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__ localizado dentro do Remix IDE.
ru_ru: Этот набор документов содержит инструкции по использованию Ремикса. Дополнительную информацию можно найти в нашем `блоге <https://medium.com/remix-ide>`__ и в нашем обучающем инструменте `LearnEth <https://remix-alpha.ethereum.org/?#activate=solidity,solidityUnitTesting,LearnEth&call=LearnEth//startTutorial//ethereum/remix-workshops//master//solidityintroduction&deactivate=home&minimizeterminal=true->`__, расположенном внутри Remix IDE.

source: Useful links:
es_es: Enlaces útiles:
pt_br: Links úteis:
ru_ru: Полезные ссылки:

source: `Solidity Documentation <https://solidity.readthedocs.io>`__
es_es: `Documentación de solidez <https://solidity.readthedocs.io>`__
pt_br: `Documentação do Solidity <https://solidity.readthedocs.io>`__
ru_ru: `Документация по солидности <https://solidity.readthedocs.io>`__.

source: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - The version where we test new Remix release (not stable!).
es_es: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - La versión en la que probamos la nueva versión de Remix (¡no es estable!).
pt_br: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - A versão onde testamos o novo lançamento Remix (não estável!).
ru_ru: `Remix Alpha <https://remix-alpha.ethereum.org>`__ - Версия, в которой мы тестируем новый релиз Remix (не стабильный!).

source: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Remix Desktop's release page.
es_es: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Página de lanzamiento de Remix Desktop.
pt_br: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Página de lançamento do Remix Desktop.
ru_ru: `Remix Desktop <https://github.com/ethereum/remix-desktop/releases>`__ - Страница выпуска Remix Desktop.

source: `Remix on Github <https://github.com/ethereum/remix-project>`__
es_es: `Remix en Github <https://github.com/ethereum/remix-project>`__
pt_br: `Remix no Github <https://github.com/ethereum/remix-project>`__
ru_ru: `Remix на Github <https://github.com/ethereum/remix-project>`__.

source: `Remix on Medium <https://medium.com/remix-ide>`__
es_es: `Remix en Medium <https://medium.com/remix-ide>`__
pt_br: `Remix no Medium <https://medium.com/remix-ide>`__
ru_ru: `Remix на Medium <https://medium.com/remix-ide>`__

source: `Remix on Twitter <https://twitter.com/EthereumRemix>`__
es_es: `Remix en Twitter <https://twitter.com/EthereumRemix>`__
pt_br: `Remix no Twitter <https://twitter.com/EthereumRemix>`__
ru_ru: `Remix в Twitter <https://twitter.com/EthereumRemix>`__.

source: `Our Discord support channel <https://discord.gg/ZZSGegD7jm>`__
es_es: `Nuestro canal de asistencia de Discord <https://discord.gg/ZZSGegD7jm>`__
pt_br: `Nosso canal de suporte no Discord <https://discord.gg/ZZSGegD7jm>`__
ru_ru: `Наш канал поддержки Discord <https://discord.gg/ZZSGegD7jm>`__.

source: `Ethereum.org's Developer resources <https://ethereum.org/en/developers/>`__
es_es: `Recursos para desarrolladores de Ethereum.org <https://ethereum.org/en/developers/>`__
pt_br: `Ethereum.org, recursos para desenvolvedores <https://ethereum.org/en/developers/>`__
ru_ru: `Ресурсы разработчиков Ethereum.org <https://ethereum.org/en/developers/>`__.

source: **Remix Documentation Translations** The Remix docs are currently in `English <https://remix-ide.readthedocs.io/en/latest/>`__ and `Simplied Chinese <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. More languages are on the way.
ru_ru: **Переводы документации Ремикс** В настоящее время документация Ремикс представлена на `английском <https://remix-ide.readthedocs.io/en/latest/>`__ и `приблизительно китайском <https://remix-ide.readthedocs.io/zh_CN/latest/>`__. Другие языки находятся на подходе.

source: New Layout Intro
es_es: Introducción al nuevo diseño

source: Tour of default modules
es_es: Recorrido por los módulos predeterminados

source: Tour of typical solidity modules
es_es: Recorrido por los módulos de solidez típicos

source: Solidity Unit Testing
es_es: Pruebas unitarias de Solidity

source: Native External Integrations
es_es: Integraciones externas nativas

source: Using Remix
es_es: Uso de Remix
