Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/layout.po
Languages: pt_br, ru_ru

source: Navigating Remix
pt_br: Navegando no Remix

source: Remix IDE is comprised of three panels and a terminal.
pt_br: O Remix IDE é composto por três painéis e um terminal.
ru_ru: Remix IDE состоит из трех панелей и терминала.

source: Icon Panel - click to change which plugins appear in the Side Panel
pt_br: Painel de Ícones - clique para alterar quais plugins aparecem no Painel Lateral
ru_ru: Панель иконок - щелкните, чтобы изменить, какие плагины отображаются на Боковой панели

source: Side Panel - most but not all plugins have their interface here
pt_br: Painel lateral - a maioria dos plugins tem sua interface aqui, mas não todos
ru_ru: Боковая панель - большинство, но не все плагины имеют здесь свой интерфейс

source: Main Panel - for editing files, large format tools, and the home tab
pt_br: Painel principal - para edição de arquivos, ferramentas de formato grande e a aba home
ru_ru: Главная панель - для редактирования файлов, широкоформатных инструментов и домашней вкладки

source: Terminal - for viewing transaction receipts and various logs
pt_br: Terminal - para visualizar recibos de transações e vários registros
ru_ru: Терминал - для просмотра квитанций об оплате транзакций и различных журналов

source: Default Tools
pt_br: Ferramentas padrão
ru_ru: Инструменты по умолчанию

source: When Remix is loaded - the icon panel shows these icons by default.
pt_br: Quando Remix é carregado - o painel de ícone mostra esses ícones por padrão.
ru_ru: Когда Remix загружен - на панели пиктограмм по умолчанию отображаются эти пиктограммы.

source: To load more plugins go to the **[Plugin Manager](#plugin-manager)** or click on one of the featured plugins in the home tab.
pt_br: Para carregar mais plugins vá para o **[Gerenciador de Plugins](#plugin-manager)** ou clique em um dos plugins em destaque na aba inicial.
ru_ru: Чтобы загрузить другие плагины, зайдите в **[Менеджер плагинов](#plugin-manager)** или щелкните на одном из представленных плагинов на главной вкладке.

source: Home tab
pt_br: Aba inicial
ru_ru: Главная вкладка

source: The home tab is located in the Main Panel. It can be closed, just like any of the main panel tabs. <br> You can also access it (even if closed) by clicking the Remix logo at the top of the icon panel.
pt_br: A aba inicial está localizada no painel principal. Ela pode ser fechada, como qualquer uma das guias de painel principal. <br> Você também pode acessá-lo (mesmo que fechado) clicando no logotipo Remix no topo do painel de ícone.
ru_ru: Вкладка Home расположена в Главной панели. Ее можно закрыть, как и любую другую вкладку Главной панели. <br> Вы также можете получить к ней доступ (даже если она закрыта), щелкнув на логотипе Remix в верхней части панели пиктограмм.

source: The home tab contains links to resources, announcements, tutorials, featured plugins and methods for loading files into Remix and shortcuts for connecting Remix to your local filesystem.
pt_br: A aba Inicial contém links para recursos, avisos, tutoriais, plugins e métodos de carregamento de arquivos em Remix e atalhos para conexão Remix ao seu sistema de arquivos local.
ru_ru: Главная вкладка содержит ссылки на ресурсы, объявления, учебные пособия, тематические плагины и методы загрузки файлов в Remix, а также ярлыки для подключения Remix к Вашей локальной файловой системе.

source: Clicking the **Solidity button** in the featured plugins section of the home tab will activate **Solidity Static Analysis** and **Solidity Unit Testing** as well as the Solidity Compiler and Deploy & Run (which are there by default).
pt_br: Clicando no **botão Solidity** na seção de plugins em destaque na aba inicial ativará **Solidity Static Analysis e **Solidity Unit Testing** assim como o Compilador Solidity e a seção Implementar e Executar (que estão lá por padrão).
ru_ru: Щелчок на кнопке **Solidity** в разделе featured plugins на главной вкладке активирует **Solidity Static Analysis** и **Solidity Unit Testing**, а также Solidity Compiler и Deploy & Run (которые присутствуют там по умолчанию).

source: To see all the plugins go to the **Plugin Manager** - by selecting the plug in the icon panel. ![](images/a-plug.png) <br> You can also get there by clicking the **More** button in the featured plugin list.
pt_br: Para ver todos os plugins vá ao **Gerenciador de Plugin** - selecionando o plugin no painel de ícones. ![](images/a-plug.png) <br> Você também pode chegar lá clicando no botão **Mais** na lista de plugins em destaque.
ru_ru: Чтобы увидеть все плагины, перейдите в **Менеджер плагинов** - выбрав плагин на панели пиктограмм. ![](images/a-plug.png) <br> Вы также можете попасть туда, нажав кнопку **More** в списке плагинов.

source: Plugin Manager
pt_br: Gerenciador de plugin
ru_ru: Менеджер плагинов

source: In Remix, you only need to load the functionality you need - and the Plugin Manager is where you manage what plugins are turned off or on.
pt_br: Em Remix, você só precisa carregar a funcionalidade que você precisa - e o Gerenciador de Plugins é onde você gerencia quais plugins estão desligados ou ligados.

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix. In that case you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
pt_br: O Gerenciador de Plugin também é o lugar que você vai quando estiver criando seu próprio plugin e você deseja carregar seu plugin local no Remix. Nesse caso você deverá clicar no link "Conectar a um plugin Local" no topo do painel Gerenciador de Plugins.
ru_ru: Менеджер плагинов - это также то место, куда Вы обращаетесь, если Вы создаете свой собственный плагин и хотите загрузить локальный плагин в Remix. В этом случае Вы щелкните на ссылке "Подключиться к локальному плагину" в верхней части панели Менеджера плагинов.

source: Themes
pt_br: Temas
ru_ru: Темы

source: Themes are chosen at the bottom of the **Settings** plugin. These are Bootstrap-based themes. The Dark and Light themes are most customized for Remix.
pt_br: Os temas são escolhidos na parte inferior do plugin **Configurações**. Estes são temas baseados em Bootstrap. Os temas Dark e Light são mais personalizados para Remix.
ru_ru: Темы выбираются в нижней части плагина **Настройки**. Это темы, основанные на Bootstrap. Темы Dark и Light наиболее приспособлены для Remix.

source: In Remix, you only need to load the functionality you need - and the Plugin Manger is where you manage what plugins are turned off or on.
ru_ru: В Remix Вам нужно загрузить только ту функциональность, которая Вам нужна - а Plugin Manger - это место, где Вы управляете тем, какие плагины отключены или включены.
