Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/locations.po
Languages: pt_br, ru_ru

source: Remix URLs & Links with Parameters
pt_br: Remixe URLs e Links com Parâmetros
ru_ru: Ремикс URL и ссылок с параметрами

source: Main Remix URLs
pt_br: URLs Remix Principais
ru_ru: Основные URL-адреса ремиксов

source: Remix IDE Online is located at [https://remix.ethereum.org](https://remix.ethereum.org).
pt_br: O Remix IDE Online está localizado em [https://remix.ethereum.org](https://remix.ethereum.org).
ru_ru: Remix IDE Online находится по адресу [https://remix.ethereum.org](https://remix.ethereum.org).

source: The alpha version of remix is located at [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). This is not a stable version.
pt_br: A versão alpha do remix está localizada em [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). Esta não é uma versão estável.
ru_ru: Альфа-версия ремикса находится по адресу [https://remix-alpha.ethereum.org](https://remix-alpha.ethereum.org). Это не стабильная версия.

source: Github repo: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). The README contains instructions for running Remix-IDE locally.
pt_br: GitHub repo: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). O README contém instruções para executar Remix-IDE localmente.
ru_ru: Github repo: [https://github.com/ethereum/remix-project](https://github.com/ethereum/remix-project). В README содержатся инструкции по локальному запуску Remix-IDE.

source: Remix Desktop is an Electron App. Here is the [release page](https://github.com/ethereum/remix-desktop/releases).
pt_br: Remix Desktop é um aplicativo do Electron. Aqui está a [página de lançamento](https://github.com/ethereum/remix-desktop/releases).
ru_ru: Remix Desktop - это приложение для Electron. Здесь находится [страница релиза](https://github.com/ethereum/remix-desktop/releases).

source: Remix has a VSCode extension called [Ethereum Remix](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).
pt_br: Remix tem uma extensão VSCode chamada [Ethereum Remix](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).
ru_ru: Remix имеет расширение VSCode под названием [Ethereum Remix](https://marketplace.visualstudio.com/items?itemName=RemixProject.ethereum-remix).

source: The Remix twitter account is [EthereumRemix](https://twitter.com/EthereumRemix).
pt_br: A conta Remix no twitter é [EthereumRemix](https://twitter.com/EthereumRemix).
ru_ru: Твиттер-аккаунт Remix - [EthereumRemix](https://twitter.com/EthereumRemix).

source: The Remix Project Medium publication is: [https://medium.com/remix-ide](https://medium.com/remix-ide).
pt_br: O Projeto Médio Remix é: [https://medium.com/remix-ide](https://medium.com/remix-ide).
ru_ru: Средняя публикация проекта Ремикс: [https://medium.com/remix-ide](https://medium.com/remix-ide).

source: The [Remix Project](https://remix-project.org) website introduces the different facets of our project.
pt_br: O site [Projeto Remix](https://remix-project.org) apresenta as diferentes facetas do nosso projeto.
ru_ru: Веб-сайт [Remix Project](https://remix-project.org) знакомит с различными аспектами нашего проекта.

source: The [Remix Gitter Channel](https://gitter.im/ethereum/remix) is a forum to post your questions about Remix.
pt_br: O [Remix Gitter Channel](https://gitter.im/ethereum/remix) é um fórum para publicar suas perguntas sobre Remix.
ru_ru: [Remix Gitter Channel](https://gitter.im/ethereum/remix) - это форум для размещения Ваших вопросов о Ремиксе.

source: Customize Remix with URL Parameters
pt_br: Personalizar Remix com Parâmetros de URL
ru_ru: Настройка Ремикса с помощью параметров URL

source: There are many ways to customize Remix IDE by using url parameters. Here are some options:
pt_br: Existem muitas maneiras de personalizar o Remix IDE usando parâmetros de URL. Aqui estão algumas opções:
ru_ru: Существует множество способов настройки Remix IDE с помощью url-параметров. Вот некоторые варианты:

source: Activate or deactivate a **list of plugins to be activated** - and specify which plugin gains the "focus". [SEE MORE](#activating-a-list-of-plugins)
pt_br: Ativar ou desativar uma **lista de plugins para ser ativado** - e especificar qual plugin ganha o "foco". [SEE MORE](#activating-a-list-of-plugins)
ru_ru: Активируйте или деактивируйте **список плагинов, которые должны быть активированы** - и укажите, какой плагин получит "фокус". [SEE MORE](#activating-a-list-of-plugins)

source: Send **commands to a plugin** - once the plugin loads. [SEE MORE](#pass-commands-to-a-plugin-s-api-via-a-url-param)
pt_br: Envie **comandos para um plugin** - assim que o plugin carregar. [VEJA MAIS](#pass-commands-to-a-plugin-s-api-via-url-param)
ru_ru: Передайте **команды плагину** - как только плагин загрузится. [SEE MORE](#pass-commands-to-a-plugin-s-api-via-a-url-param)

source: [Load a GIST](#load-a-gist), [a file via a url](#load-a-file-via-a-url-into-the-editor) or a [base64 encoded string](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) into Remix's Editor.
pt_br: [Carregue um GIST](#load-a-gist), [um arquivo através de uma URL](#load-a-file-via-url-into-the-editor) ou uma [string codificada em base6)](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) no Editor do Remix.
ru_ru: [Загрузить GIST](#load-a-gist), [файл по url](#load-a-file-via-a-url-into-the-editor) или [base64-кодированную строку](#load-an-encoded-base64-string-into-a-sol-file-in-the-editor) в Редактор Ремикса.

source: Specify **the theme** (Dark or Light). [SEE MORE](#specifying-a-theme)
pt_br: Especifique **o tema** (Dark or Light). [VEJA MAIS](#specifying-a-theme)
ru_ru: Укажите **тему** (Темная или Светлая). [SEE MORE](#specifying-a-theme)

source: Specify which panels should be **minimized** - useful when embedding Remix in your site. [SEE MORE](#minimizing-remix-panels)
pt_br: Especifica quais painéis devem ser **minimizados** - útil quando incorporar Remix no seu site. [VEJA MAIS](#minimizing-remix-painels)
ru_ru: Укажите, какие панели должны быть **минимизированы** - полезно при встраивании Remix на Ваш сайт. [SEE MORE](#minimizing-remix-panels)

source: Select the **version of the Solidity** compiler, enable/disable the **optimizer**, turn on auto compile or choose the language for the Solidity compiler. [SEE MORE](#load-a-specific-version-of-the-solidity-compiler)
pt_br: Selecione a **versão do compilador Solidity**, habilite/desabilite o **otimizador**, ligue a auto compilação ou escolha o idioma do compilador Solidity. [VEJA MAIS](#load-a-specific-version-of-the-solidity-compiler)
ru_ru: Выберите **версию компилятора Solidity**, включите/выключите **оптимизатор**, включите автоматическую компиляцию или выберите язык для компилятора Solidity. [SEE MORE](#load-a-specific-version-of-the-solidity-compiler)

source: Load **verified contracts from Etherscan** using contract address [SEE MORE](#load-contracts-from-etherscan-via-address)
pt_br: Carregue **contratos verificados da Etherscan** usando o endereço do contrato [VEJA MAIS](#load-contracts-from-etherscan-via-address)
ru_ru: Загрузите **проверенные контракты из Etherscan**, используя адрес контракта [SEE MORE](#load-contracts-from-etherscan-via-address).

source: Activating a list of plugins
pt_br: Ativando uma lista de plugins
ru_ru: Активация списка плагинов

source: The following example contains the url parameter **activate** followed by **a comma separated list of plugins**.
pt_br: O exemplo a seguir contém o parâmetro de url **ativar** seguido de **uma lista de plugins separada por vírgulas**.
ru_ru: Следующий пример содержит url-параметр **activate**, за которым следует **разделенный запятыми список плагинов**.

source: The last plugin in the list will gain the focus.
pt_br: O último plugin da lista ganhará o foco.
ru_ru: Последний плагин в списке получит фокус.

source: When you use the activate list, all other plugins that a user had loaded will be deactivated. This does not apply to the file explorer, the plugin manager, and the settings modules because these are never deactivated.
pt_br: Quando você usa a lista de ativação, todos os outros plugins que um usuário carregou serão desativados. Isto não se aplica ao gerenciador de arquivos, ao gerenciador de plugins e aos módulos de configurações porque estes nunca são desativados.
ru_ru: Когда Вы используете список activate, все остальные плагины, которые были загружены пользователем, будут деактивированы. Это не относится к файловому проводнику, менеджеру плагинов и модулям настроек, поскольку они никогда не деактивируются.

source: Note: a plugin is called by its **name** as specified in its profile. There are 3 types of plugins:
pt_br: Nota: um plugin é chamado pelo seu **nome** como especificado no seu perfil. Existem 3 tipos de plugins:
ru_ru: Примечание: плагин называется по его **имени**, указанному в его профиле. Существует 3 типа плагинов:

source: **Native Mandatory Plugins** that are always loaded (so you don't need to activate them using the url parameter **activate**). These include: **fileManager**, **settings**, **manager** (the plugin manager), and **udapp** (deploy & run).
pt_br: **Plugins Obrigatórios Nativos** que são sempre carregados (então você não precisa ativá-los usando o parâmetro de url **ativar**). Estes incluem: **fileManager**, **configurações**, **manager** (o gerenciador de plugin) e **udapp** (implantar e executar).
ru_ru: **Нативные обязательные плагины**, которые всегда загружены (поэтому Вам не нужно активировать их с помощью url-параметра **activate**). К ним относятся: **fileManager**, **settings**, **manager** (менеджер плагинов) и **udapp** (развертывание и запуск).

source: **Native Optional Plugins** that are loaded on demand: **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting**, and **vyper**
pt_br: **Plugins opcionais nativos** que são carregados à demanda: **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting**, e **vyper**
ru_ru: **Нативные дополнительные плагины**, которые загружаются по требованию: **debugger**, **hardhat-provider**, **solidity**, **solidityStaticAnalysis**, **solidityUnitTesting** и **vyper**.

source: **External Plugins** to get these plugins' names, please go to [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).
pt_br: **Plugins externos** para pegar os nomes desses plugins, por favor, vá para [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).
ru_ru: **Внешние плагины** Чтобы узнать названия этих плагинов, пожалуйста, зайдите на [https://github.com/ethereum/remix-plugins-directory/tree/master/plugins](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins).

source: Deactivating a list of plugins
pt_br: Desativando uma lista de plugins

source: Minimizing Remix panels
pt_br: Minimizando painéis Remix
ru_ru: Минимизация панелей Remix

source: The following URL will **close everything except the main panel & the icon panel** (the side and terminal are minimized).
pt_br: O URL a seguir irá **fechar tudo, exceto o painel principal e o painel de ícone** (o lado e o terminal são minimizados).
ru_ru: Следующий URL **закроет все, кроме главной панели и панели пиктограмм** (боковая панель и терминал будут свернуты).

source: To minimize just the side panel, use this URL:
pt_br: Para minimizar apenas o painel lateral, use este URL:
ru_ru: Чтобы свернуть только боковую панель, используйте этот URL:

source: To minimize just the terminal, use this URL:
pt_br: Para minimizar apenas o terminal, use este URL:
ru_ru: Чтобы свернуть только терминал, используйте этот URL:

source: Specifying a theme
pt_br: Especificando um tema
ru_ru: Определение темы

source: To link to Remix with a theme specified use this url:
pt_br: Para vincular ao Remix com um tema especificado, use esta url:
ru_ru: Чтобы сделать ссылку на Ремикс с указанной темой, используйте этот url:

source: A URL example combining multiple parameters
pt_br: Um exemplo de URL que combina vários parâmetros
ru_ru: Пример URL, объединяющего несколько параметров

source: To link to Remix with the list of plugins activated and with:
pt_br: Para vincular ao Remix com a lista de plugins ativados e com:

source: the Learneth gaining the side panel's focus (because it is the last in the list)
pt_br: o Aprendizado que ganha foco no painel lateral (porque é o último da lista)
ru_ru: Learneth получает фокус боковой панели (поскольку он последний в списке)

source: the Light theme loaded
pt_br: o tema Light foi carregado
ru_ru: загружена тема Light

source: the terminal minimized
pt_br: o terminal minimizado
ru_ru: терминал минимизирован

source: optimize off
pt_br: otimizar desativado
ru_ru: оптимизация отключена

source: use this url:
pt_br: use este url:
ru_ru: используйте этот url:

source: Pass commands to a plugin's API via a url param
pt_br: Passar comandos para a API de um plugin através de um parâmetro url
ru_ru: Передавайте команды в API плагина через url-параметр

source: The URL parameter to issue a command is `call`. Following the `call` is a // (double slash) separated list of arguments.
pt_br: O parâmetro URL para emitir um comando é 'chamada'. Seguindo o 'call' é uma lista de argumentos separada de // (dupla barra).
ru_ru: Параметром URL для выдачи команды является `call`. За `call` следует список аргументов, разделенных // (двойной косой чертой).

source: An example using call
pt_br: Um exemplo usando uma chamada
ru_ru: Пример с использованием вызова

source: The URL below uses `activate` & `call`. It **activates** a number of plugins and **calls** the File Explorers to tell it to load one of the default Remix files:
pt_br: A URL abaixo usa `activate` & `call`. Ele **ativa** uma série de plugins e **chama** os Exploradores de Arquivos para dizer para carregar um dos arquivos padrão do Remix:
ru_ru: В приведенном ниже URL используются `activate` и `call`. Он **активирует** ряд плагинов и **вызывает** File Explorers, чтобы сообщить ему о необходимости загрузить один из файлов Remix по умолчанию:

source: Load a specific tutorial in the **LearnEth** plugin:
pt_br: Carregue um tutorial específico no plugin **LearnEth**:
ru_ru: Загрузите определенный учебник в плагине **LearnEth**:

source: Make calls to a number of different plugins' APIs
pt_br: Fazer chamadas para uma série de APIs de plugins diferentes
ru_ru: Выполняйте вызовы API различных плагинов

source: Use the `calls` parameter to call a series of plugins. Use `///` to separate the calls.
pt_br: Use o parâmetro `calls` para chamar uma série de plugins. Use `//` para separar as chamadas.
ru_ru: Используйте параметр `calls` для вызова серии плагинов. Используйте `///` для разделения вызовов.

source: For example, this command, after activating a list of plugins, calls the LearnEth plugin's API and then calls the File Explorer's API.
pt_br: Por exemplo, este comando, depois de ativar uma lista de plugins, chama a API do plugin LearnEth e em seguida chama a API do Explorador de Arquivos.
ru_ru: Например, эта команда, после активации списка плагинов, вызывает API плагина LearnEth, а затем вызывает API File Explorer.

source: Load a file via a URL into the Editor
pt_br: Carregar um arquivo através de uma URL no Editor
ru_ru: Загрузка файла по URL в Редактор

source: The `url` parameter takes a URL, loads it into the Editor and saves it into the code-sample workspace of the File Explorer:
pt_br: O parâmetro `url` leva uma URL, carrega no Editor e o salva no espaço de trabalho de amostra de código do Explorador de Arquivos:
ru_ru: Параметр `url` принимает URL, загружает его в Редактор и сохраняет в рабочей области "Образец кода" в Проводнике файлов:

source: Load an encoded base64 string into a .sol file in the Editor
pt_br: Carregar uma string de base64 codificada em um arquivo .sol no Editor
ru_ru: Загрузите закодированную строку base64 в файл .sol в Редакторе

source: The `code` parameter takes an encoded base64 string and loads it into the Editor as a .sol file and saves to the code-sample workspace of the File Explorer:
pt_br: O parâmetro `código` recebe uma string codificada de base64 e carrega no Editor como um arquivo .sol e salva no espaço de trabalho da amostra de código do Explorador de Arquivos:
ru_ru: Параметр `code` принимает закодированную base64 строку и загружает ее в Редактор в виде .sol файла, а также сохраняет в рабочую область Code-sample в Проводнике файлов:

source: Load contracts from Etherscan via address
pt_br: Carregar contratos de Etherscan via endereço
ru_ru: Загрузка контрактов из Etherscan через адрес

source: The `address` parameter takes an address, loads all the **verified contracts** found for the address on different Ethereum networks and saves them into the `etherscan-code-sample` workspace of the File Explorer:
pt_br: O parâmetro `endereço` recebe um endereço, carrega todos os **contratos verificados** encontrados para o endereço em diferentes redes Ethereum e as salva na área de trabalho `etherscan-code-sample` do Explorador de Arquivos:
ru_ru: Параметр `address` принимает адрес, загружает все **проверенные контракты**, найденные для этого адреса в различных сетях Ethereum, и сохраняет их в рабочую область `etherscan-code-sample` в Проводнике файлов:

source: Load a Solidity contract from Github
pt_br: Carregar um contrato de Solidity do Github
ru_ru: Загрузите контракт Solidity с Github

source: With a github url of a Solidity contract like this one:
pt_br: Com uma url do github de um contrato de Solidity como este:
ru_ru: С помощью github url контракта Solidity, подобного этому:

source: Then delete the **github** part and type in **remix.ethereum.org** in its place, like this:
pt_br: Em seguida, apague a parte **github** e digite **remix.ethereum.org** em seu lugar, assim:
ru_ru: Затем удалите часть **github** и впишите вместо нее **remix.ethereum.org**, примерно так:

source: Remix will fetch the Solidity file and open it up in the File Explorer in a Workspace named<br> **code-sample**.
pt_br: O Remix irá buscar o arquivo Solidity e abri-lo no Gerenciador de Arquivos em um espaço de trabalho chamado<br> **code-sample**.
ru_ru: Remix получит файл Solidity и откроет его в Проводнике файлов в рабочей области с именем<br> **code-sample**.

source: Load a GIST
pt_br: Carregar um GIST
ru_ru: Загрузить GIST

source: The URL parameter here is `gist`.
pt_br: O parâmetro da URL aqui é `gist`.
ru_ru: Параметром URL здесь является `gist`.

source: Load a GIST and have it be visible in the Editor:
pt_br: Carregar um GIST e tê-lo visível no Editor:
ru_ru: Загрузите GIST и сделайте его видимым в Редакторе:

source: Using both `gist` & `call`
pt_br: Usando tanto `gist` quanto `call`
ru_ru: Используя одновременно `gist` и `call`

source: Load a GIST, have it be visible in the Editor & load a list of plugins:
pt_br: Carregar um GIST, ter que ser visível no Editor e carregar uma lista de plugins:
ru_ru: Загрузите GIST, сделайте его видимым в редакторе и загрузите список плагинов:

source: Load a specific version of the Solidity compiler:
pt_br: Carregar uma versão específica do compilador Solidity:
ru_ru: Загрузите определенную версию компилятора Solidity:

source: **Note:** you need to specify both the Solidity version and the commit.
pt_br: **Nota:** você precisa especificar tanto a versão do Solidity como o commit.
ru_ru: **Примечание:** Вам необходимо указать как версию Solidity, так и коммит.

source: Load a custom Solidity compiler:
pt_br: Carregar um compilador de Solidity personalizado:
ru_ru: Загрузите пользовательский компилятор Solidity:

source: Turn on autoCompile:
pt_br: Ative a Auto Compilação:
ru_ru: Включите функцию autoCompile:

source: Select the language for the Solidity Compiler
pt_br: Selecione o idioma para o Compilador Solidity
ru_ru: Выберите язык для компилятора Solidity

source: Choose YUL or Solidity with the language parameter.
pt_br: Escolha YUL ou Solidity com os parâmetros do idioma.
ru_ru: Выберите YUL или Solidity с параметром языка.

source: Deactiving a list of plugins
ru_ru: Отключение списка подключаемых модулей

source: To link to Remix with the a list of plugins activated and with:
ru_ru: Чтобы установить ссылку на Remix со списком активированных плагинов и с:
