Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_list.po
Languages: pt_br

source: Plugin List
pt_br: Lista de plugin

source: Here is the list of Remix plugins that you will see in the Plugin Manager:
pt_br: Aqui está a lista de plugins Remix que você verá no Gerenciador de Plugin:

source: Core Plugins
pt_br: Plugins principais

source: **File Explorer** &nbsp; ![](images/pi-fe.png)<br> The File Explorers is where you can see the files.<br> profile name: **fileManager** <br>[Documentation](file_explorer.html)
pt_br: **Explorador de Arquivos** &nbsp; ![](images/pi-fe.png)<br> O Explorador de Arquivos é onde você pode ver os arquivos.<br> nome do perfil: **fileManager** <br>[Documentation](file_explorer.html)

source: **Remixd** &nbsp; (No UI) <br>Remixd (with an npm package running locally) connects a folder on your filesystem to the Remix website. Please see the docs for instructions. <br>profile name: **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)
pt_br: **Remixd** &nbsp; (Sem UI) <br>Remixd (com um pacote do npm sendo executado localmente) conecta uma pasta no seu sistema de arquivos ao site Remix. Por favor, consulte a documentação para instruções. Nome do perfil <br>, **remixd** <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/remixd.html)

source: **Solidity Compiler** &nbsp; ![](images/pi-sol.png)<br> Compiles Solidity & YUL. <br>profile name: **solidity** <br>[Documentation](compile.html)
pt_br: **Compilador Solidity** &nbsp; ![](images/pi-sol.png)<br> Compila Solidity & YUL. <br>nome do perfil: **solidity** <br>[Documentação](compile.html)

source: **Deploy & Run** &nbsp; ![](images/pi-deploy.png)<br> Deploy & interact with smart contracts on the in-browser chain (JSVM), local nodes, and public networks. <br>profile name: **udapp** <br>[Documentation](run.html)
pt_br: **Implementar e Executar** &nbsp; ![](images/pi-deploy.png)<br> Implantar e interagir com contratos inteligentes na Blockchain do navegador (JSVM), nós locais e redes públicas. <br>nome de perfil: **udapp** <br>[Documentação](run.html)

source: **Debugger** &nbsp; ![](images/pi-debug.png)<br> Insert breakpoints, step through a contract, check high level and low level parameters, and fetch & debug a transaction of a verified contract. <br>profile name: **debugger** <br>[Documentation](debugger.html)
pt_br: **Debugger** &nbsp; ![](images/pi-debug. ng)<br> Insira breakpoints, percorra passo a passo um contrato, verifique parâmetros de alto nível e de baixo nível, e busque e depure uma transação de um contrato verificado. <br>nome de perfil: **debugger** <br>[Documentação](debugger.html)

source: **Solidity Unit Testing** &nbsp; ![](images/pi-sut.png)<br> Run unit test written in Solidity. <br>profile name: **solidityUnitTesting** <br>[Documentation](unittesting.html)
pt_br: **Teste de Unidade de Solidity** &nbsp; ![](images/pi-sut.png)<br> Executar teste de unidade escrito em Solidity. <br>nome de perfil: **solidityUnitTesting** <br>[Documentação](unittesting.html)

source: **Solidity Static Analysis** &nbsp; ![](images/pi-static.png)<br> Static code analysis is a process to debug the code by examining it and without actually executing the code. This plugin also has integrations with [Slither](slither.html). <br>profile name: **solidityStaticAnalysis** <br>[Documentation](static_analysis.html)
pt_br: **Análise Estática da Solidity** &nbsp; ![](images/pi-static. ng)<br> Análise de código estático é um processo de depuração do código examinando-o e sem realmente executar o código. Este plugin também tem integrações com [Slither](slither.html). <br>nome do perfil: **solidityStaticAnalysis** <br>[Documentation](static_analyis.html)

source: Additional Plugins
pt_br: Plugins Adicionais

source: (sorted alphabetically)
pt_br: (ordenado por ordem alfabética)

source: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile & Deploy to the Celo blockchain. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/dexfair/celo-remix-plugin) <br>[Make an issue](https://github.com/dexfair/celo-remix-plugin/issues)
pt_br: **Celo Compiler / Deployer** &nbsp; ![](images/pi-celo.png)<br> Compile e Deploy para o blockchain Celo <br>[nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentação](https://github.com/dexfair/celo-remix-plugin) <br>[Abra uma issue](https://github.com/dexfair/celo-remix-plugin/issues)

source: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Deploy a contract to multiple chains (1 at a time) with the same address. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile.json): celo-remix-plugin <br>[Documentation](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Make an issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)
pt_br: **Contract Deployer** &nbsp; ![](images/pi-deployer.png)<br> Implantar um contrato em várias redes (1 de cada vez) com o mesmo endereço. <br>[nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/celo/profile. son): celo-remix-plugin <br>[Documentação](https://github.com/hexdivision/remix-contract-deployer-plugin) <br>[Abra uma issue](https://github.com/hexdivision/remix-contract-deployer-plugin/issues)

source: **Contract Verification - Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verify contracts on Etherscan. <br>[Profile name](https://github.com/ethereum/remix-project/blob/master/apps/etherscan/src/profile.json): etherscan <br>[Documentation](https://remix-ide.readthedocs.io/en/latest/contract_verification.html#etherscan) <br>[Make an issue](https://github.com/ethereum/remix-project/tree/master/apps/etherscan)
pt_br: **Verificação do contrato - Etherscan** &nbsp; ![](images/pi-etherscan.png) &nbsp; <br>Verifique contratos no Etherscan. <br>[Nome do perfil](https://github.com/ethereum/remix-project/blob/master/apps/etherscan/src/profile.json): etherscan <br>[Documentação](https://remix-ide.readthedocs.io/en/latest/contract_verification.html#etherscan) <br>[Abra uma issue](https://github.com/ethereum/remix-project/tree/master/apps/etherscan)

source: **Contract Verification - Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verify contracts and fetch verified contracts <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verifier/profile.json): sourcify <br>[Documentation](https://docs.sourcify.dev/docs/intro/) <br>[Make an issue](https://github.com/sourcifyeth/remix-sourcify/issues)
pt_br: **Verificação do contrato - Sourcify** &nbsp; ![](images/pi-sourcify.png) &nbsp; <br>Verifique contratos e obtenha contratos verificados <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/source-verificer/profile.json): sourcify <br>[Documentação](https://docs.sourcify.dev/docs/intro/) <br>[Abra uma issue](https://github.com/sourcifyeth/remix-sourcify/issues)

source: **Cookbook.dev - Find any contract** &nbsp; ![](images/cookbook.svg)<br> Find any smart contract, build your project faster. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins/cookbook.dev): cookbook.dev <br>[Website](https://www.cookbook.dev) <br>[Documentation](https://github.com/Breakthrough-Labs/cookbook-remix-plugin) <br>[Make an issue](https://github.com/Breakthrough-Labs/cookbook-remix-plugin/issues)
pt_br: **Cookbook.dev - Encontre qualquer contrato** &nbsp; ![](images/cookbook.svg)<br> Encontre qualquer contrato inteligente e construa seu projeto rapidamente. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/tree/master/plugins/cookbook.dev): cookbook.dev <br>[Website](https://www.cookbook.dev) <br>[Documentation](https://github.com/Breakthrough-Labs/cookbook-remix-plugin) <br>[Abra uma issue](https://github.com/Breakthrough-Labs/cookbook-remix-plugin/issues)

source: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> The Defi Explorer loads the Uniswap V2 Protocol into the File Explorers. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentation](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Make an issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)
pt_br: **Defi Explorer** &nbsp; ![](images/pi-defi-exp.png) &nbsp; <br> O Defi Explorer carrega o protocolo Uniswap V2 nos Exploradores de Arquivos. <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-explorer/profile.json): defiexplorer <br>[Documentação](https://remix-defi-explorer-plugin.readthedocs.io/en/latest/) <br>[Abra uma issue](https://github.com/Machinalabs/remix-defi-explorer-plugin/issues)

source: **Defi Tutorials** &nbsp; (main panel) &nbsp; ![](images/pi-defi-tut.png) <br> Learn about UMA. This plugin works with the UMA tutorials plugin. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)
pt_br: **Defi Tutoriais** &nbsp; (painel principal) &nbsp; ![](images/pi-defi-tut.png) <br> Aprenda sobre protocolo UMA. Este plugin funciona com o plugin de tutoriais UMA. <br>[Nome do perfil](https://github. om/ethereum/remix-plugins-directory/blob/master/plugins/defi-tutorials/profile.json): defiTutoriais <br>[Abra uma issue](https://github.com/Machinalabs/remix-defi-tutorials-plugin/issues)

source: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Version Control <br> Clone repos from github & create GIT repos & use standard git commands. Also export/import to IPFS. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentation](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Make an issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)
pt_br: **DGIT** &nbsp; ![](images/pi-dgit.png) &nbsp; Controle de Versão <br> Clone repos do github & crie repos do GIT & use comandos padrão do git. Também exportar/importar para o IPFS. <br>[nome do perfil](https://github, om/ethereum/remix-plugins-directory/blob/master/plugins/dgit/profile.json): dgit <br>[Documentação](https://github.com/bunsenstraat/remix-storage-plugin) <br>[Abra uma issue](https://github.com/bunsenstraat/remix-storage-plugin/issues)

source: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Deploy & interact with smart contracts to the Klaytn public network, local klaytn nodes. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentation](https://github.com/klaytn-ozys/plug-and-klay) <br>[Make an issue](https://github.com/klaytn-ozys/plug-and-klay/issues)
pt_br: **Klaytn** &nbsp; ![](images/pi-klaytn.png) <br>Deploy e interaja com contratos inteligentes para a rede pública Klaytn, nós locais klaytn. <br>[nome do perfil](https://github. om/ethereum/remix-plugins-directory/blob/master/plugins/klaytn/profile.json): klaytn-remix-plugin <br>[Documentação](https://github.com/klaytn-ozys/plug-and-klay) <br>[Abra uma issue](https://github.com/klaytn-ozys/plug-and-klay/issues)

source: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Remix & Solidity Tutorials <br>Tutorials that contain quizzes that teach users Solidity and Remix features. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentation](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Make an issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)
pt_br: **Learneth** &nbsp; ![](images/pi-learneth.png) &nbsp; Tutoriais Remix & Solidity <br>que contêm testes que ensinam recursos de Solidity e Remix. <br>[nome do perfil](https://github. om/ethereum/remix-plugins-directory/blob/master/plugins/learneth/profile.json): learnEth <br>[Documentação](https://remix-learneth-plugin.readthedocs.io/en/latest/index.html) <br>[Abra uma issue](https://github.com/bunsenstraat/remix-learneth-plugin/issues)

source: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon is a language that reads like a legal contract and compile into Solidity (and then bytecode). This plugin allows you to take Lexon code and to <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentation](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Make an issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)
pt_br: **Lexon** &nbsp; ![](images/pi-lexon.png) &nbsp; <br>Lexon é um idioma que lê como um contrato 'tradicional' e compila para Solidity (e então bytecode). Este plugin permite que você leve o código Lexon para <br>[Nome do perfil](https://github. om/ethereum/remix-plugins-directory/blob/master/plugins/lexon/profile.json): lexon <br>[Documentação](https://gitlab.com/lexon-foundation/lexon-remix) <br>[Abra uma issue](https://gitlab.com/lexon-foundation/lexon-remix/-/issues)

source: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compile and Deploy to the Moonbeam network <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentation](https://github.com/purestake/moonbeam-remix-plugin) <br>[Make an issue](https://github.com/PureStake/moonbeam-remix-plugin/issues)
pt_br: **Moonbeam** &nbsp; ![](images/pi-moonbeam.png) <br>Compile e Deploy para a rede Moonbeam <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/moonbeam/profile.json): moonbeam-remix-plugin <br>[Documentação](https://github.com/purestake/moonbeam-remix-plugin) <br>[Faça um problema](https://github.com/PureStake/moonbeam-remix-plugin/issues)

source: **Mythx Security Verification** &nbsp; ![](images/pi-mythx.png) <br>Free version and paid version for Mythx analysis. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentation](https://docs.mythx.io/tools-integrations/remix) <br>[Make an issue](https://github.com/aquiladev/remix-mythx-plugin/issues)
pt_br: **Verificação de segurança Mythx** &nbsp; ![](images/pi-mythx.png) <br>Versão paga ou gratuíta para analises do Mythx <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/mythx/profile.json): mythx <br>[Documentação](https://docs.mythx.io/tools-integrations/remix/) <br>[Abra uma issue](https://github.com/aquiladev/remix-mythx-plugin/issues)

source: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compile solidity contracts for the Nahmii network <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/nahmii/profile.json): nahmii-compiler <br>[Make an issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)
pt_br: **Nahmii compiler** &nbsp; ![](images/pi-moonbeam.png) <br>Compile contratos solidity para a rede Nahmii <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/nahmii/profile.json): nahmii-compiler <br>[Abra um issue](https://github.com/nahmii-community/remix-nahmii-compiler-plugin/issues)

source: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Makes a basic front end for your contract once it is deployed on a public testnet. [Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile.json): oneClickDapp <br>[Documentation](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Make an issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)
pt_br: **One Click Dapp** &nbsp; ![](images/pi-1click.png) <br>Faz um frontend básico para o seu contrato, uma vez que ele é implantado em uma rede de teste pública. [Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/one-click-dapp/profile. son): oneClickDapp <br>[Documentação](https://github.com/oneclickdapp/remix-plugin-one-click-dapp) <br>[Abra uma issue](https://github.com/oneclickdapp/remix-plugin-one-click-dapp/issues)

source: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compile contracts written in Cairo to Starknet <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/starknet-cairo1-compiler/profile.json): Starknet-cairo1-compiler <br>[Documentation](https://github.com/NethermindEth/starknet-remix-plugin) <br>[Make an issue](https://github.com/NethermindEth/starknet-remix-plugin/issues)
pt_br: **Starknet** &nbsp; ![](images/pi-starknet.png) &nbsp; <br>Compilação de contratos escritos no Cairo para Starknet <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/starknet-cairo1-compiler/profile.json): Starknet-cairo1-compiler <br>[Documentação](https://github.com/NethermindEth/starknet-remix-plugin) <br>[Abra uma issue](https://github.com/NethermindEth/starknet-remix-plugin/issues)

source: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verify Contracts. Import To Remix From your Tenderly project. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentation](https://docs.tenderly.co/monitoring/integrations#remix) <br>[Make an issue](/issues)
pt_br: **Tenderly** &nbsp; ![](images/pi-tenderly.png) <br>Verifique contratos. Importe ao Remix do seu projeto Tenderly <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/tenderly/profile.json): tenderly <br>[Documentação](https://docs.tenderly.co/monitoring/integrations#remix/) <br>[Abra uma issue](/issues)

source: **UMA Playground** &nbsp; (main panel) <br>Learn about the UMA protocol. This plugin is loaded from the DEFI Tutorial plugin. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Make an issue](https://github.com/Machinalabs/remix-uma-playground/issues)
pt_br: **UMA Playground** &nbsp; (painel principal) <br>Saiba mais sobre o protocolo UMA. Este plugin é carregado do plugin de Tutorial DEFI. <br>[nome do perfil](https://github. om/ethereum/remix-plugins-directory/blob/master/plugins/uma-playground/profile.json): umaPlayground <br>[Abra uma issue](https://github.com/Machinalabs/remix-uma-playground/issues)

source: **UMA Tutorials** &nbsp; (main panel) <br>This plugin is activated by the DEFI Tutorials <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutorials <br>[Make an issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)
pt_br: **Tutoriais do UMA** &nbsp; (painel principal) <br>Este plugin é ativado pelos Tutoriais do DEFI <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/uma-tutorials/profile.json): umaTutoriais <br>[Abra uma issue](https://github.com/Machinalabs/remix-uma-tutorials-plugin/issues)

source: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile vyper code using local or remote Vyper compiler. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentation](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Make an issue](https://github.com/GrandSchtroumpf/vyper-remix)
pt_br: **Vyper Compiler** &nbsp; ![](images/pi-vyper.png) &nbsp; <br>Compile código vyper usando compilador local ou remoto Vyper. <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/vyper/profile.json): vyper <br>[Documentação](https://github.com/GrandSchtroumpf/vyper-remix) <br>[Abra uma issue](https://github.com/GrandSchtroumpf/vyper-remix)

source: **Wallet Connect** &nbsp; (main panel) <br>Approve transactions on your mobile device <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Make an issue](https://github.com/yann300/remix-walletconnect/issues)
pt_br: **Wallet Connect** &nbsp; (painel principal) <br>Aprovar transações no seu dispositivo móvel <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/wallet-connect/profile.json): walletconnect <br>[Abra uma issue](https://github.com/yann300/remix-walletconnect/issues)

source: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates is a toolbox for zkSNARKs on Ethereum. <br>[Profile name](https://github.com/ethereum/remix-plugins-directory/blob/master/plugins/zokrates/profile.json): ZoKrates <br>[Documentation](https://zokrates.github.io/) <br>[Make an issue](https://github.com/Zokrates/zokrates-remix-plugin/issues)
pt_br: **Zokrates** &nbsp; ![](images/pi-zok.png) &nbsp; <br>ZoKrates é uma ferramenta para zkSNARKs no Ethereum. <br>[Nome do perfil](https://github.com/ethereum/remix-plugins-directory/blob/master/zokrates/profile.json): ZoKrates <br>[Documentação](https://zokrates.github.io/) <br>[Abra uma issue](https://github.com/Zokrates/zrates-remix-plugin/issues)
