Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/plugin_manager.po
Languages: pt_br, ru_ru

source: Plugin Manager
pt_br: Gerenciador de plugin
ru_ru: Менеджер плагинов

source: In Remix IDE you only load the functionality you need. Controlling which plugins are active or inactive happens in the **Plugin Manager**.
pt_br: No Remix IDE você só carrega a funcionalidade que você precisa. Controlar quais plugins estão ativos ou inativos acontece no **Gerenciador de Plugins**.
ru_ru: В Remix IDE Вы загружаете только ту функциональность, которая Вам необходима. Управление тем, какие плагины активны или неактивны, осуществляется в **Plugin Manager**.

source: This plugin architecture has made it possible to integrate tools made by the Remix team with tools made by external teams. This architecture also allows Remix or just parts of Remix to be integrated into other projects.
pt_br: Esta arquitetura de plugins tornou possível a integração de ferramentas feitas pela equipe do Remix com ferramentas feitas por equipes externas. Esta arquitetura também permite integrar Remix, ou apenas partes do Remix, em outros projetos.
ru_ru: Эта архитектура плагинов позволила интегрировать инструменты, созданные командой Ремикс, с инструментами, созданными внешними командами. Эта архитектура также позволяет интегрировать Remix или отдельные его части в другие проекты.

source: Manage permissions
pt_br: Gerenciar permissões
ru_ru: Управление разрешениями

source: When plugins need to access other plugins for their operation, a modal will appear to ask you for permission.
pt_br: Quando os plugins precisam acessar outros plugins para sua operação, um modal aparecerá para pedir permissão.
ru_ru: Когда плагинам для своей работы необходимо получить доступ к другим плагинам, появится модальное окно, запрашивающее у Вас разрешение.

source: Often, the same plugin will want to do the same action multiple times. So when granting permission, it's helpful to click the **Remember this choice** box. If you don't, you might get this modal repeatedly popping up.
pt_br: Frequentemente, o mesmo plugin vai querer fazer a mesma ação várias vezes. Então, ao conceder permissão, é útil clicar na caixa **Lembre-se dessa escolha**. Se você não selecionar, você pode ter essa janela aparecendo repetidamente.

source: View permissions
pt_br: Ver permissões
ru_ru: Просмотр разрешений

source: You can view the permissions that you have granted to plugins by clicking on the **Permissions** button at the bottom of the **Plugin Manager**.
pt_br: Você pode ver as permissões que você concedeu aos plugins clicando no botão **Permissões** na parte inferior do **Gerenciador de Plugins**.
ru_ru: Вы можете просмотреть разрешения, которые Вы предоставили плагинам, нажав на кнопку **Разрешения** в нижней части **Менеджера плагинов**.

source: A modal will appear like the one below where you can view and erase the granted permission.
pt_br: Um modal será exibido como o abaixo onde você pode visualizar e apagar a permissão concedida.
ru_ru: Появится модальное окно, как показано ниже, в котором Вы можете просмотреть и удалить предоставленное разрешение.

source: Plugin Devs: Load a local plugin
pt_br: Plugin Devs: Carregar um plugin local
ru_ru: Разработчики плагинов: Загрузка локального плагина

source: A plugin in development can be loaded into Remix IDE by clicking the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
pt_br: Um plugin em desenvolvimento pode ser carregado no Remix IDE clicando no link "Conectar a um plugin local" no topo do painel Gerenciador de Plugins.
ru_ru: Разрабатываемый плагин можно загрузить в Remix IDE, щелкнув на ссылке "Connect to a Local Plugin" в верхней части панели Plugin Manager.

source: To learn more about how to create your own plugin, go to [the README of remix-plugin repo](https://github.com/ethereum/remix-plugin).
pt_br: Para saber mais sobre como criar seu próprio plugin, vá para [README do repo remix-plugin](https://github.com/ethereum/remix-plugin).
ru_ru: Чтобы узнать больше о том, как создать свой собственный плагин, обратитесь к [README репо remix-plugin](https://github.com/ethereum/remix-plugin).

source: Often, the same plugin will want to do the same action multiple times. So when granting permission, its helpful to click the **Remember this choice** box. If you don't, you might get this modal repeatedly popping up.
ru_ru: Часто один и тот же плагин хочет выполнить одно и то же действие несколько раз. Поэтому при предоставлении разрешения полезно щелкнуть на поле **Запомнить этот выбор**. Если Вы этого не сделаете, то у Вас может неоднократно появляться это модальное окно.
