Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remixd.po
Languages: pt_br, ru_ru

source: Remixd: Access your Local Filesystem
pt_br: Remixd: Acesse seu sistema de arquivos locais
ru_ru: Remixd: Доступ к Вашей локальной файловой системе

source: npm version
pt_br: versão do npm
ru_ru: версия npm

source: To give the Remix IDE (the web app) access to a folder on your computer, you need to use **Remixd** - the plugin along with **remixd** - the cli/npm module.
pt_br: Para dar ao Remix IDE (o aplicativo web) acesso a uma pasta no seu computador, você precisa usar **Remixd** - o plugin junto com **remixd** - o módulo cli/npm.
ru_ru: Чтобы предоставить IDE Remix (веб-приложению) доступ к папке на Вашем компьютере, Вам необходимо использовать **Remixd** - плагин вместе с **remixd** - модулем cli/npm.

source: The **Remixd** plugin can be activated from the plugin manager or in the **File Explorer** - see the image below. The **connect to localhost** - will activate the **Remixd** plugin.
pt_br: O plugin **Remixd** pode ser ativado no gerenciador de plugins ou no **Explorador de Arquivos** - veja a imagem abaixo. O **conectar ao localhost** - ativará o plugin **Remixd**.
ru_ru: Плагин **Remixd** может быть активирован из менеджера плагинов или в **File Explorer** - см. рисунок ниже. Команда **connect to localhost** - активирует плагин **Remixd**.

source: Once you click **connect to localhost** or activate Remixd from the **Plugin Manager**, a modal will come up:
pt_br: Quando você clicar em **conectar ao localhost** ou ativar Remixd do **Gerenciador de Plugins**, um modal será criado:
ru_ru: Как только Вы нажмете **подключиться к localhost** или активируете Remixd из **Менеджера плагинов**, появится модальное окно:

source: The Remixd plugin is a **websocket plugin** and it has no UI other than this modal dialog box - so you won't see a Remixd icon in the icon panel.
pt_br: O plugin Remixd é um **plugin de websocket** e não tem outra interface do usuário além desta caixa de diálogo modal - então você não verá um ícone Remixd no painel de ícone.
ru_ru: Плагин Remixd - это **плагин вебсокета**, и у него нет никакого пользовательского интерфейса, кроме этого модального диалогового окна - поэтому Вы не увидите значка Remixd на панели значков.

source: Before you hit **Connect**, you need to install the [remixd NPM module](https://www.npmjs.com/package/@remix-project/remixd) and run the **remixd** command.
pt_br: Antes de clicar em **Connect**, você precisa instalar o [módulo NPM remixd](https://www.npmjs.com/package/@remix-project/remixd) e executar o comando **remixd**.
ru_ru: Прежде чем нажать кнопку **Connect**, Вам необходимо установить [модуль remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) и выполнить команду **remixd**.

source: The code of `remixd` is [here](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .
pt_br: O código de `remixd` esta [aqui](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .
ru_ru: Код `remixd` - [here](https://github.com/ethereum/remix-project/tree/master/libs/remixd) .

source: remixd Installation
pt_br: Instalação remixd
ru_ru: remixd Установка

source: **remixd** is an NPM module and can be globally installed using the following command: `npm install -g @remix-project/remixd`
pt_br: **remixd** é um módulo NPM e pode ser instalado globalmente usando o seguinte comando: `npm install -g @remix-project/remixd`
ru_ru: **remixd** является модулем NPM и может быть глобально установлен с помощью следующей команды: `npm install -g @remix-project/remixd`.

source: Or just install it in the directory of your choice by removing the -g flag: `npm install @remix-project/remixd`
pt_br: Ou basta instalá-lo no diretório de sua escolha removendo a flag -g: `npm install @remix-project/remixd`
ru_ru: Или просто установите его в выбранную Вами директорию, убрав флаг -g: `npm install @remix-project/remixd`.

source: **NOTE:** When the remixd NPM module is installed, it also installs [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) and sets [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) to latest version i.e. 0.8.15 currently.
pt_br: **NOTA:** Quando o módulo NPM remixd está instalado, ele também instala [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) e define [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) para a última versão i.e. 0.8.15 atualmente.
ru_ru: **ПРИМЕЧАНИЕ:** Когда устанавливается модуль remixd NPM, он также устанавливает [Slither](https://github.com/crytic/slither), [solc-select](https://github.com/crytic/solc-select#quickstart) и устанавливает [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html) последней версии, т.е. 0.8.15 на данный момент.

source: **ALSO NOTE:** `Python3.6+ (pip3)` needs to already be installed on the System. (This packaging of Slither with the remixd module is supported since Remixd v0.6.3). In case of any discrepancy, Slither can also installed along with other dependencies using command `remixd -i slither`
pt_br: **TAMBÉM NOTA:** `Python3.6+ (pip3)` já precisa estar instalado no sistema. (Este pacote do Slither com o módulo remixd é suportado desde Remixd v0.6.3). Em caso de qualquer discrepância, Slither também pode ser instalado, juntamente com outras dependências, usando o comando `remixd -i slither`
ru_ru: **АЛКОГОЛЬНОЕ ПРИМЕЧАНИЕ:** `Python3.6+ (pip3)` должен быть уже установлен в системе. (Такая упаковка Slither с модулем remixd поддерживается начиная с Remixd v0.6.3). В случае какого-либо несоответствия Slither может быть установлен вместе с другими зависимостями с помощью команды `remixd -i slither`.

source: Find your version of remixd
pt_br: Encontre sua versão de remixd
ru_ru: Найдите свою версию remixd

source: The command: `remixd -v` or `remixd --version` will return your version number.
pt_br: O comando: `remixd -v` ou `remixd --version` retornará o número da sua versão.
ru_ru: Команда: `remixd -v` или `remixd --version` вернет номер Вашей версии.

source: **If this command does not work, then you have an outdated version!**
pt_br: **Se este comando não funcionar, então você tem uma versão desatualizada!**
ru_ru: **Если эта команда не работает, значит, у Вас устаревшая версия!

source: Update to the latest remixd
pt_br: Atualizar para a versão mais recente
ru_ru: Обновление до последней версии remixd

source: Because **remixd** creates a bridge from the browser to your local filesystem, it is important that you have the latest version of script.
pt_br: Como **remixd** cria uma ponte do navegador para seu sistema de arquivos local, é importante que você tenha a versão mais recente do script.
ru_ru: Поскольку **remixd** создает мост от браузера к Вашей локальной файловой системе, важно, чтобы у Вас была самая последняя версия скрипта.

source: For users who had installed the version of remixd from the **VERY** old NPM address or for users who do not know which NPM address they had installed it from, run these 2 steps:
pt_br: Para usuários que tinham instalado a versão de remixd do endereço NPM **MUITO** antigo ou para usuários que não sabem de qual endereço NPM eles tinham instalado, execute estes 2 passos:
ru_ru: Для пользователей, которые установили версию remixd с **ОЧЕНЬ** старого адреса NPM, или для пользователей, которые не знают, с какого адреса NPM они ее установили, выполните эти 2 шага:

source: uninstall the old one: **npm uninstall -g remixd**
pt_br: desinstale o antigo: **npm desinstale -g remixd**
ru_ru: Деинсталлируйте старый вариант: **npm uninstall -g remixd**.

source: install the new: **npm install -g @remix-project/remixd**
pt_br: instalar o novo: **npm install -g @remix-project/remixd**
ru_ru: Установите новое: **npm install -g @remix-project/remixd**.

source: **For Most Users** who know that they have a remixd version installed from @remix-project/remixd then just run:
pt_br: **Para a maioria dos usuários** que sabem que eles têm uma versão remixd instalada a partir do @remix-project/remixd e então apenas executar:
ru_ru: **Для большинства пользователей**, которые знают, что у них установлена версия remixd из @remix-project/remixd, тогда просто выполните ее:

source: remixd command
pt_br: comando remixd
ru_ru: команда remixd

source: The remixd command without options uses the terminal's current directory as the shared directory and the shared Remix domain will be `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org`, or `https://remix-beta.ethereum.org`
pt_br: O comando remixd sem opções usa o diretório atual do terminal como o diretório compartilhado e o domínio compartilhado de Remix serão `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org`, ou `https://remix-beta.ethereum.org`
ru_ru: Команда remixd без опций использует текущий каталог терминала в качестве общего каталога, а общим доменом Remix будет `https://remix.ethereum.org`, `https://remix-alpha.ethereum.org` или `https://remix-beta.ethereum.org`.

source: The remixd command is:<br> `remixd`
pt_br: O comando remixd é:<br> `remixd`
ru_ru: Команда remixd выглядит так:<br> `remixd`.

source: If you are using Remix from localhost or you are not running the command from your working directory, you'll need to use the command with flags.
pt_br: Se você estiver usando Remix de localhost ou você não estiver executando o comando do seu diretório de trabalho, você precisará usar o comando com flags.
ru_ru: Если Вы используете Remix с localhost или выполняете команду не из своего рабочего каталога, то Вам придется использовать команду с флагами.

source: remixd options
pt_br: opções de remixd
ru_ru: опции remixd

source: **NOTE**: `remixd -i slither` can be used to install Slither along with its dependencies
pt_br: **NOTA**: `remixd -i slither` pode ser usado para instalar o Slither juntamente com suas dependências
ru_ru: **ПРИМЕЧАНИЕ**: `remixd -i slither` может быть использован для установки Slither вместе с его зависимостями

source: HTTP vs HTTPS in the remixd command
pt_br: HTTP vs HTTPS no comando remixd
ru_ru: HTTP против HTTPS в команде remixd

source: If your browser is on https://remix.ethereum.org (**secure http**) then use https in the command:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`
pt_br: Se seu navegador estiver em https://remix.ethereum.org (**secure http**) e usar https no comando:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`
ru_ru: Если Ваш браузер находится на https://remix.ethereum.org (**secure http**), то используйте https в команде:<br> `remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org`.

source: Or if you are using **http** in the browser, then use **http** in the remixd command.
pt_br: Ou se você estiver usando **http** no navegador, então use **http** no comando remixd.
ru_ru: Или, если Вы используете **http** в браузере, то используйте **http** в команде remixd.

source: Read/Write permission & Read-only mode
pt_br: Permissão de leitura/gravação e modo somente leitura
ru_ru: Разрешение на чтение/запись и режим "только чтение

source: The folder is shared using **a websocket connection** between `Remix IDE` and `remixd`.
pt_br: A pasta é compartilhada usando **uma conexão de websocket** entre `Remix IDE` e `remixd`.
ru_ru: Общий доступ к папке осуществляется с помощью **соединения через веб-сокет** между `Remix IDE` и `remixd`.

source: Be sure the user executing `remixd` has read/write permission on the folder.
pt_br: Certifique-se de que o usuário executando `remixd` tem permissão de leitura/gravação na pasta.
ru_ru: Убедитесь, что пользователь, выполняющий `remixd`, имеет права чтения/записи на папку.

source: Alternatively, there is an option to run remixd in read-only mode, use `--read-only` flag.
pt_br: Alternativamente, há uma opção para executar remixd em modo somente leitura, use a flag `--read-only`.
ru_ru: В качестве альтернативы существует возможность запуска remixd в режиме "только для чтения", используйте флаг `--read-only`.

source: Ports Usage
pt_br: Uso de Portas
ru_ru: Использование портов

source: `remixd` functions by making websocket connections with Remix IDE on different ports. Ports are defined according to specific purpose. Port usage details are as:
pt_br: Funções `remixd` fazendo conexões websocket com Remix IDE em diferentes portas. Portas são definidas de acordo com uma finalidade específica. Detalhes do uso da porta são como:
ru_ru: `remixd` функционирует, устанавливая websocket-соединения с Remix IDE на различных портах. Порты определяются в зависимости от конкретного назначения. Подробности использования портов следующие:

source: **65520** : For `remixd` websocket listener, to share local file system with Remix IDE. Shared folder will be loaded in the Remix IDE `File Explorers` workspace named `localhost`
pt_br: **65520**: Para `remixd` websocket listener, compartilhar o sistema de arquivos locais com a Remix IDE. Pasta compartilhada será carregada no Remix IDE `File Explorers` espaço de trabalho chamado `localhost`
ru_ru: **65520** : Для веб-сокетного слушателя `remixd` необходимо предоставить общий доступ к локальной файловой системе с Remix IDE. Общая папка будет загружена в рабочую область Remix IDE `File Explorers` с именем `localhost`.

source: **65522** : For `hardhat` websocket listener, to enable the Hardhat Compilation using Remix IDE `Solidity Compiler` plugin, if shared folder is a Hardhat project.
pt_br: **65522**: Para o ouvinte de websocket `hardhat`, habilitar a Compilação Hardhat usando o plugin Remix IDE `Solidity Compiler`, se a pasta compartilhada for um projeto Hardhat.
ru_ru: **65522** : Для веб-сокетного слушателя `hardhat` необходимо включить компиляцию Hardhat с помощью плагина Remix IDE `Solidity Compiler`, если общая папка является проектом Hardhat.

source: **65523** : For `slither` websocket listener, to enable the Slither Analysis using Remix IDE `Solidity Static Analysis` plugin
pt_br: **65523** : Para o websocket `slither`, ative o Slither Analysis usando o plugin Remix IDE `Solidity Static Analysis`
ru_ru: **65523** : Для веб-сокетного слушателя `slither` включить Slither Analysis с помощью плагина Remix IDE `Solidity Static Analysis`.

source: **65524** : For `truffle` websocket listener, to enable the Truffle Compilation using Remix IDE `Solidity Compiler` plugin, if shared folder is a Truffle project.
pt_br: **65524**: Para o websocket `truffle`, habilitar a Compilação Truffle usando o plugin Remix IDE `Solidity Compiler`, se a pasta compartilhada for um projeto Truffle.
ru_ru: **65524** : Для веб-сокетного слушателя `truffle` необходимо включить компиляцию Truffle с помощью плагина Remix IDE `Solidity Compiler`, если общая папка является проектом Truffle.

source: **Note:** Please make sure your system is secured enough and these ports are not opened nor forwarded.
pt_br: **Nota:** Por favor, certifique-se de que seu sistema está seguro o suficiente e essas portas não estão abertas nem encaminhadas.
ru_ru: **Примечание:** Пожалуйста, убедитесь, что Ваша система достаточно защищена и эти порты не открыты и не проброшены.

source: Warning!
pt_br: Atenção!
ru_ru: Внимание!

source: `remixd` **provides full read and write access** to the given folder **for any application** that can access the `TCP port 65520` on your local host.
pt_br: `remixd` **fornece acesso completo de leitura e gravação** à pasta informada **para qualquer aplicativo** que pode acessar a `porta TCP 65520` no seu host local.
ru_ru: `remixd` **предоставляет полный доступ на чтение и запись** к заданной папке **для любого приложения**, которое может получить доступ к `TCP-порту 65520` на Вашем локальном хосте.

source: To minimize the risk, Remixd can **ONLY** bridge between your filesystem and the Remix IDE URLS - including:
pt_br: Para minimizar o risco, Remixd pode ** SOMENTE ** ponte entre seu sistema de arquivos e o Remix IDE URLS - incluindo:
ru_ru: Чтобы минимизировать риск, Remixd может **ONLY** установить мост между Вашей файловой системой и URL-адресами Remix IDE - включая:

source: (the package:// urls in the list above are for remix desktop)
pt_br: (o pacote:// urls na lista acima são para o remix desktop)
ru_ru: (Урлы package:// в приведенном выше списке предназначены для remix desktop)

source: Clicking Connect on the modal.
pt_br: Clicando Conectar na modal.
ru_ru: Щелкните Connect в модальном окне.

source: Clicking on the **Connect** button on the Remixd modal (see the image above), will attempt to start a session where your browser can access the specified folder on your computer's filesystem.
pt_br: Clicando no botão **Conectar** no modal Remixd (veja a imagem acima), tentará iniciar uma sessão onde seu navegador pode acessar a pasta especificada no sistema de arquivos de seu computador.
ru_ru: Щелчок на кнопке **Подключиться** в модальном окне Remixd (см. рисунок выше) приведет к попытке начать сеанс, в котором Ваш браузер сможет получить доступ к указанной папке в файловой системе Вашего компьютера.

source: If you do not have `remixd` running in the background - another modal will open up and it will say:
pt_br: Se você não tem o `remixd` executando em segundo plano, outro modal irá abrir e dizer:
ru_ru: Если у Вас не запущен `remixd` в фоновом режиме - откроется другой модал, в котором будет написано:

source: Assuming you don't get the 2nd modal, your connection to the remixd daemon is successful. The shared folder will be visible in the File Explorer's workspace under **localhost**.
pt_br: Supondo que você não obtenha a segunda modal, sua conexão com o remixd daemon foi bem-sucedida. A pasta compartilhada será visível no espaço de trabalho do Explorador de Arquivos em **localhost**.
ru_ru: Если Вы не получили 2-го модального окна, значит, Ваше подключение к демону remixd прошло успешно. Общая папка будет видна в рабочей области File Explorer под **localhost**.

source: Creating & deleting folders & files
pt_br: Criar e excluir pastas e arquivos
ru_ru: Создание и удаление папок и файлов

source: Clicking on the **new folder** or **new file** icon under **localhost** will create a new file or folder in the shared folder. Similarly, if you **right click** on a file or folder you can **rename** or **delete** the file.
pt_br: Clicar no ícone de **nova pasta** ou **novo arquivo** em **localhost** irá criar um novo arquivo ou pasta na pasta compartilhada. Da mesma forma, se você clicar com o **botão direito** em um arquivo ou pasta, você poderá **renomear** ou **apagar** o arquivo.
ru_ru: Щелчок на пиктограмме **новая папка** или **новый файл** под **localhost** создаст новый файл или папку в общей папке. Аналогичным образом, если Вы **нажмете правой кнопкой мыши** на файле или папке, Вы сможете **переименовать** или **удалить** этот файл.

source: Closing a remixd session
pt_br: Encerrando uma sessão remixd
ru_ru: Закрытие remixd-сессии

source: In the terminal where **remixd** is running, typing `ctrl-c` will close the session. Remix IDE will then put up a modal saying that **remixd** has stopped running.
pt_br: No terminal onde **remixd** está sendo executado, digitar `ctrl-c` irá fechar a sessão. O Remix IDE então vai apresentar um modal dizendo que **remixd** parou de executar.
ru_ru: В терминале, где запущен **remixd**, наберите `ctrl-c`, чтобы закрыть сессию. После этого Remix IDE выведет модальное сообщение о том, что **remixd** прекратил работу.
