Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_tutorials_learneth.po
Languages: pt_br

source: Tutorials in Remix
pt_br: Tutoriais no Remix

source: **Learneth** is a tutorial platform integrated into Remix.
pt_br: **Learneth** é uma plataforma de tutorial integrada ao Remix.

source: Tutorials can contain quizzes for testing students' work. These quizzes are run by Solidity Unit Tests.
pt_br: Os tutoriais podem conter testes para testar o trabalho dos alunos. Esses testes são executados por Testes unitários de Solidity.

source: We have a growing set of tutorials on our repo- but anyone can build tutorials on their own repos and have their students load them up!
pt_br: Temos um conjunto crescente de tutoriais em nosso repositório, mas qualquer pessoa pode criar tutoriais em seus próprios repositórios e pedir que seus alunos os carreguem!

source: The tutorials contain .md files for instructions and can also contain example files, Solidity Unit Test files for quizzes, as well as answer files for quizzes.
pt_br: Os tutoriais contém arquivos .md para instruções e também podem conter arquivos de exemplo, arquivos de teste unitário para testes, bem como responder arquivos para testes.

source: Opening Learneth & associated links
pt_br: Abrindo links relacionados ao Learneth

source: Learneth is a plugin - so to access it, you need to activate the Learneth plugin in the Plugin Manager. Alternatively - this link will active it: click this link.
pt_br: Learneth é um plugin - para acessá-lo, é necessário ativar o plugin Learneth no Gerenciador de Plugins. Alternativamente - este link irá ativá-lo: clique neste link.

source: This link will activate Learneth and then will open a specific tutorial - in this case it will load the **proxy contract** tutorial:
pt_br: Este link ativará o Learneth e abrirá um tutorial específico - neste caso, ele carregará o tutorial do **contrato de proxy**:

source: **NOTE:** For other tricks about Remix URLs with parameters, go here: [locations](locations.html).
pt_br: **NOTA:** Para outros truques sobre URLs Remix com parâmetros, vá aqui: [locations](locations.html).

source: Learneth Tutorials
pt_br: Tutoriais do Learneth

source: Here is the current list of Learneth Tutorials
pt_br: Aqui está a lista atual de Tutoriais de Aprendizado

source: ***Beginner***
pt_br: ***Iniciante***

source: ***Intermediate***
pt_br: ***Intermediário***

source: ***Advanced***
pt_br: ***Avançado***

source: Learneth & Tutorial Repos
pt_br: Repos de Aprendizado e Tutorial

source: The code for the Learneth plugin is located here: https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst
pt_br: O código para o plugin Learneth está localizado aqui: https://github.com/bunsenstraat/remix-learneth-plugin/blob/master/docs/index.rst

source: Documentation for creating your own tutorials is located here: https://remix-learneth-plugin.readthedocs.io/en/latest/index.html
pt_br: Documentação para a criação de seus próprios tutoriais está localizada aqui: https://remix-learneth-plugin.readthedocs.io/en/latest/index.html

source: Remix maintains and curates this repo of Learneth tutorials: https://github.com/ethereum/remix-workshops
pt_br: Remix mantém e controla este repositório de tutoriais do Learneth: https://github.com/ethereum/remix-workshops
