Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_tutorials_github.po
Languages: ja_jp, pt_br

source: Remix Github Tutorials
ja_jp: Remix Githubチュートリアル
pt_br: Tutoriais Remix na Github

source: There are a series of tutorials in our github repo remix-workshops.
ja_jp: GitHubリポジトリのRemixワークショップには、一連のチュートリアルがあります。
pt_br: Existem vários tutoriais no nosso repositório de oficinas Remix na Github.

source: We are in the process of upgrading these tutorials to use the new Remix layout.
ja_jp: 新しいRemixレイアウトを使用するために、これらのチュートリアルをアップグレードしている段階にあります。
pt_br: Estamos trabalhando para atualizar esses tutoriais com o novo layout Remix.

source: In this repo there tutorials for all levels.
ja_jp: このリポジトリは、すべてのレベルが対象です。
pt_br: Existem tutoriais para todos os níveis no repositório.

source: There are tutorials for specific remix functionalities like:
ja_jp: 次のような特定のRemix機能に関するチュートリアルがあります:
pt_br: Existem tutoriais para funcionalidades específicas Remix como:

source: Deploying
ja_jp: デプロイ
pt_br: Implementação

source: Testing
ja_jp: テストを実行する
pt_br: Testes

source: Remix Plugin Development
ja_jp: Remixプラグイン開発
pt_br: Desenvolvimento de Plugins Remix

source: Other
ja_jp: その他
pt_br: Outros

source: Additional external workshops
ja_jp: さらなる外部ワークショップ
pt_br: Oficinas externas adicionais
