Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_*_code_viewer.po
Languages: ru_ru

source: Remix as code viewer
ru_ru: Ремикс как средство просмотра кода

source: Through Etherscan
ru_ru: Через Etherscan

source: Verified contracts on Etherscan can be viewed in Remix by making a simple change to the URL. Mostly for a mutiple part contract verification, Remix provides a quick way to load all the contracts.
ru_ru: Проверенные контракты на Etherscan могут быть просмотрены в Remix путем простого изменения URL. В основном для проверки контрактов, состоящих из нескольких частей, Remix предоставляет быстрый способ загрузки всех контрактов.

source: A typical Etherscan URL for a contract address looks like this:
ru_ru: Типичный URL-адрес Etherscan для контрактного адреса выглядит следующим образом:

source: In the URL, change `etherscan.io` to `remix.ethereum.org`
ru_ru: В URL измените `etherscan.io` на `remix.ethereum.org`.

source: and reload. It will fetch the contracts verified on Etherscan.
ru_ru: и перезагрузите. В результате будут получены контракты, проверенные на Etherscan.

source: Contracts verified on Ethereum mainnnet and on other test networks (Ropsten, Rinkeby, Kovan & Goerli) will be loaded in respective directories under `etherscan-code-sample` workspace.
ru_ru: Контракты, проверенные в основной сети Ethereum и в других тестовых сетях (Ropsten, Rinkeby, Kovan & Goerli), будут загружены в соответствующие директории в рабочем пространстве `etherscan-code-sample`.

source: Tihs works for Etherscan testnet URLs `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` etc. If they are similarly updated, contracts will be loaded in Remix.
ru_ru: Tihs работает для URL-адресов Etherscan testnet `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` и т.д. Если они аналогичным образом обновляются, контракты будут загружены в Remix.

source: Through GitHub
ru_ru: Через GitHub

source: Solidity files in GitHub can be loaded on Remix with a similar tweak. For a file with URL like:
ru_ru: Файлы Solidity на GitHub могут быть загружены в Remix с помощью аналогичной настройки. Для файла с URL-адресом вида:

source: change `github.com` to `remix.ethereum.org` like:
ru_ru: Измените `github.com` на `remix.ethereum.org`, например:

source: and reload. It will open the same file in Remix IDE.
ru_ru: и перезагрузите. Это откроет тот же файл в Remix IDE.
