Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run.po
Languages: pt_br, ru_ru

source: Deploy & Run
pt_br: Implantar & Executar
ru_ru: Развертывание и запуск

source: ![](images/a-run-icon.png) The Deploy & Run module is for sending transactions to the current **Environment**.
pt_br: ![](images/a-run-icon.png) O módulo Implantar e Executar é para o envio de transações para o **Ambiente** atual.
ru_ru: ![](images/a-run-icon.png) Модуль Deploy & Run предназначен для отправки транзакций в текущее **окружение**.

source: For deploying, you need to have a contract compiled. To check that there is a compiled contract, find the <b>CONTRACT</b> select box (which is under the VALUE input field), you can use this module.
pt_br: Para implantação, você precisa ter um contrato compilado. Para verificar se há um contrato compilado, encontre a caixa de seleção <b>CONTRACT</b> (que está sob o campo de entrada VALUE), você pode usar este módulo.
ru_ru: Для развертывания Вам необходимо иметь скомпилированный контракт. Чтобы проверить наличие скомпилированного контракта, найдите поле выбора <b>CONTRACT</b> (которое находится под полем ввода VALUE), Вы можете использовать этот модуль.

source: If nothing is there, you need to compile a file. If you do not see the contract you want, you need to select a contract in the editor to make it active.
pt_br: Se não houver nada, será necessário compilar um arquivo. Se você não vê o contrato que deseja, você precisa selecionar um contrato no editor para torná-lo ativo.
ru_ru: Если там ничего нет, то Вам необходимо скомпилировать файл. Если Вы не видите нужного контракта, Вам необходимо выбрать контракт в редакторе, чтобы сделать его активным.

source: Environment
pt_br: Ambiente
ru_ru: Окружающая среда

source: `Remix VM (Merge)` : Connects to a sandbox blockchain in the browser. The Remix VM (previously called JavaScript VM) is its own "blockchain" and on each reload the old chain will be cleared and a new blockchain will be started. **The old one will not be saved**. Merge refers to the fork of Ethereum when the Merge occurred. This fork is also known as the **Paris** fork.
pt_br: `Remix VM (Merge)`: Conecta-se a uma blockchain sandbox no navegador. A Remix VM (anteriormente chamada JavaScript VM) é sua própria "blockchain" e, em cada recarga, a antiga cadeia será limpa e uma nova blockchain será iniciada. **O antigo não será salvo**. Mesclagem se refere ao fork do Ethereum quando a Mesclagem ocorreu. Este fork também é conhecido como o fork **Paris**.
ru_ru: `Remix VM (Merge)` : Подключается к блокчейну-песочнице в браузере. Remix VM (ранее называвшаяся JavaScript VM) является собственным "блокчейном", и при каждой перезагрузке старая цепочка будет очищена, и будет запущен новый блокчейн. **Старая цепочка не сохраняется**. Merge относится к развилке Ethereum, когда произошло слияние. Эта развилка также известна как **Парижская** развилка.

source: `Remix VM (London)` : Same as above except this chain is using the London fork of Ethereum.
pt_br: `Remix VM (Londres)` : O mesmo que acima, exceto esta cadeia está usando o fork London da Ethereum.
ru_ru: `Remix VM (London)` : То же самое, что и выше, за исключением того, что эта цепочка использует лондонский форк Ethereum.

source: `Remix VM (Berlin)` : Same as above except this chain is using the Berlin fork of Ethereum.
pt_br: `Remix VM (Berlin)`: O mesmo que acima, exceto esta cadeia está usando o fork Berlim do Ethereum.
ru_ru: `Remix VM (Berlin)` : То же самое, что и выше, за исключением того, что эта цепочка использует берлинский форк Ethereum.

source: `Remix VM - Mainnet fork` : This will fork the Ethereum mainnet and will load it into the Remix VM. It is useful for developing contracts that need to access deployed mainnet contracts. (See below for more info about Forking)
pt_br: `Remix VM - Mainnet fork` : Isso fará fork do mainnet Ethereum e o carregará na Remix VM. É útil para o desenvolvimento de contratos que precisam acessar os contratos mainnet implementados. (Veja abaixo mais informações sobre Forking)
ru_ru: `Remix VM - Mainnet fork` : Это позволит форкнуть Ethereum mainnet и загрузить его в Remix VM. Это полезно для разработки контрактов, которым необходим доступ к развернутым контрактам основной сети. (См. ниже более подробную информацию о форках)

source: `Remix VM - Goerli fork` : Same as above except this forks the Goerli testnet. (See below for more info about Forking)
pt_br: `Remix VM - Goerli fork` : O mesmo que acima, exceto este fork da rede de teste Goerli. (Veja abaixo mais informações sobre o Forking)
ru_ru: `Remix VM - Goerli fork` : То же самое, что и выше, за исключением того, что это форк тестовой сети Goerli. (См. ниже более подробную информацию о форках)

source: `Remix VM - Sepolia fork` : Same as above except this forks the Sepolia testnet. (See below for more info about Forking)
pt_br: `Remix VM - Sepolia fork` : O mesmo que acima, exceto este fork da rede de teste da Sepolia. (Veja abaixo mais informações sobre o Forking)
ru_ru: `Remix VM - форк Sepolia` : То же самое, что и выше, за исключением форка тестовой сети Sepolia. (См. ниже более подробную информацию о форках)

source: `Remix VM - Custom fork` : Forks a chain, at block number, and in an EVM version of your choice. (See below for more info about Forking)
pt_br: `Remix VM - Fork personalizado` : Fork uma cadeia, no número do bloco e em uma versão EVM de sua escolha. (Veja abaixo mais informações sobre Forking)
ru_ru: `Remix VM - Custom fork` : Форкирует цепочку, с номером блока и в версии EVM по Вашему выбору. (Более подробную информацию о форках см. ниже)

source: `Injected Provider - provider name`: Connects Remix to an injected web3 provider. The most common injected provider is `Metamask`.
pt_br: `Provedor injetado - nome do provedor`: Conecta Remix a um provedor web3 injetado. O provedor injetado mais comum é `Metamask`.
ru_ru: `Injected Provider - имя провайдера`: Подключает Remix к инжектируемому провайдеру web3. Наиболее распространенным инжектируемым провайдером является `Metamask`.

source: `Custom - External HTTP Provider`: Remix will connect to a remote node. You will need to provide the URL to the selected provider: geth, parity or any Ethereum client. This was previously called **Web3 Provider**. (See below for more info about External HTTP Provider)
pt_br: `Personalizado - Provedor HTTP Externo`: Remix irá se conectar a um nó remoto. Você precisará fornecer a URL para o provedor selecionado: geth, besu ou qualquer cliente Ethereum. Isso foi anteriormente chamado de **Provedor Web3**. (Veja abaixo mais informações sobre o Provedor HTTP Externo)
ru_ru: `Custom - External HTTP Provider`: Ремикс будет подключаться к удаленному узлу. Вам необходимо предоставить URL-адрес выбранного провайдера: geth, parity или любого клиента Ethereum. Ранее эта опция называлась **Web3 Provider**. (Более подробную информацию о Внешнем HTTP-провайдере см. ниже)

source: `Dev - Hardhat Provider`: Connects Remix to a local Hardhat test chain.
pt_br: `Dev - Provedor de Hardhat`: Conecta Remix a uma cadeia de teste Hardhat local.
ru_ru: `Dev - Hardhat Provider`: Подключает Remix к локальной тестовой цепочке Hardhat.

source: `Dev - Ganache Provider`: Connects Remix to a local Truffle Ganache test chain.
pt_br: `Dev - Provedor de Ganache`: Conecta Remix a uma cadeia de teste do Truffle Ganache local.
ru_ru: `Dev - Ganache Provider`: Подключает Remix к локальной тестовой цепочке Truffle Ganache.

source: `Dev - Foundry Provider`: Connects Remix to a local Foundry Anvil test chain.
pt_br: `Dev - Provedor Foundry`: Conecta Remix a uma cadeia de teste Foundry Anvil local.
ru_ru: `Dev - Foundry Provider`: Подключает Remix к локальной тестовой цепочке Foundry Anvil.

source: `L2 - Optimism Provider`: Connects Remix to an Injected Provider (usually Metamask) with the settings for the mainnet of Optimism.
pt_br: `L2 - Provedor Optimism `: Conecta Remix a um Provedor injetado (geralmente Metamask) com as configurações para o mainnet Optimism.
ru_ru: `L2 - Optimism Provider`: Подключает Remix к инжектируемому провайдеру (обычно Metamask) с настройками для основной сети Optimism.

source: `L2 - Arbitrum One Provider`: Connects Remix to an Injected Provider (usually Metamask) with the settings for the Arbitrum One network.
pt_br: `L2 - Provedor Arbitrum One`: Conecta Remix a um Provedor Injetado (geralmente Metamask) com as configurações da rede Provedor.
ru_ru: `L2 - Arbitrum One Provider`: Подключает Remix к инжектируемому провайдеру (обычно Metamask) с настройками для сети Arbitrum One.

source: `WalletConnect`: Connects Remix to a wallet on a mobile device.
pt_br: `WalletConnect`: Conecta Remix a uma carteira em um dispositivo móvel.
ru_ru: `WalletConnect`: Подключите Ремикс к кошельку на мобильном устройстве.

source: Forking chains in Remix
pt_br: Realizando Forks no Remix
ru_ru: Вилочные цепи в Remix

source: Forking is a great technique for developing a contract that interacts with deployed contracts on a specific chain. By bringing in a chain to the Remix VM, you'll have the 10 accounts loaded with 100ETH.
pt_br: Forking é uma ótima técnica para o desenvolvimento de um contrato que interage com contratos implementados em uma cadeia específica. Ao trazer uma cadeia para o Remix VM, você terá as 10 contas carregadas com 100ETH.
ru_ru: Форкинг - это отличная техника для разработки контракта, который взаимодействует с развернутыми контрактами на определенной цепочке. Подключив цепочку к ВМ Remix, Вы получите 10 счетов, загруженных в 100ETH.

source: Careful though, if you refresh the browser, you’ll lose the forked chain.
pt_br: No entanto, cuidado. Se você atualizar o navegador, perderá a sua rede.
ru_ru: Однако будьте осторожны, если Вы обновите браузер, то потеряете цепочку развилок.

source: Custom Fork
pt_br: Fork personalizado
ru_ru: Пользовательская вилка

source: The Custom fork option allows you to specify a chain's RPC server, a block number, and an EVM version.
pt_br: A opção de fork personalizado permite especificar um servidor RPC de uma cadeia, um número de bloco e uma versão EVM.
ru_ru: Опция Custom fork позволяет Вам указать RPC-сервер цепочки, номер блока и версию EVM.

source: You can get the **Node URL** from chainlist.org. If the chain does not load, you may need to choose a different RPC server. You will also need to choose an EVM version appropriate to the block number. So, if you choose a very low block number, the EVM with the Merge “flavor” won’t work because this version of the EVM came out later.
pt_br: Você pode obter a **URL do Node** da chainlist.org. Se a cadeia não carregar, você pode precisar de escolher um servidor RPC diferente. Você também precisará escolher uma versão EVM apropriada para o número do bloco. Então, se você escolher um número de bloco muito baixo, o EVM com o "sabor" merge não funcionará porque esta versão do EVM foi lançada mais tarde.
ru_ru: Вы можете получить **Адрес узла** с сайта chainlist.org. Если цепочка не загружается, Вам может потребоваться выбрать другой RPC-сервер. Вам также потребуется выбрать версию EVM, соответствующую номеру блока. Так, если Вы выберете очень низкий номер блока, EVM с "изюминкой" Merge не будет работать, поскольку эта версия EVM вышла позже.

source: More about External HTTP Provider
pt_br: Mais sobre o provedor HTTP externo
ru_ru: Подробнее о Внешний HTTP-провайдер

source: If you are using Geth & https://remix.ethereum.org, please use the following Geth command to allow requests from Remix:
pt_br: Se você estiver usando Geth & https://remix.ethereum.org, use o seguinte comando Geth para permitir solicitações da Remix:
ru_ru: Если Вы используете Geth и https://remix.ethereum.org, пожалуйста, используйте следующую команду Geth для разрешения запросов из Remix:

source: Also see [Geth Docs about the http server](https://geth.ethereum.org/docs/rpc/server)
pt_br: Veja também [Geth Docs sobre o servidor http](https://geth.ethereum.org/docs/rpc/server)
ru_ru: Также смотрите [Geth Docs о http-сервере](https://geth.ethereum.org/docs/rpc/server).

source: To run Remix using https://remix.ethereum.org & a local test node, use this Geth command:
pt_br: Para executar Remix usando https://remix.ethereum.org e um nó de teste local, use este comando Geth:
ru_ru: Чтобы запустить Remix с помощью https://remix.ethereum.org и локального тестового узла, используйте эту команду Geth:

source: If you are using remix-alpha or a local version of remix - replace the url of the --http.corsdomain with the url of Remix that you are using.
pt_br: Se você estiver usando remix-alpha ou uma versão local do remix - substitua a url do --http.corsdomain com a url do Remix que você está usando.
ru_ru: Если Вы используете remix-alpha или локальную версию remix - замените url параметра --http.corsdomain на url используемого Вами Remix.

source: To run Remix Desktop & a local test node, use this Geth command:
pt_br: Para executar Remix usando e um nó de teste local, use este comando Geth:
ru_ru: Чтобы запустить Remix Desktop & локальный тестовый узел, используйте эту команду Geth:

source: Also see [Geth Docs on Dev mode](https://geth.ethereum.org/getting-started/dev-mode)
pt_br: Veja também [Geth Docs no modo dev](https://geth.ethereum.org/getting-started/dev-mode)
ru_ru: Также смотрите [Geth Docs on Dev mode](https://geth.ethereum.org/getting-started/dev-mode)

source: The Web3 Provider Endpoint for a local node is **http://localhost:8545**
pt_br: O provedor Web3 Endpoint para um nó local é **http://localhost:8545**
ru_ru: Конечная точка Web3 Provider Endpoint для локального узла - **http://localhost:8545**.

source: **WARNING:** Don't get lazy. It is a bad idea to use the Geth flag <b>--http.corsdomain</b> with a wildcard: `--http.corsdomain *`
pt_br: **AVISO:** Não fique com preguiça. É uma má ideia utilizar a bandeira Geth <b>--http.corsdomain</b> com um curinga: `--http.corsdomain *`
ru_ru: **ПРЕДУПРЕЖДЕНИЕ:** Не поленитесь. Плохая идея использовать флаг Geth <b>--http.corsdomain</b> с подстановочным знаком: `--http.corsdomain *`.

source: If you put the wildcard `*`, it means everyone can request the node. Whereas, if you put a URL, it restricts the urls to just that one - e.g. `--http.corsdomain 'https://remix-alpha.ethereum.org'`
pt_br: Se você colocar o curinga `*`, significa que todos podem solicitar o nó. Enquanto que se você colocar uma URL, ela restringe as URLs a apenas aquela - por exemplo, `--http.corsdomain 'https://remix-alpha.ethereum.org'`
ru_ru: Если Вы поместите подстановочный знак `*`, это означает, что каждый может запросить узел. В то время как, если Вы указываете URL, это ограничивает количество запросов только им - например, `--http.corsdomain 'https://remix-alpha.ethereum.org'`.

source: Only use `--http.corsdomain *` when using a **test chain** AND using only **test accounts**. For real accounts or on the mainchain **specify the url**.
pt_br: Use apenas `--http.corsdomain *` quando usar uma **cadeia de teste** E usando apenas **contas de teste**. Para contas reais ou no mainchain **especifique a URL**.
ru_ru: Используйте `--http.corsdomain *` только при использовании **тестовой цепочки** и при использовании только **тестовых счетов**. Для реальных счетов или на основной цепочке **укажите url**.

source: Account:
pt_br: Conta:
ru_ru: Счет:

source: Account: the list of accounts associated with the current environment (and their associated balances). On the Remix VM, you have a choice of 5 accounts. If using Injected Web3 with MetaMask, you need to change the account in MetaMask.
pt_br: Conta: a lista de contas associadas com o ambiente atual (e seus saldos associados). No Remix VM, você tem uma escolha de 5 contas. Se usar Injetado Web3 com MetaMask, você precisará alterar a conta no MetaMask.
ru_ru: Account: список учетных записей, связанных с текущей средой (и связанных с ними балансов). На ВМ Remix у Вас есть выбор из 5 учетных записей. Если Вы используете Injected Web3 с MetaMask, Вам необходимо изменить учетную запись в MetaMask.

source: Gas Limit:
pt_br: Limite de gas:
ru_ru: Предел газа:

source: This sets the maximum amount of gas that will be allowed for all the transactions created in Remix.
pt_br: Isto define a quantidade máxima de gás que será permitida para todas as transações criadas na Remix.
ru_ru: Здесь устанавливается максимальное количество газа, которое будет разрешено для всех транзакций, созданных в Remix.

source: Value:
pt_br: Valor:
ru_ru: Значение:

source: This sets the amount of ETH, WEI, GWEI etc that is sent to a contract or a payable function. <br> **Note:** payable functions have a red button.
pt_br: Isto define a quantidade de ETH, WEI ou GWEI que é enviado ao contrato ou a uma função "pagável". <br> **Nota** funções pagáveis tem um botão vermelho.
ru_ru: Здесь устанавливается количество ETH, WEI, GWEI и т.д., которое направляется на контракт или функцию выплаты. <br> **Примечание:** функции, подлежащие оплате, имеют красную кнопку.

source: The **Value** field is always reset to 0 after each transaction execution. <br> The **Value** field is **NOT** for gas.
pt_br: O campo **Valor** é sempre redefinido para 0 após cada execução da transação. <br> O campo **Valor** é **NÃO** para gás.
ru_ru: Поле **Value** всегда сбрасывается в 0 после каждого выполнения транзакции. <br> Поле **Value** является **NOT** для газа.

source: Deploy & AtAddress
pt_br: Implantação & Endereço
ru_ru: Развертывание & AtAddress

source: In the image above, the select box is set to **Ballot**. This select box will contain the list of compiled contracts.
pt_br: Na imagem acima, a caixa de seleção está definida como **Ballot**. Esta caixa de seleção irá conter a lista de contratos compilados.
ru_ru: На изображении выше поле выбора установлено на **Ballot**. Это поле выбора будет содержать список составленных контрактов.

source: `Deploy` sends a transaction that deploys the selected contract. When the transaction is mined, the newly created instance will be added (this might take several seconds). <br>**Note:** If the contract's constructor function has parameters, you need to specify them.
pt_br: `Implantar` envia uma transação que implementa o contrato selecionado. Quando a transação é executada e colocada em um bloco, a instância recém-criada será adicionada (isso pode levar vários segundos). <br>**Nota:** Se a função construtora do contrato tem parâmetros, você precisa especificá-los.
ru_ru: `Deploy` посылает транзакцию, которая развертывает выбранный контракт. Когда транзакция будет отработана, вновь созданный экземпляр будет добавлен (это может занять несколько секунд). <br>**Примечание:** Если функция-конструктор контракта имеет параметры, Вам необходимо указать их.

source: `At Address` is used to access a contract that has already been deployed. Because the contract is already deployed, accessing a contract with **AtAddress** does not cost gas.
pt_br: O `at Address` é usado para acessar um contrato que já foi implantado. Como o contrato já está implantado, acessar um contrato com **AtAddress** não custa gás.
ru_ru: `At Address` используется для доступа к контракту, который уже развернут. Поскольку контракт уже развернут, обращение к контракту с помощью **AtAddress** не требует затрат на газ.

source: **Note:** When using AtAddress, be sure you trust the contract at that address.
pt_br: **Nota:** Ao usar o AtAddress, certifique-se de que você confia no contrato nesse endereço.
ru_ru: **Примечание:** При использовании AtAddress убедитесь, что Вы доверяете контракту, заключенному по этому адресу.

source: To use **AtAddress**, you need to have the **source code** or **ABI** of the deployed contract **in the active tab** of the editor. When using the source code, it must be compiled with the same compilation settings as the deployed contract that you are trying access.
ru_ru: Чтобы использовать **AtAddress**, Вам необходимо иметь **исходный код** или **ABI** развернутого контракта **в активной вкладке** редактора. При использовании исходного кода он должен быть скомпилирован с теми же настройками компиляции, что и развернутый контракт, к которому Вы пытаетесь получить доступ.

source: Using the ABI with AtAddress
pt_br: Usando o ABI com AtAddress
ru_ru: Использование ABI с AtAddress

source: The **ABI** is a JSON array which describes the contract's interface.
pt_br: O **ABI** é uma matriz JSON que descreve a interface do contrato.
ru_ru: **ABI** - это массив JSON, который описывает интерфейс контракта.

source: To interact with a contract using the ABI, create a new file in Remix with extension ***.abi** and copy the ABI content to it.
pt_br: Para interagir com um contrato usando o ABI, crie um novo arquivo no Remix com a extensão ***.abi** e copie o conteúdo do ABI para ele.
ru_ru: Чтобы взаимодействовать с контрактом, используя ABI, создайте в Remix новый файл с расширением ***.abi** и скопируйте в него содержимое ABI.

source: Make sure this file is the active tab in the editor. Then, in the field next to `At Address`, input the contract's address and click on `At Address`. If successful, an instance of the contract will appear below - in the list of **Deployed Contracts**.
pt_br: Certifique-se de que este arquivo é a guia ativa no editor. Então, no campo ao lado de `No Endereço`, insira o endereço do contrato e clique em `No Endereço`. Se bem sucedido, uma instância do contrato irá aparecer abaixo - na lista de **Contratos de implantação**.
ru_ru: Убедитесь, что этот файл является активной вкладкой в редакторе. Затем в поле рядом с `At Address` введите адрес контракта и нажмите на `At Address`. В случае успеха экземпляр контракта появится ниже - в списке **Развернутые контракты**.

source: **Note:** To generate the ABI, in the Solidity compiler, after a contract is compiled, click on the **Compilation Details** button. A modal will come up with that contains the ABI among other info.
pt_br: **Nota:** Para gerar o ABI, no compilador Solidity, após a compilação de um contrato, clique no botão **Detalhes da Compilação**. Um modal irá apresentar que contêm, entre outras informações, o ABI.
ru_ru: **Примечание:** Чтобы сгенерировать ABI, в компиляторе Solidity после компиляции контракта щелкните на кнопке **Compilation Details**. Появится модальное окно, содержащее ABI среди прочей информации.

source: Pending Instances
pt_br: Instâncias pendentes
ru_ru: Отложенные инстанции

source: Validating a transaction takes several seconds. During this time, the GUI shows it in a pending mode. When the transaction is mined, the number of pending transactions is updated and the transaction is added to the log ([see terminal](terminal.html)).
pt_br: A validação de uma transação leva vários segundos. Durante este tempo, a GUI a mostra em um modo pendente. Quando a transação é minerada, o número de transações pendentes é atualizado e a transação é adicionada ao registro ([ver terminal](terminal.html)).
ru_ru: Валидация транзакции занимает несколько секунд. В течение этого времени графический интерфейс отображает ее в режиме ожидания. Когда транзакция будет отработана, количество отложенных транзакций обновится, и транзакция будет добавлена в журнал ([см. терминал](terminal.html)).

source: Using the Recorder
ru_ru: Использование магнитофона

source: The Recorder is a tool used to save a bunch of transactions in a JSON file and re-run them later either in the same environment or in another.
ru_ru: Recorder - это инструмент, используемый для сохранения набора транзакций в JSON-файле и повторного выполнения их позже либо в той же среде, либо в другой.
