Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run.po
Languages: pt_br, ru_ru

source: Saving to the JSON file ( by default its called scenario.json) allows one to easily check the transaction list, tweak input parameters, change linked library, etc...
ru_ru: Сохранение в JSON-файл (по умолчанию он называется scenario.json) позволяет легко проверить список транзакций, подправить входные параметры, изменить связанную библиотеку и т.д..

source: There are many use cases for the recorder.
ru_ru: Существует множество вариантов использования диктофона.

source: For instance:
pt_br: Por exemplo:
ru_ru: Например:

source: After having coded and tested contracts in a constrained environment (like the Remix VM), you could then change the environment and redeploy it to a more realistic environment like a public testnet or to a Geth node. By using the generated **scenario.json** file, you will be using all the same settings that you used in the Remix VM. And this means that you won't need to click the interface 100 times or whatever to get the state that you achieved originally. So the recorder could be a tool to protect your sanity.
ru_ru: После разработки и тестирования контрактов в ограниченной среде (например, в Remix VM), Вы можете изменить среду и развернуть ее в более реалистичной среде, например, в публичной тестовой сети или на узле Geth. Используя сгенерированный файл **scenario.json**, Вы будете применять все те же настройки, которые Вы использовали в Remix VM. А это означает, что Вам не нужно будет 100 раз нажимать на интерфейс или что-то еще, чтобы получить то состояние, которого Вы достигли изначально. Таким образом, рекордер может стать инструментом для защиты Вашего здравомыслия.

source: You can also change the settings in the scenario.json file to customize the playback.
ru_ru: Вы также можете изменить параметры в файле scenario.json, чтобы настроить воспроизведение.

source: Deploying contract does often require more than creating one transaction and so the recorder will automate this deployment.
ru_ru: Развертывание контракта часто требует большего, чем создание одной транзакции, поэтому регистратор автоматизирует это развертывание.

source: Working in a dev environment often requires setting up the state in a first place.
ru_ru: Работа в dev-среде часто требует в первую очередь настройки состояния.

source: When checked, the option `Run transactions using the last compilation result` allows you to develop a contract and easily set the state using **the latest compiled versions of the contracts.**
ru_ru: Если флажок установлен, опция `Запускать транзакции, используя последний результат компиляции` позволяет Вам разрабатывать контракт и легко устанавливать состояние, используя **последние скомпилированные версии контрактов.**.

source: To create this file in the recorder, you first of course need to have run some transactions. In the image above - it has a `0` next to **Transactions Recorded**. So this isn't the right moment to save transactions because - well because there aren't any. Each time you make a transaction, that number will increment. Then when you are ready, click the floppy disk icon and the scenario.json file will be created.
ru_ru: Чтобы создать этот файл в рекордере, Вам, конечно же, сначала нужно провести несколько транзакций. На изображении выше - рядом с **Transactions Recorded** стоит `0`. Таким образом, сейчас не самый подходящий момент для сохранения транзакций, потому что - ну, потому что их нет. Каждый раз, когда Вы совершаете транзакцию, это число будет увеличиваться. Затем, когда Вы будете готовы, щелкните на значке дискеты, и будет создан файл scenario.json.

source: The JSON file below is an example of the scenario.json file.
pt_br: O arquivo JSON abaixo é um exemplo do arquivo scenario.json.
ru_ru: Приведенный ниже JSON-файл является примером файла scenario.json.

source: In it, 3 transactions are executed:
pt_br: Nele, 3 transações são executadas:
ru_ru: В нем выполняются 3 транзакции:

source: The first corresponds to the deployment of the lib `testLib`.
pt_br: A primeira corresponde à implantação da biblioteca `testLib`.
ru_ru: Первый соответствует развертыванию библиотеки `testLib`.

source: The second corresponds to the deployment of the contract `test` with the first parameter of the constructor set to 11. That contract depends on a library. The linkage is done using the property `linkReferences`. In that case we use the address of the previously created library : `created{1512830014773}`. The number is the id (timestamp) of the transaction that led to the creation of the library.
pt_br: A segunda corresponde à implantação do contrato `test` com o primeiro parâmetro do construtor definido como 11. Esse contrato depende de uma biblioteca. O link é feito usando a propriedade `linkReferences`. Nesse caso nós usamos o endereço da biblioteca criada anteriormente: `criou{1512830014773}`. O número é o id (timestamp) da transação que levou à criação da biblioteca.
ru_ru: Второй соответствует развертыванию контракта `test` с первым параметром конструктора, установленным в значение 11. Этот контракт зависит от библиотеки. Связывание осуществляется с помощью свойства `linkReferences`. В этом случае мы используем адрес ранее созданной библиотеки : `created{1512830014773}`. Число - это id (временная метка) транзакции, которая привела к созданию библиотеки.

source: The third record corresponds to the call to the function `set` of the contract `test` (the property to is set to: `created{1512830015080}`) . Input parameters are `1` and `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`
pt_br: A terceira gravação corresponde à função `definir` do contrato `test` (a propriedade para é definida para: `criou{1512830015080}`). Parâmetros de entrada são `1` e `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`
ru_ru: Третья запись соответствует вызову функции `set` контракта `test` (свойство to установлено в: `created{1512830015080}`) . Входными параметрами являются `1` и `0xca35b7d915458ef540ade6068dfe2f44e8fa733c`.

source: All these transactions are created using the value of the accounts `account{0}`.
pt_br: Todas essas transações são criadas usando o valor das contas `conta{0}`.
ru_ru: Все эти транзакции создаются с использованием значения счетов `счет{0}`.

source: To use **AtAddress**, you need to have the **source code** or **ABI** of the deployed contract **in the active tab** of the editor. When using the source code, it must be compiled with the same compilation settings as the deployed contract that you are trying to access.
pt_br: Para usar **AtAddress**, você precisa ter o **código-fonte** ou **ABI** do contrato implantado **na guia ativa do editor**. Ao usar o código fonte, ele deve ser compilado com as mesmas configurações de compilação que o contrato implantado que você está tentando acessar.
