Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/run_proxy_contracts.po
Languages: ru_ru

source: Deploy & Run Proxy Contracts
ru_ru: Развертывание и запуск прокси-контрактов

source: Remix IDE has functionality to assist in the handeling of proxy contracts that use the UUPS pattern.
ru_ru: В Remix IDE имеется функциональность, помогающая в работе с прокси-контрактами, использующими шаблон UUPS.

source: A UUPS proxy contract is the implementation side of an [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).
ru_ru: Прокси-контракт UUPS - это сторона реализации [ERC1967Proxy](https://eips.ethereum.org/EIPS/eip-1967).

source: Once you have deployed a UUPS implementation contract, Remix will deploy a ERC1967 with your implementation contract's address.
ru_ru: После того, как Вы развернули контракт на внедрение UUPS, Remix развернет ERC1967 с адресом Вашего контракта на внедрение.

source: To interact with the functions in the **implementation contract**, use the deployed instance of the **ERC1967 instance** not on the implementation contract.
ru_ru: Для взаимодействия с функциями в **контракте реализации** используйте развернутый экземпляр **ERC1967** не на контракте реализации.

source: When its time to upgrade you contract, Remix has a UI for this.
ru_ru: Когда приходит время обновить Ваш контракт, в Remix есть пользовательский интерфейс для этого.

source: To try this out, you will need to get a proxy contract. Go to wizard.openzeppelin.com and select a contract. Then, in the Upgradeability section, check the UUPS option. Then, copy and paste the file into Remix. Compile the file and go to Deploy & Run.
ru_ru: Чтобы опробовать это, Вам необходимо получить прокси-контракт. Перейдите на wizard.openzeppelin.com и выберите контракт. Затем, в разделе Upgradeability, отметьте опцию UUPS. Затем скопируйте и вставьте этот файл в Remix. Скомпилируйте файл и перейдите в Deploy & Run.

source: Deploying
ru_ru: Развертывание

source: When a UUPS contract is selected in Deploy & Run's Contract select box, you'll see some checkboxes below the Deploy button:
ru_ru: Когда контракт UUPS выбран в поле выбора контрактов Deploy & Run, Вы увидите несколько флажков под кнопкой Deploy:

source: Check the box for **Deploy with Proxy**. This will create two transactions: one for the implementation (your contract) and the other for the ERC1967 proxy contract. You will get two modals to check through:
ru_ru: Установите флажок в поле **Deploy with Proxy**. Это создаст две транзакции: одну для реализации (Вашего контракта) и другую для прокси-контракта ERC1967. Вы получите два модала для проверки:

source: and then
ru_ru: а затем

source: If you are deploying to the **Remix VM**, these modals will appear one after the other. If you are connected to the mainnet or a public testnet, then the second modal will appear after the first transaction has gone through.
ru_ru: Если Вы выполняете развертывание на **Remix VM**, то эти модалы будут появляться один за другим. Если Вы подключены к основной сети или публичной тестовой сети, то второе модальное окно появится после того, как пройдет первая транзакция.

source: After the ERC1967 proxy contract is deployed, in the Deployed Contracts section, you'll see two deployed instances.
ru_ru: После развертывания контракта прокси ERC1967 в разделе Развернутые контракты Вы увидите два развернутых экземпляра.

source: To interact with your implementation contract **DO NOT** use the instance of your contract. Instead, you should **use the ERC1967 Proxy**. The proxy will have all the functions of your implementation.
ru_ru: Для взаимодействия с Вашим контрактом реализации **НЕ** используйте экземпляр Вашего контракта. Вместо этого Вам следует **использовать прокси-сервер ERC1967**. Прокси будет обладать всеми функциями Вашей реализации.

source: Upgrading
ru_ru: Обновление

source: To upgrade, check the Upgrade with Proxy box and dial down the caret to see the options:
ru_ru: Для обновления установите флажок Upgrade with Proxy и наберите вниз каретку, чтобы увидеть опции:

source: You'll either need to use the last deployed ERC1967 contract, or input the address of the ERC1967 contract that you want to use.
ru_ru: Вам нужно будет либо использовать последний развернутый контракт ERC1967, либо ввести адрес контракта ERC1967, который Вы хотите использовать.
