Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/running_js_scripts.po
Languages: ru_ru

source: Running Scripts
ru_ru: Выполнение сценариев

source: _JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions._
ru_ru: _JavaScript (JS) - это легкий, интерпретируемый или только что скомпилированный язык программирования с первоклассными функциями._

source: Remix IDE supports execution of JS scripts.
ru_ru: Remix IDE поддерживает выполнение JS-скриптов.

source: Write & Run a script
ru_ru: Написать и запустить скрипт

source: Create a file with `.js` extension and put your logic inside it. Once ready, there are two ways to run this script:
ru_ru: Создайте файл с расширением `.js` и поместите в него Вашу логику. После того, как скрипт готов, его можно запустить двумя способами:

source: Make the script the active file in the editor and run `remix.exeCurrent()` from Remix terminal
ru_ru: Сделайте скрипт активным файлом в редакторе и запустите `remix.exeCurrent()` из терминала Remix

source: Just right click on the script name in the `Files Explorers` plugin and click on the **Run** option. **ShortCut**: `Ctrl+Shift+S` when the script is displayed in the editor.
ru_ru: Просто щелкните правой кнопкой мыши на имени скрипта в плагине `Files Explorers` и щелкните на опции **Run**. **ShortCut**: `Ctrl+Shift+S`, когда скрипт отображается в редакторе.

source: Here is a sample script:
ru_ru: Ниже приведен пример сценария:

source: Running it using one of options mentioned above will show result in Remix terminal
ru_ru: Запустив его с помощью одной из вышеуказанных опций, Вы увидите результат в терминале Remix

source: Why run JavaScript Scripts in Remix?
ru_ru: Зачем выполнять сценарии JavaScript в Ремиксе?

source: To mimic how the front-end of your dapp will use web3.js or ethers.js
ru_ru: Для имитации того, как front-end Вашей dapp будет использовать web3.js или ethers.js

source: To quickly deploy and interact with a bunch of instances of a contract without going through the Remix GUI.
ru_ru: Для быстрого развертывания и взаимодействия с кучей экземпляров контракта без использования графического интерфейса Remix.

source: To run some tests on a previous deployed contract.
ru_ru: Чтобы выполнить некоторые тесты на предыдущем развернутом контракте.

source: Script to deploy a contract
ru_ru: Сценарий для развертывания контракта

source: Remix accepts async/await scripts to run [web3.js](https://web3js.readthedocs.io/) or [ethers.js](https://docs.ethers.io/) commands. The script needs to be wrapped in a self executing function.
ru_ru: Remix принимает сценарии async/await для выполнения команд [web3.js](https://web3js.readthedocs.io/) или [ethers.js](https://docs.ethers.io/). Сценарий должен быть обернут в самоисполняющуюся функцию.

source: Setup
ru_ru: Настройка

source: These scripts will need to access the contract's ABI. The ABI is located in the contract's metadata file. Make sure that this metadata file will be created by going to the **Settings** module and checking that the **Generate contract metadata** option is indeed **checked**.
ru_ru: Эти скрипты должны будут получить доступ к ABI контракта. ABI находится в файле метаданных контракта. Убедитесь, что этот файл метаданных будет создан, перейдя в модуль **Settings** и проверив, что опция **Generate contract metadata** действительно **отмечена**.

source: Compile a Solidity file - to generate the contract metadata.
ru_ru: Скомпилируйте файл Solidity - для генерации метаданных контракта.

source: In the Deploy & Run plugin, choose the Environment.
ru_ru: В плагине Deploy & Run выберите Environment.

source: Async/await scripts work on in all of the Environments: the Remix VM, Injected Provider (usually MetaMask), and External HTTP Provider.
ru_ru: Сценарии Async/await работают во всех окружениях: в Remix VM, в инжектируемом провайдере (обычно MetaMask) и во внешнем HTTP-провайдере.

source: JS Scripts in the File Explorers
ru_ru: JS-скрипты в Проводниках файлов

source: In the **scripts** folder of a **workspace**, there are 2 example files: one using **web3.js** and the other using **ethers.js**.
ru_ru: В папке **scripts** папки **workspace** находятся 2 файла примеров: один с использованием **web3.js**, а другой с использованием **ethers.js**.

source: Compile a contract and run a script on the fly
ru_ru: Компилируйте контракт и выполняйте скрипт на лету

source: It is often convenient when drafting a contract to run a script just after the compilation succeeded.
ru_ru: При составлении контракта часто бывает удобно запустить скрипт сразу после того, как компиляция прошла успешно.

source: That way one can quickly deploy and call several contracts in order to set them in a desired state for testing purpose.
ru_ru: Таким образом, можно быстро развернуть и вызвать несколько контрактов, чтобы установить их в нужное состояние для тестирования.

source: Also if the script contains Mocha tests, those will also be run.
ru_ru: Также, если скрипт содержит тесты Mocha, они также будут запущены.

source: In order to do so, add the NatSpec tag `@custom:dev-run-script` to the contract followed by the absolute file path, like:
ru_ru: Для этого добавьте в контракт тег NatSpec `@custom:dev-run-script`, за которым следует абсолютный путь к файлу, например:

source: **ShortCut**: `Ctrl+Shift+S` , when editing a solidity file, will compile that file and then will run the script. In contrast, Ctrl+S will only start the compiling.
ru_ru: **ShortCut**: `Ctrl+Shift+S`, при редактировании файла solidity, скомпилирует этот файл, а затем запустит скрипт. В отличие от этого, Ctrl+S только запустит компиляцию.

source: An Example Script
ru_ru: Пример сценария

source: The example below deploys a solidity contract named **CustomERC20.sol**. This example is using the web3.js library. Ethers.js could also be used.
ru_ru: В приведенном ниже примере развертывается контракт solidity с именем **CustomERC20.sol**. В этом примере используется библиотека web3.js. Можно также использовать библиотеку Ethers.js.

source: For more information about this example, please see: [running async/await scripts](https://medium.com/remix-ide/running-js-async-await-scripts-in-remix-ide-3115b5dd7687?source=friends_link&sk=04e650dfa65905fdab0ecd5b10513d41)
ru_ru: Более подробную информацию об этом примере см: [выполнение скриптов async/await](https://medium.com/remix-ide/running-js-async-await-scripts-in-remix-ide-3115b5dd7687?source=friends_link&sk=04e650dfa65905fdab0ecd5b10513d41)

source: For more script examples, please see [Frequently Asked Scripts](FAS.html).
ru_ru: Дополнительные примеры скриптов см. в разделе [Часто задаваемые скрипты](FAS.html).

source: `require` in scripts at Remix
ru_ru: `require` в скриптах в Remix

source: `require` statement is supported in a limited manner for Remix supported modules with Remix Scripts.
ru_ru: Оператор `require` ограниченно поддерживается для модулей, поддерживаемых Remix, с помощью Remix Scripts.

source: For now, modules supported by Remix are ethers, web3, swarmgw, chai, remix and hardhat only for hardhat.ethers object/plugin.
ru_ru: На данный момент модули, поддерживаемые Remix, - это ethers, web3, swarmgw, chai, remix и hardhat только для объекта/плагина hardhat.ethers.

source: For unsupported modules, this error `<module_name> module require is not supported by Remix IDE` will be shown.
ru_ru: Для неподдерживаемых модулей будет показана эта ошибка `<module_name> модуль require не поддерживается Remix IDE`.
