Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/security.po
Languages: ru_ru

source: Using Remix Safely
ru_ru: Безопасное использование Ремикса

source: It is dangerous to send transactions on contracts you don't understand (even if it's a get rich quick scheme that you've copied & pasted from a Discord DM or a youtube video and you really really want to get rich).
ru_ru: Опасно отправлять транзакции по контрактам, которых Вы не понимаете (даже если это схема быстрого обогащения, которую Вы скопировали и вставили из Discord DM или видео на youtube, и Вы действительно очень хотите разбогатеть).

source: Check our [article](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797) on a current scam promoting "liquidity front runner bots".
ru_ru: Ознакомьтесь с нашим сайтом [article](https://medium.com/remix-ide/remix-in-youtube-crypto-scams-71c338da32d?source=friends_link&sk=bb6efbbf88bc3e496611943d282ad797), посвященным текущей афере, рекламирующей "ботов-передовиков ликвидности".

source: Always check that you are loading Remix over HTTPS unless you have a specific reason for accessing it with HTTP (e.g. for using Remix locally or for a connection you trust).
ru_ru: Всегда проверяйте, что Вы загружаете Ремикс по протоколу HTTPS, если только у Вас нет особых причин для доступа к нему по протоколу HTTP (например, для использования Ремикса локально или для соединения, которому Вы доверяете).

source: Make sure all your imports include the **version number** otherwise you don't know what version of files you are getting and the builds are not reproducible.
ru_ru: Убедитесь, что все Ваши импортируемые файлы включают **номер версии**, иначе Вы не будете знать, какую версию файлов Вы получаете, и сборки не будут воспроизводиться.

source: So **do not** use an import like this:<br> `import "@openzeppelin/contracts/token/ERC20/ERC20.sol";`
ru_ru: Поэтому **не** используйте импорт, подобный этому:<br> `import "@openzeppelin/contracts/token/ERC20/ERC20.sol";`.

source: Rather, **use one** like this:<br> `import "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`
ru_ru: Скорее, **используйте один**, например, такой:<br> `import "@openzeppelin/contracts@4.7.3/token/ERC20/ERC20.sol";`.

source: When connecting a contract to an existing deployment, ensure that the thing you are connecting to is correct AND is the correct version.
ru_ru: При подключении контракта к существующему развертыванию убедитесь, что то, к чему Вы подключаетесь, правильно И имеет правильную версию.

source: Always be sure to address or understand every warning.
ru_ru: Всегда обращайте внимание на каждое предупреждение или понимайте его.

source: Remix is a subdomain of ethereum.org - so the only valid Remix urls are:
ru_ru: Remix является поддоменом сайта ethereum.org - поэтому единственными допустимыми адресами Remix являются:

source: If you are directed to some site that looks like Remix but has a **similar but different URL** - it is NOT Remix and is likely a scam.
ru_ru: Если Вы попали на сайт, похожий на Ремикс, но имеющий **подобный, но другой URL** - это НЕ Ремикс и, скорее всего, мошенничество.

source: Remix's ease makes its users a target
ru_ru: Простота Remix делает его пользователей мишенью

source: Because Remix has no setup, it has a large community of noobies to smart contract development. This is great, but it provides a target audience for scammers exploit. Without Remix, the scammers would first need to instruct victims to set up a local dev environment, which would severely limit the success rate of the scam.
ru_ru: Так как в Remix нет настроек, в нем есть большое сообщество новичков в разработке смарт-контрактов. Это замечательно, но это дает целевую аудиторию для мошенников. Если бы не было Remix, мошенники должны были бы сначала проинструктировать жертв о том, как установить локальную среду разработки, что значительно ограничило бы успех мошенничества.

source: **Scams lose their effectiveness when potential victims are educated about scams and about how to read and understand code. Learn Solidity and learn it well!**
ru_ru: **Мошенничество теряет свою эффективность, когда потенциальные жертвы получают знания о мошенничестве и о том, как читать и понимать код. Изучайте Solidity и изучайте его хорошо!

source: For Solidity Tutorials in Remix, go to the LearnEth plugin.
ru_ru: Для получения учебников по Solidity в Remix перейдите к плагину LearnEth.
