Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/settings.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: To get to **Settings** click the gear at the very bottom of the icon panel.
ru_ru: Чтобы перейти к **Настройкам**, щелкните на шестеренке в самом низу панели пиктограмм.

source: Reset Button
ru_ru: Кнопка сброса

source: The Reset button at the top of the Setting panel will reset all of the settings back to the default.
ru_ru: Кнопка Сброс, расположенная в верхней части панели настроек, вернет все настройки к значениям по умолчанию.

source: General Settings
ru_ru: Общие настройки

source: Generate contract metadata is used for deploying with libraries. See our blog post on the subject: [Deploying with Libraries](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730)
ru_ru: Генерируемые метаданные контракта используются для развертывания с помощью библиотек. См. запись в нашем блоге на эту тему: [Deploying with Libraries](https://medium.com/remix-ide/deploying-with-libraries-on-remix-ide-24f5f7423b60?sk=68f9c2bf318e85e129e46fe44683a730)

source: Always use Remix VM at Load: will make the Remix VM the selected **environment** when Remix loads.
ru_ru: Always use Remix VM at Load: сделает Remix VM выбранным **окружением** при загрузке Remix.

source: Text wrap: controls if the text in the editor should be wrapped.
ru_ru: Обертывание текста: контролирует, должен ли текст в редакторе быть обернут.

source: Personal mode: can be used when one is connecting to a **local node**. It is used to have Remix temporarily save the passphrase - so that you don't need to **unlock** the account in GETH. Remix will not persist the passphrase - so if you refresh your browser the passphrase will be gone.
ru_ru: Персональный режим: может использоваться при подключении к **локальному узлу**. Он используется для того, чтобы Remix временно сохранил парольную фразу - так, чтобы Вам не нужно было **разблокировать** учетную запись в GETH. Remix не будет сохранять кодовую фразу - поэтому, если Вы обновите браузер, кодовая фраза исчезнет.

source: Matomo Analytics: This is where you can turn off and on your approval for us to use Matomo. We do not collect any personally identifiable information (PII) and our reports are public. See our [blog post on the subject](https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).
ru_ru: Matomo Analytics: Здесь Вы можете отключить или включить свое согласие на использование нами Matomo. Мы не собираем никакой персонально идентифицируемой информации (PII), и наши отчеты являются общедоступными. См. нашу [запись в блоге на эту тему](https://medium.com/remix-ide/help-us-improve-remix-ide-66ef69e14931?source=friends_link&sk=cf9c62fbe1270543eb4bd912e567e2d6).

source: Github Access Token
ru_ru: Токен доступа Github

source: When performing Git operations on Github and when creating GISTs, it may be necessary to input an access token. This token has the specific permissions for your Git commands. Depending on the operation, you may also need to input your Github username & email address. Remix does not save your password info outside of your browser's localstorage. [https://github.com/settings/tokens](https://github.com/settings/tokens)
ru_ru: При выполнении операций Git на Github и при создании GIST может потребоваться ввести маркер доступа. Этот маркер имеет специальные разрешения для выполнения Ваших команд Git. В зависимости от операции, Вам также может потребоваться ввести Ваше имя пользователя и адрес электронной почты Github. Remix не сохраняет информацию о Вашем пароле за пределами локального хранилища Вашего браузера. [https://github.com/settings/tokens](https://github.com/settings/tokens)

source: Etherscan Access Token
ru_ru: Токен доступа Etherscan

source: You need to input your Etherscan access token when debugging verified contracts with the Remix Debugger. When verifying a contract with the Etherscan plugin, you need to put the API key in that plugin and not in the Settings panel.
ru_ru: Вам необходимо ввести Ваш токен доступа к Etherscan при отладке верифицированных контрактов с помощью Remix Debugger. При верификации контракта с помощью плагина Etherscan, Вам необходимо ввести ключ API в этот плагин, а не в панель Настройки.

source: Click [here](https://etherscan.io/myapikey) to get your Etherscan API key.
ru_ru: Щелкните [here](https://etherscan.io/myapikey), чтобы получить свой API-ключ Etherscan.

source: Swarm Settings
ru_ru: Настройки роя

source: In the Solidity Compiler, after the compilation is completed, there is a button to publish to Swarm.
ru_ru: В компиляторе Solidity после завершения компиляции есть кнопка для публикации в Swarm.

source: Without putting in an address & postage stamp, you'll be using the public gateway, which may not persist you content as surely as if you put in your own info.
ru_ru: Не указав адрес и почтовую марку, Вы будете использовать публичный шлюз, который, возможно, не будет предоставлять Вам контент с такой же уверенностью, как если бы Вы ввели свою собственную информацию.

source: IPFS Settings
ru_ru: Настройки IPFS

source: Just like the Swarm settings above, IPFS settings are for publishing your contracts to IPFS from the Solidity Compiler.
ru_ru: Как и настройки Swarm, описанные выше, настройки IPFS предназначены для публикации Ваших контрактов на IPFS из компилятора Solidity.

source: If you do not put in any settings here, you will be using the public INFURA node. This will not guarantee your data will persist.
ru_ru: Если Вы не введете здесь никаких настроек, то Вы будете использовать общедоступный узел INFURA. Это не гарантирует сохранность Ваших данных.

source: Other options are to:
ru_ru: Другими вариантами являются:

source: Use your own INFURA IPFS node. This requires a subscription. [Learn more](https://infura.io/product/ipfs)
ru_ru: Используйте собственный узел INFURA IPFS. Для этого требуется подписка. [Подробнее](https://infura.io/product/ipfs)

source: Use any external IPFS which doesn’t require any authentification.
ru_ru: Используйте любую внешнюю IPFS, которая не требует аутентификации.

source: Use your own local ipfs node (which usually runs under http://localhost:5001)
ru_ru: Используйте свой собственный локальный узел ipfs (который обычно работает под http://localhost:5001).

source: Themes
ru_ru: Темы

source: Choose themes here. The Dark & Light themes are the themes that the Remix team actively maintains.
ru_ru: Выберите темы здесь. Темы Dark & Light - это темы, которые активно поддерживаются командой Remix.
