Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/slither.po
Languages: ru_ru

source: _(Supported since Remix IDE v0.15.0 and Remixd v0.5.0)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.15.0 и Remixd v0.5.0)_.

source: Remixd and Slither
ru_ru: Remixd и Slither

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
ru_ru: **Примечание:** Если Вы раньше не использовали `remixd`, почитайте о нем подробнее [here](./remixd.html).

source: When [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module is installed, it also installs [Slither](https://github.com/crytic/slither) and [solc-select](https://github.com/crytic/solc-select#quickstart) and latest version of [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).
ru_ru: Когда устанавливается модуль [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd), он также устанавливает [Slither](https://github.com/crytic/slither) и [solc-select](https://github.com/crytic/solc-select#quickstart) и последнюю версию [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).

source: `Python3.6+ (pip3)` needs to already be installed on the System. In case of any discrepany, Slither can also installed along with other dependencies using command `remixd -i slither` _(This packaging of Slither with the remixd module is supported since Remixd `v0.6.3`)_
ru_ru: `Python3.6+ (pip3)` должен быть уже установлен в системе. В случае каких-либо несоответствий, Slither также может быть установлен вместе с другими зависимостями с помощью команды `remixd -i slither` _(Такая упаковка Slither с модулем remixd поддерживается начиная с Remixd `v0.6.3`)_.

source: when `remixd` is running locally on your device, an additional websocket plugin will be listening on port `65523` which will be dedicated for Slither integration. (Supported since Remixd `v0.5.0`)
ru_ru: Когда `remixd` запущен локально на Вашем устройстве, дополнительный плагин websocket будет прослушивать порт `65523`, который будет выделен для интеграции Slither. (Поддерживается начиная с Remixd `v0.5.0`)

source: The remixd Slither listener is a websocket plugin similar to remixd and is used to perform Slither analysis with Remix IDE.
ru_ru: Слушатель remixd Slither - это плагин для websocket, аналогичный remixd, и используется для выполнения Slither-анализа с помощью Remix IDE.

source: Enable Slither Analysis
ru_ru: Включить анализ Slither

source: Prerequisites
ru_ru: Пререквизиты

source: To use Slither analysis with Remix IDE efficiently, following tools should be installed locally on the system:
ru_ru: Чтобы эффективно использовать Slither-анализ с Remix IDE, в системе должны быть локально установлены следующие инструменты:

source: There are setup with [remixd](https://www.npmjs.com/package/@remix-project/remixd) installation or can be done using `remixd -i slither` commmand.
ru_ru: Они настраиваются при установке [remixd](https://www.npmjs.com/package/@remix-project/remixd) или могут быть выполнены с помощью команды `remixd -i slither`.

source: How to use
ru_ru: Как использовать

source: If a project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Static Analysis` plugin with the label `Enable Slither Analysis`.
ru_ru: Если проект совместно используется через remixd и рабочее пространство `localhost` загружено в Remix IDE, то в плагине `Solidity Static Analysis` появится дополнительный флажок с надписью `Enable Slither Analysis`.

source: There is an info icon on the right side of the label which redirects to a specific section of Remix official documentation that explains how to use Slither Analysis and prerequisites for it.
ru_ru: В правой части ярлыка имеется информационная пиктограмма, которая перенаправляет на определенный раздел официальной документации Remix, в котором объясняется, как использовать Slither Analysis и необходимые для этого условия.

source: One can check the `Enable Slither Analysis` box to run the analysis using Slither along with the Remix's analysis library.
ru_ru: Можно установить флажок `Enable Slither Analysis`, чтобы запустить анализ, используя Slither вместе с библиотекой анализа Remix.

source: Latest report of Slither analysis will be stored locally on project root with a file named as `remix-slither-report.json`.
ru_ru: Последний отчет о результатах анализа Slither будет храниться локально в корне проекта в файле с именем `remix-slither-report.json`.

source: Slither Analysis report will also be displayed on the Remix IDE side after the Remix analysis report for better user readability.
ru_ru: Отчет Slither Analysis также будет отображаться на стороне Remix IDE после отчета Remix Analysis для лучшего восприятия пользователем.

source: The result of the analysis will be shown in the Remix IDE terminal
ru_ru: Результат анализа будет показан в терминале Remix IDE

source: and also in the **remixd** console.
ru_ru: а также в консоли **remixd**.

source: To only run Slither Analysis, deselect `Select all` checkbox and click on `Run`. Now it will show only the Slither Analysis report.
ru_ru: Чтобы запустить только Slither Analysis, снимите флажок `Выбрать все` и щелкните на `Запустить`. Теперь будет показан только отчет Slither Analysis.

source: By default, it doesn't show the warnings for external libraries like remix-tests.sol, hardhat/console.sol etc. To have a look on them, check the box with label `Show warnings for external libraries`.
ru_ru: По умолчанию он не показывает предупреждения для внешних библиотек, таких как remix-tests.sol, hardhat/console.sol и т.д. Чтобы посмотреть на них, установите флажок `Показывать предупреждения для внешних библиотек`.

source: More Details
ru_ru: Подробнее

source: Analysis for Slither is run using the version set in `Solidity Compiler` plugin on Remix IDE. Slither is a CLI tool and requires `solc` to run the analysis. Before running the analysis, Slither websocket plugin checks if current version of solc is same as the version set in Remix IDE.
ru_ru: Анализ для Slither выполняется с использованием версии, установленной в плагине `Solidity Compiler` на Remix IDE. Slither - это инструмент CLI, и для выполнения анализа ему требуется `solc`. Перед запуском анализа плагин Slither websocket проверяет, совпадает ли текущая версия solc с версией, установленной в Remix IDE.

source: If the compiler version set in Solidity Compiler is different from current version of solc installed locally, the Slither websocket plugin will update the `solc` to be the same as the required version `solc-select`.
ru_ru: Если версия компилятора, установленная в Solidity Compiler, отличается от текущей версии solc, установленной локально, плагин Slither websocket обновит `solc`, чтобы она соответствовала требуемой версии `solc-select`.

source: For example, if current `solc` version on the system is 0.8.4 and on the Remix IDE 0.8.6 is set, `remixd` logs explain remote solc version selection
ru_ru: Например, если текущая версия `solc` в системе - 0.8.4, а на Remix IDE установлена 0.8.6, `remixd` в журнале объяснит выбор версии удаленной solc

source: After successful analysis run:
ru_ru: После успешного выполнения анализа:
