Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/solidity_editor.po
Languages: ru_ru

source: Editor
ru_ru: Редактор

source: Remix uses the Monaco editor. This is the same editor used by VSCode.
ru_ru: Ремикс использует редактор Monaco. Это тот же редактор, который используется в VSCode.

source: Remix saves the current file every 5 seconds.
ru_ru: Remix сохраняет текущий файл каждые 5 секунд.

source: The Remix Editor will highlight keywords in Soldiity, JS, and TS.
ru_ru: Редактор Remix Editor выделит ключевые слова в Soldiity, JS и TS.

source: Editor displays information from other plugins
ru_ru: Редактор отображает информацию из других плагинов

source: The main purpose of the Editor is, of course, to edit code. But it also works with other plugins, notably, the Soldity Compiler and the Debugger.
ru_ru: Основное назначение Редактора - это, конечно же, редактирование кода. Но он также работает с другими подключаемыми модулями, в частности, с компилятором Soldity и отладчиком.

source: The Solidity Compiler will display warnings and errors in the Editor's gutter at the problematic line.
ru_ru: Компилятор Solidity отобразит предупреждения и ошибки в желобе редактора на проблемной строке.

source: Breakpoints for the Debugger are input in the Editor's gutter.
ru_ru: Точки останова для Отладчика вводятся в желоб Редактора.

source: When stepping through code in the Debugger, the relevant code will be highlighted in the Editor.
ru_ru: При прохождении кода в Отладчике соответствующий код будет выделен в Редакторе.

source: General Operations
ru_ru: Общие операции

source: Files are open as tabs. When there are too many tabs to display, scrolling with a mouse wheel will horizontally scroll the tabs.
ru_ru: Файлы открываются в виде вкладок. Если вкладок слишком много, прокрутка колесиком мыши приводит к горизонтальной прокрутке вкладок.

source: The Play button works on the active tab. If a Solidity file is active, clicking Play will compile it. If a TS or JS file is active, Play will run the script.
ru_ru: Кнопка Play работает на активной вкладке. Если активен файл Solidity, нажатие кнопки Play скомпилирует его. Если активен файл TS или JS, Play запустит скрипт.

source: The magnifying glass icons (+/-) on the top left corner are to increase/decrease the font size.
ru_ru: Значки лупы (+/-) в левом верхнем углу служат для увеличения/уменьшения размера шрифта.

source: The small type on the far right of the Editor is clickable to jump to a section.
ru_ru: Маленький шрифт в правой части Редактора можно щелкнуть, чтобы перейти к разделу.

source: The Editor and Script Runner support TypeScript, which means that you can write TypeScript, have some auto-completion, and run it straight from Remix. As stated above, there is syntax highlighting in TS.
ru_ru: Редактор и Script Runner поддерживают TypeScript, что означает, что Вы можете писать на TypeScript, иметь некоторое автозавершение и запускать его прямо из Ремикса. Как было сказано выше, в TS есть подсветка синтаксиса.

source: The default Workspace contains example TypeScript files.
ru_ru: Рабочая область по умолчанию содержит примеры файлов TypeScript.

source: Editor & Autocompile
ru_ru: Редактор и автокомпиляция

source: When autocompile is enabled (in the Settings panel), compilation will occur each time the current file is changed, or another file is selected.
ru_ru: Когда автокомпиляция включена (на панели Настройки), компиляция будет происходить каждый раз, когда текущий файл изменяется или выбирается другой файл.

source: Autocomplete
ru_ru: Автозаполнение

source: Autocompleting Solidity code happens when you start typing in the Editor. The Compiler will run in the background, and process any imports you have. You will see these imports appear in the .deps directory in the File Explorer.
ru_ru: Автокомпиляция кода Solidity происходит, когда Вы начинаете набирать текст в Редакторе. Компилятор будет работать в фоновом режиме и обрабатывать все имеющиеся у Вас импорты. Вы увидите, как эти импорты появятся в каталоге .deps в Проводнике файлов.

source: **Tip:** If you start with a Solidity file that contains errors, the Compiler might not be able to compile it. In that case, the Editor's autocomplete features will not fully work until after the file is successfully compiled. After that, autocomplete will work even if there are errors, but only for the elements the Compiler already understands. For example, if you add a new function in a file that contains errors, autocomplete will not be able to find that function because it can’t compile the file.
ru_ru: **Совет:** Если Вы начинаете работу с файлом Solidity, содержащим ошибки, компилятор может не скомпилировать его. В этом случае функции автозаполнения в Редакторе будут работать только после того, как файл будет успешно скомпилирован. После этого автозаполнение будет работать даже при наличии ошибок, но только для тех элементов, которые Компилятор уже понимает. Например, если Вы добавите новую функцию в файл, содержащий ошибки, автозаполнение не сможет найти эту функцию, поскольку не сможет скомпилировать файл.

source: Auto complete on imports
ru_ru: Автозавершение при импорте

source: The Editor's autocomplete will offer the option to bring in OpenZeppelin contracts, Uniswap contracts, and the paths to all the files in the current Workspace.
ru_ru: Автозаполнение редактора предложит возможность ввести контракты OpenZeppelin, контракты Uniswap, а также пути ко всем файлам в текущей рабочей области.

source: So, when choosing @openzeppelin, you’ll get this:
ru_ru: Таким образом, выбрав @openzeppelin, Вы получите следующее:

source: And the same with Uniswap:
ru_ru: И то же самое с Uniswap:

source: Errors and Warnings
ru_ru: Ошибки и предупреждения

source: You can tell the file was successfully compiled if no errors or warnings are displayed in the Editor. Errors are displayed using squiggly lines. A red line indicates an error, a yellow line is a warning.
ru_ru: Вы можете сказать, что файл был успешно скомпилирован, если в Редакторе не отображается никаких ошибок или предупреждений. Ошибки отображаются с помощью волнистых линий. Красная линия указывает на ошибку, желтая - на предупреждение.

source: Hovering over the squiggly line shows you the message from the Compiler.
ru_ru: При наведении курсора мыши на живую линию Вы увидите сообщение от Компилятора.

source: Tabs and the File Explorer will also will also display whether a file contains errors or warnings.
ru_ru: Вкладки и Проводник файлов также будут отображать, содержит ли файл ошибки или предупреждения.

source: Errors on Imported Files
ru_ru: Ошибки при импорте файлов

source: A file with errors in one of the files that it imports will also trigger an error in the Editor. Your main file might not compile, but you will see there is a problem immediately.
ru_ru: Файл, имеющий ошибки в одном из импортируемых им файлов, также вызовет ошибку в Редакторе. Ваш основной файл может не скомпилироваться, но Вы сразу же увидите, что есть проблема.

source: Hovering over an Error Number in the File Explorer
ru_ru: Наведение курсора на номер ошибки в Проводнике файлов

source: The number of errors in a file is also reported in the File Explorer. Hovering over the number, which indicates the amount of errors/warnings, will display the information from the Compiler.
ru_ru: Количество ошибок в файле также отображается в Проводнике файлов. Наведение курсора на число, указывающее количество ошибок/предупреждений, выведет на экран информацию из Компилятора.

source: Gas Estimates
ru_ru: Оценки газа

source: Gas estimates are displayed on the same line where a function is declared.
ru_ru: Оценки газа отображаются на той же строке, где объявлена функция.

source: Constructor gas estimates are also displayed, and consist of two components: creation cost and code deposit cost.
ru_ru: Также отображаются оценки газа конструктора, которые состоят из двух компонентов: стоимость создания и стоимость внесения кода.

source: Go to Definition and References
ru_ru: Перейти к разделу Определение и ссылки

source: Definitions
ru_ru: Определения

source: By right-clicking, you can go to a definition. You can also use the shortcut displayed.
ru_ru: Щелкнув правой кнопкой мыши, Вы можете перейти к определению. Вы также можете воспользоваться отображаемым ярлыком.

source: You can also right-click on the filename of an import statement and jump to that file.
ru_ru: Вы также можете щелкнуть правой кнопкой мыши на имени файла заявления об импорте и перейти к этому файлу.

source: You can also ‘peek’ at the definition inline in the Editor. You can then jump to a definition by double-clicking on the right hand side of the line.
ru_ru: Вы также можете "подсмотреть" определение в строке в Редакторе. Затем Вы можете перейти к определению, дважды щелкнув в правой части строки.

source: References
ru_ru: Ссылки

source: By right-clicking, you can display all the references. You can also use the shortcut displayed.
ru_ru: Щелкнув правой кнопкой мыши, Вы можете отобразить все ссылки. Вы также можете воспользоваться отображаемым ярлыком.

source: You can jump to a reference by double-clicking on the right hand side of the line.
ru_ru: Вы можете перейти к ссылке, дважды щелкнув на правой стороне строки.

source: Highlighted References
ru_ru: Выделенные ссылки

source: References are highlighted in the Editor.
ru_ru: Ссылки выделены в Редакторе.

source: Hovering
ru_ru: Парящий

source: When you hover over a term with a definition, the definition will pop up. Hovering over code that has triggered an error (underlined with a red squiggly line) will show the error message.
ru_ru: Когда Вы наводите курсор на термин с определением, на экране появляется его определение. При наведении курсора на код, вызвавший ошибку (подчеркнутую красной жирной линией), будет показано сообщение об ошибке.

source: Files with Errors turn Red
ru_ru: Файлы с ошибками становятся красными

source: When a file contains an error, its name will turn red, both in the File Explorer and on its tab at the top of the Editor.
ru_ru: Когда файл содержит ошибку, его имя станет красным как в Проводнике файлов, так и на его вкладке в верхней части Редактора.

source: More about the Editor updates in this article: Major Updates to Remix Editor
ru_ru: Подробнее об обновлениях редактора в этой статье: Основные обновления редактора Remix Editor
