Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/static_analysis.po
Languages: ru_ru

source: Solidity Analyzers
ru_ru: Анализаторы Solidity

source: Static code analysis is a process of debugging code by examining it without executing it.
ru_ru: Статический анализ кода - это процесс отладки кода путем его изучения без выполнения.

source: The `Solidity Analyzers` plugin gangs three analysis tools together to perform static analysis on Solidity smart contracts. Each tool checks for security vulnerabilities and bad development practices, among other issues. It can be activated from Remix `Plugin Manager`.
ru_ru: Плагин `Solidity Analyzers` объединяет три инструмента анализа для выполнения статического анализа смарт-контрактов Solidity. Каждый инструмент проверяет, в частности, уязвимости в системе безопасности и плохую практику разработки. Его можно активировать из Ремикс `Менеджера плагинов`.

source: `Solidity Analyzers` can also be loaded clicking on `Solidity` icon in the featured plugins section of Remix's home tab. This button loads the following plugins: Solidity Compiler, Solidity Unit Testing, and Static Analyzers.
ru_ru: `Solidity Analyzers` можно также загрузить, щелкнув на пиктограмме `Solidity` в разделе плагинов на главной вкладке Ремикса. Эта кнопка загружает следующие плагины: Solidity Compiler, Solidity Unit Testing и Static Analyzers.

source: `Solidity Analyzers` uses these tools:
ru_ru: `Solidity Analyzers` использует эти инструменты:

source: [Remix Analysis](#remix-analysis): a basic analysis tool
ru_ru: [Анализ ремиксов](#remix-analysis): базовый инструмент анализа

source: [Solhint linter](https://github.com/protofire/solhint#rules): a Solidity linter for code and style guide validations
ru_ru: [Solhint linter](https://github.com/protofire/solhint#rules): линтер Solidity для валидации кода и руководства по стилю

source: [Slither Static Analysis](https://github.com/crytic/slither#slither-the-solidity-source-analyzer): a comprehensive static analysis tool
ru_ru: [Slither Static Analysis](https://github.com/crytic/slither#slither-the-solidity-source-analyzer): комплексный инструмент статического анализа

source: **NOTE:** Slither can only be used when Remix is connected to the local computer's filesystem with [Remixd](remix.html).
ru_ru: **ПРИМЕЧАНИЕ:** Slither можно использовать только тогда, когда Remix подключен к файловой системе локального компьютера с помощью [Remixd](remix.html).

source: How to use
ru_ru: Как использовать

source: **A contract must be compiled before analysis can be run.**
ru_ru: **Контракт должен быть скомпилирован, прежде чем можно будет запустить анализ.**

source: At the top of the panel, check the tools that you want to use.
ru_ru: В верхней части панели отметьте те инструменты, которые Вы хотите использовать.

source: Errors & Warnings
ru_ru: Ошибки и предупреждения

source: By default, `Solidity Analyzers` will show both errors and warnings. The combined number of errors and warnings are shown in the badge in that tools tab.
ru_ru: По умолчанию `Solidity Analyzers` будет показывать как ошибки, так и предупреждения. Комбинированное количество ошибок и предупреждений отображается в значке на вкладке инструментов.

source: If you check `Hide warnings`, warnings will be hidden and you'll exclusively see the errors.
ru_ru: Если Вы установите флажок `Hide warnings`, предупреждения будут скрыты, и Вы будете видеть исключительно ошибки.

source: **NOTE:** Remix Analysis does not flag error - it only shows warnings so if you check `Hide warnings`, nothing will show in the Remix Analysis tab.
ru_ru: **ПРИМЕЧАНИЕ:** Remix Analysis не отмечает ошибки - он показывает только предупреждения, поэтому если Вы установите флажок `Скрыть предупреждения`, на вкладке Remix Analysis ничего не будет показано.

source: Warnings from external libraries
ru_ru: Предупреждения от внешних библиотек

source: By default, warnings from external libraries are not shown. If you check the box `Show warnings for external libraries`, the tools will also analyse the external libraries for warnings.
ru_ru: По умолчанию предупреждения от внешних библиотек не показываются. Если Вы установите флажок `Показывать предупреждения для внешних библиотек`, инструменты будут также анализировать внешние библиотеки на предмет предупреждений.

source: To run [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer) with this plugin, you need to connect Remix IDE to your filesystem with [Remixd](remix.html). Once Remixd is running, Slither is automatically loaded.
ru_ru: Чтобы запустить [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer) с этим плагином, Вам необходимо подключить Remix IDE к Вашей файловой системе с помощью [Remixd](remix.html). После запуска Remixd автоматически загружается Slither.

source: The [Solhint](https://github.com/protofire/solhint#rules) linter can be run without connecting Remix to your filesystem.
ru_ru: Линтер [Solhint](https://github.com/protofire/solhint#rules) может быть запущен без подключения Remix к Вашей файловой системе.

source: Remix Analysis
ru_ru: Анализ ремиксов

source: Remix Analysis has 4 categories: `Security`, `Gas & Economy`, `ERC` & `Miscellaneous`.
ru_ru: Ремикс Анализ имеет 4 категории: `Безопасность`, `Газ и экономика`, `ЭРК` и `Разное`.

source: Here is the list of modules under each category along with the example code which **should be avoided or used very carefully while development**:
ru_ru: Здесь приведен список модулей в каждой категории вместе с примерами кода, которые **следует избегать или использовать очень осторожно при разработке**:

source: Category: Security
ru_ru: Категория: Безопасность Безопасность

source: **Transaction origin: 'tx.origin' is used**
ru_ru: **Источник транзакции: используется 'tx.origin'**.

source: `tx.origin` is useful only in very exceptional cases. If you use it for authentication, you usually want to replace it by "msg.sender", because otherwise any contract you call can act on your behalf.
ru_ru: `tx.origin` полезен только в очень исключительных случаях. Если Вы используете его для аутентификации, Вы обычно хотите заменить его на "msg.sender", потому что в противном случае любой контракт, который Вы вызываете, может действовать от Вашего имени.

source: _Example:_
ru_ru: _Пример:_.

source: **Check effects: Potential reentrancy bugs**
ru_ru: **Проверьте эффекты: Потенциальные ошибки реентерабельности**.

source: Potential Violation of Checks-Effects-Interaction pattern can lead to re-entrancy vulnerability.
ru_ru: Потенциальное нарушение шаблона Checks-Effects-Interaction может привести к уязвимости re-entrancy.

source: **Inline assembly: Inline assembly used**
ru_ru: **Использованная сборка: Используется последовательная сборка**

source: Use of inline assembly is advised only in rare cases.
ru_ru: Использование поточной сборки рекомендуется только в редких случаях.

source: **Block timestamp: Semantics maybe unclear**
ru_ru: **Временная метка блока: Семантика может быть неясной**.

source: `now` does not mean current time. `now` is an alias for `block.timestamp`. `block.timestamp` can be influenced by miners to a certain degree, be careful.
ru_ru: `now` не означает текущее время. `now` - это псевдоним для `block.timestamp`. На `block.timestamp` в определенной степени могут влиять майнеры, будьте осторожны.

source: **Low level calls: Semantics maybe unclear**
ru_ru: **Вызовы низкого уровня: Семантика может быть неясной**.

source: Use of low level `call`, `callcode` or `delegatecall` should be avoided whenever possible. `send` does not throw an exception when not successful, make sure you deal with the failure case accordingly. Use `transfer` whenever failure of the ether transfer should rollback the whole transaction.
ru_ru: По возможности следует избегать использования низкоуровневых `call`, `callcode` или `delegatecall`. Функция `send` не выбрасывает исключение в случае неудачи, убедитесь, что Вы соответствующим образом справляетесь со случаем неудачи. Используйте `transfer` во всех случаях, когда неудача при передаче эфира должна привести к откату всей транзакции.

source: **Blockhash usage: Semantics maybe unclear**
ru_ru: **Использование блокчейна: Семантика может быть неясной**.

source: `blockhash` is used to access the last 256 block hashes. A miner computes the block hash by "summing up" the information in the current block mined. By summing up the information in a clever way a miner can try to influence the outcome of a transaction in the current block.
ru_ru: `blockhash` используется для доступа к последним 256 хэшам блоков. Майнер вычисляет хэш блока путем "суммирования" информации в текущем добываемом блоке. Суммируя информацию хитрым способом, майнер может попытаться повлиять на исход транзакции в текущем блоке.

source: **Selfdestruct: Beware of caller contracts**
ru_ru: **Самоуничтожение: Остерегайтесь контрактов с абонентами**

source: `selfdestruct` can block calling contracts unexpectedly. Be especially careful if this contract is planned to be used by other contracts (i.e. library contracts, interactions). Selfdestruction of the callee contract can leave callers in an inoperable state.
ru_ru: `selfdestruct` может неожиданно заблокировать вызывающие контракты. Будьте особенно осторожны, если этот контракт планируется использовать другими контрактами (например, библиотечными контрактами, взаимодействиями). Самоуничтожение контракта-получателя может привести к тому, что вызывающие контракты окажутся в неработоспособном состоянии.

source: Category: Gas & Economy
ru_ru: Категория: Газ и экономика

source: **Gas costs: Too high gas requirement of functions**
ru_ru: **Затраты на газ: Слишком высокая потребность функций в газе**

source: If the gas requirement of a function is higher than the block gas limit, it cannot be executed. Please avoid loops in your functions or actions that modify large areas of storage
ru_ru: Если потребность функции в газе превышает предельное значение газа блока, она не может быть выполнена. Пожалуйста, избегайте циклов в Ваших функциях или действий, которые изменяют большие области хранения

source: **This on local calls: Invocation of local functions via 'this'**
ru_ru: **Вызов локальных функций: Вызов локальных функций через 'this'**.

source: Never use `this` to call functions in the same contract, it only consumes more gas than normal local calls.
ru_ru: Никогда не используйте `this` для вызова функций в том же контракте, это только потребляет больше газа, чем обычные локальные вызовы.

source: **Delete on dynamic Array: Use require/assert appropriately**
ru_ru: **Удаление на динамическом массиве: Используйте require/assert соответствующим образом**.

source: The `delete` operation when applied to a dynamically sized array in Solidity generates code to delete each of the elements contained. If the array is large, this operation can surpass the block gas limit and raise an OOG exception. Also nested dynamically sized objects can produce the same results.
ru_ru: Операция `delete` при применении к массиву динамического размера в Solidity генерирует код для удаления каждого из содержащихся в нем элементов. Если массив большой, то эта операция может превысить лимит блочного газа и вызвать исключение OOG. Кроме того, вложенные объекты динамического размера могут привести к тем же результатам.

source: **For loop over dynamic array: Iterations depend on dynamic array's size**
ru_ru: **Цикл над динамическим массивом: Итерации зависят от размера динамического массива**

source: Loops that do not have a fixed number of iterations, for example, loops that depend on storage values, have to be used carefully: Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can stall the complete contract at a certain point. Additionally, using unbounded loops can incur in a lot of avoidable gas costs. Carefully test how many items at maximum you can pass to such functions to make it successful.
ru_ru: Циклы, не имеющие фиксированного числа итераций, например, циклы, зависящие от значений хранилища, должны использоваться осторожно: Из-за ограничения количества газа в блоке транзакции могут потреблять только определенное количество газа. Количество итераций в цикле может вырасти за пределы лимита блочного газа, что может застопорить выполнение всего контракта в определенный момент. Кроме того, использование неограниченных циклов может привести к большим затратам газа, которых можно избежать. Тщательно проверьте, какое максимальное количество элементов Вы можете передать таким функциям, чтобы они были успешными.

source: **Ether transfer in loop: Transferring Ether in a for/while/do-while loop**
ru_ru: **Передача Эфира в цикле: Передача Эфира в цикле for/while/do-while**.

source: Ether payout should not be done in a loop. Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can cause the complete contract to be stalled at a certain point. If required, make sure that number of iterations are low and you trust each address involved.
ru_ru: Выплата Эфира не должна осуществляться в цикле. Из-за лимита блочного газа транзакции могут потреблять только определенное количество газа. Количество итераций в цикле может вырасти за пределы лимита блочного газа, что может привести к остановке всего контракта в определенный момент. Если необходимо, убедитесь, что количество итераций невелико, и Вы доверяете каждому задействованному адресу.

source: Category: ERC
ru_ru: Категория: ERC

source: **ERC20: 'decimals' should be 'uint8'**
ru_ru: **ERC20: 'decimals' должно быть 'uint8'**.

source: ERC20 Contracts `decimals` function should have `uint8` as return type.
ru_ru: ERC20 Контракты Функция `decimals` должна иметь в качестве возвращаемого типа `uint8`.

source: Category: Miscellaneous
ru_ru: Категория: Разное

source: **Constant/View/Pure functions: Potentially constant/view/pure functions**
ru_ru: **Потенциально константные/прозрачные/чистые функции: Потенциально константные/прозрачные/чистые функции**.

source: It warns for the methods which potentially should be constant/view/pure but are not.
ru_ru: Он предупреждает о методах, которые потенциально должны быть постоянными/видными/чистыми, но не являются таковыми.

source: **Similar variable names: Variable names are too similar**
ru_ru: **Схожие имена переменных: Имена переменных слишком похожи**.

source: It warns on the usage of similar variable names.
ru_ru: Это предупреждает об использовании одинаковых имен переменных.

source: **No return: Function with 'returns' not returning**
ru_ru: **Не возвращается: Функция с 'returns' не возвращается**.

source: It warns for the methods which define a return type but never explicitly return a value.
ru_ru: Он предупреждает о методах, которые определяют возвращаемый тип, но никогда не возвращают значение в явном виде.

source: **Guard conditions: Use 'require' and 'assert' appropriately**
ru_ru: **Охраняйте условия: Используйте 'require' и 'assert' соответствующим образом**.

source: Use `assert(x)` if you never ever want x to be false, not in any circumstance (apart from a bug in your code). Use `require(x)` if x can be false, due to e.g. invalid input or a failing external component.
ru_ru: Используйте `assert(x)`, если Вы никогда не хотите, чтобы x было ложным, ни при каких обстоятельствах (кроме ошибки в Вашем коде). Используйте `require(x)`, если x может быть ложным, например, из-за некорректного ввода или неработающего внешнего компонента.

source: **Result not used: The result of an operation not used**
ru_ru: **Результат не используется: Результат операции не используется**.

source: A binary operation yields a value that is not used in the following. This is often caused by confusing assignment (=) and comparison (==).
ru_ru: Бинарная операция дает значение, которое не используется в последующем. Это часто происходит из-за путаницы между присваиванием (=) и сравнением (==).

source: **String Length: Bytes length != String length**
ru_ru: **Длина строки: Длина байта != Длина строки**.

source: Bytes and string length are not the same since strings are assumed to be UTF-8 encoded (according to the ABI definition) therefore one character is not necessarily encoded in one byte of data.
ru_ru: Байт и длина строки - не одно и то же, поскольку предполагается, что строки кодируются в UTF-8 (в соответствии с определением ABI), поэтому один символ не обязательно кодируется в одном байте данных.

source: **Delete from dynamic array: 'delete' on an array leaves a gap**
ru_ru: **Удаление из динамического массива: 'delete' в массиве оставляет пробел**.

source: Using `delete` on an array leaves a gap. The length of the array remains the same. If you want to remove the empty position you need to shift items manually and update the length property.
ru_ru: Использование `delete` в массиве оставляет пробел. Длина массива остается неизменной. Если Вы хотите удалить пустую позицию, Вам необходимо вручную сдвинуть элементы и обновить свойство длины.

source: **Data Truncated: Division on int/uint values truncates the result**
ru_ru: **Данные усечены: Деление на int/uint-значения усекает результат**.

source: Division of integer values yields an integer value again. That means e.g. 10 / 100 = 0 instead of 0.1 since the result is an integer again. This does not hold for division of (only) literal values since those yield rational constants.
ru_ru: Деление целых значений дает снова целое значение. Это означает, что, например, 10 / 100 = 0 вместо 0.1, поскольку результат снова является целым числом. Это не относится к делению (только) буквенных значений, поскольку в этом случае получаются рациональные константы.

source: Remix-analyzer
ru_ru: Ремикс-анализатор

source: `remix-analyzer` is the library which works underneath the Remix Analysis tool.
ru_ru: `remix-analyzer` - это библиотека, которая работает под инструментом Remix Analysis.

source: `remix-analyzer` is an [NPM package](https://www.npmjs.com/package/@remix-project/remix-analyzer). It can be used as a library in a solution supporting node.js. Find more information about this type of usage in the [remix-analyzer repository](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
ru_ru: `remix-analyzer` - это [NPM-пакет](https://www.npmjs.com/package/@remix-project/remix-analyzer). Он может быть использован в качестве библиотеки в решении, поддерживающем node.js. Более подробную информацию об этом типе использования Вы найдете в репозитории [remix-analyzer](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use).
