Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/testing_using_Chai_&_Mocha.po
Languages: ru_ru

source: Testing using Chai & Mocha
ru_ru: Тестирование с использованием Chai & Mocha

source: _(Supported since Remix IDE v0.22.0)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.22.0)_.

source: Remix supports testing of your files in JavaScript using assertion library [Chai](https://www.chaijs.com/) & test framework [Mocha](https://mochajs.org/)
ru_ru: Remix поддерживает тестирование Ваших файлов на JavaScript с помощью библиотеки утверждений [Chai](https://www.chaijs.com/) и тестового фреймворка [Mocha](https://mochajs.org/).

source: _Chai is a BDD / TDD assertion library for node and the browser that can be delightfully paired with any javascript testing framework._
ru_ru: _Chai - это библиотека утверждений BDD / TDD для node и браузера, которая может быть восхитительно сопряжена с любым фреймворком тестирования javascript._

source: _Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun._
ru_ru: _Mocha - это многофункциональный JavaScript-фреймворк для тестирования, работающий на Node.js и в браузере, делающий асинхронное тестирование простым и увлекательным._

source: Write tests
ru_ru: Напишите тесты

source: Create a js file in your project workspace. Better to create it inside `scripts` folder. Lets name it `sample.test.js`.
ru_ru: Создайте js-файл в рабочей области Вашего проекта. Лучше создать его в папке `scripts`. Назовем его `sample.test.js`.

source: Write your tests in the file. Here is a sample:
ru_ru: Запишите в файл свои тесты. Вот пример:

source: Run tests
ru_ru: Выполните тесты

source: Once done with writing the tests, right click on file name in `File Explorers` plugin. It will show some options along with option to `Run`. This `Run` option is used to run the JS scripts
ru_ru: Когда Вы закончите написание тестов, щелкните правой кнопкой мыши на имени файла в плагине `File Explorers`. Появится несколько опций, а также опция `Run`. Эта опция `Run` используется для запуска JS-скриптов

source: Click on `Run`, tests will be executed and result will be shown on Terminal.
ru_ru: Щелкните на `Run`, тесты будут выполнены, и результат будет показан в терминале.

source: Test a contract
ru_ru: Тестирование контракта

source: Similarly unit tests can be written to test the functionality of a smart contract. An example to test default `1_Storage.sol` contract can be as:
ru_ru: Аналогичным образом можно написать модульные тесты для проверки функциональности смарт-контракта. Пример тестирования контракта по умолчанию `1_Storage.sol` может быть таким:

source: Result will be as:
ru_ru: Результат будет таким:

source: Debugging a test transaction
ru_ru: Отладка тестовой транзакции

source: To debug a transaction in one of the tests, print the transaction hash and input that in the [Remix Debugger plugin](https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).
ru_ru: Чтобы отладить транзакцию в одном из тестов, распечатайте хэш транзакции и введите его в плагин [Remix Debugger plugin](https://remix-ide.readthedocs.io/en/latest/tutorial_debug.html).

source: Hardhat-ethers support
ru_ru: Поддержка "каски-эфиры

source: Remix also supports methods of [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) plugin of Hardhat framework. Available methods under this plugin are:
ru_ru: Remix также поддерживает методы плагина [hardhat-ethers](https://hardhat.org/plugins/nomiclabs-hardhat-ethers.html#hardhat-ethers) фреймворка Hardhat. Доступными методами этого плагина являются:

source: With this, one can run the tests for a hardhat project easily using Remix.
ru_ru: Благодаря этому можно легко запустить тесты для проекта hardhat с помощью Remix.

source: Example to test `Storage` contract with this plugin methods can be as:
ru_ru: Пример тестирования контракта `Storage` с помощью методов этого плагина может быть таким:
