Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/truffle.po
Languages: ru_ru

source: Truffle
ru_ru: Трюфель

source: _(Supported since Remix IDE v0.23.0 and Remixd v0.6.0)_
ru_ru: _(Поддерживается начиная с Remix IDE v0.23.0 и Remixd v0.6.0)_.

source: Remixd and Truffle
ru_ru: Remixd и Truffle

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
ru_ru: **Примечание:** Если Вы раньше не использовали `remixd`, почитайте о нем подробнее [here](./remixd.html).

source: If `remixd` is running locally on your device and shared folder is a **Truffle project**, an additional websocket plugin will be listening on port `65524`. According to its documentation,
ru_ru: Если `remixd` запущен локально на Вашем устройстве, а общая папка является проектом **Truffle**, то дополнительный плагин websocket будет прослушивать порт `65524`. Согласно его документации,

source: _Truffle projects are projects with a truffle-config.js file._
ru_ru: _Truffle-проекты - это проекты с файлом truffle-config.js._.

source: Remixd looks for the `truffle-config.js` file in shared folder. If found, the Truffle websocket listener will run.
ru_ru: Remixd ищет файл `truffle-config.js` в общей папке. Если он найден, будет запущен веб-сокетный слушатель Truffle.

source: The Truffle websocket listener is a websocket plugin similar to `remixd` and is used to perform Truffle specific actions with Remix IDE.
ru_ru: Truffle websocket listener - это плагин для веб-сокетов, аналогичный `remixd`, который используется для выполнения специфических для Truffle действий с Remix IDE.

source: It doesn't need any separate installation as it is shipped with [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module.
ru_ru: Он не требует отдельной установки, поскольку поставляется с модулем [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd).

source: Enable Truffle Compilation
ru_ru: Включить компиляцию Трюфеля

source: Prerequisites
ru_ru: Пререквизиты

source: To use Truffle compilation with Remix IDE efficiently:
ru_ru: Для эффективного использования компиляции Truffle с Remix IDE:

source: **Truffle** should be installed locally on the system [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)
ru_ru: **Truffle** должен быть установлен локально в системе [https://trufflesuite.com/docs/truffle/getting-started/installation/](https://trufflesuite.com/docs/truffle/getting-started/installation/)

source: Shared folder should be a Truffle project containing `truffle-config.js`
ru_ru: В общей папке должен находиться проект Truffle, содержащий `truffle-config.js`.

source: `Remixd` Truffle websocket listener should be running at `65524`
ru_ru: `Remixd` Truffle websocket listener должен быть запущен по адресу `65524`.

source: How to use
ru_ru: Как использовать

source: If a truffle project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Compiler` plugin with the label `Enable Truffle Compilation`.
ru_ru: Если к проекту truffle открыт общий доступ через remixd и рабочее пространство `localhost` загружено в Remix IDE, в плагине `Solidity Compiler` появится дополнительный флажок с надписью `Enable Truffle Compilation`.

source: There is an info icon along side the label which redirects to a specific section of Remix official documentation that explains how to use Truffle compilation.
ru_ru: Рядом с ярлыком имеется информационная пиктограмма, которая перенаправляет на определенный раздел официальной документации Remix, объясняющий, как использовать компиляцию Truffle.

source: One can check the `Enable Truffle Compilation` box to run the compilation for Truffle along with the Remix using the compiler configuration in `Solidity Compiler` plugin.
ru_ru: Можно установить флажок `Enable Truffle Compilation`, чтобы запустить компиляцию для Truffle вместе с Remix, используя конфигурацию компилятора в плагине `Solidity Compiler`.

source: On clicking `Compile` button, a file named as `remix-compiler.config.js` will be created on the project root which will be storing compiler configuration set in Remix's `Solidity Compiler` plugin. It is passed to Truffle for compilation.
ru_ru: После нажатия кнопки `Compile` в корне проекта будет создан файл с именем `remix-compiler.config.js`, в котором будет храниться конфигурация компилятора, установленная в плагине Remix `Solidity Compiler`. Он передается в Truffle для компиляции.

source: The result of the compilation will be shown in the Remix IDE terminal
ru_ru: Результат компиляции будет показан в терминале Remix IDE

source: and also in the **remixd** terminal.
ru_ru: а также в терминале **remixd**.

source: Ganache Provider
ru_ru: Поставщик ганаша

source: _In Truffle, contracts are deployed by connecting to a built-in personal blockchain, i.e. Ganache. Read more about it in [Truffle documentation](https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_
ru_ru: _В Truffle контракты разворачиваются путем подключения к встроенному персональному блокчейну, т.е. Ganache. Подробнее об этом читайте в [документации Truffle](https://trufflesuite.com/docs/truffle/quickstart/#migrating-with-truffle-develop)_.

source: **Ganache Provider** is a plugin on Remix IDE which enables users to deploy the contract to the Truffle's built-in Ganache blockchain. `Ganache Provider` can be chosen from the list of environments in `Deploy & Run Transactions` plugin.
ru_ru: **Ganache Provider** - это плагин для Remix IDE, который позволяет пользователям развернуть контракт на встроенном в Truffle блокчейне Ganache. `Ganache Provider` может быть выбран из списка сред в плагине `Deploy & Run Transactions`.

source: As soon as you select `Ganache Provider`, a modal is opened asking for the `Ganache JSON-RPC Endpoint`.
ru_ru: Как только Вы выберете `Ganache Provider`, откроется модальное окно, запрашивающее `Ganache JSON-RPC Endpoint`.

source: If Ganache node is running with default options, the default endpoint value in modal will not need any change. In case, Ganache node host and port are different, JSON-RPC endpoint should be updated in the modal text box.
ru_ru: Если узел Ganache работает с опциями по умолчанию, то значение конечной точки по умолчанию в модальном окне менять не нужно. В случае, если хост и порт узла Ganache отличаются, конечная точка JSON-RPC должна быть обновлена в текстовом поле модального окна.

source: Once the correct endpoint is filled in the modal, just click on `OK` and the accounts from the Ganache node will be loaded in the `ACCOUNT` section. Network id will also be shown.
ru_ru: Как только в модальном окне будет заполнена правильная конечная точка, просто нажмите на `OK`, и учетные записи из узла Ganache будут загружены в раздел `ACCOUNT`. Также будет показан идентификатор сети.

source: Now, one can start deploying the contract from Remix IDE to the local Ganache node as usual.
ru_ru: Теперь можно приступить к развертыванию контракта из Remix IDE на локальном узле Ganache, как обычно.
