Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittesting.po
Languages: ru_ru

source: Unit Testing Plugin
ru_ru: Плагин Unit Testing Plugin

source: Click the ![](images/a-user-testing-icon.png) (double check) icon from icon bar to move to the `Solidity Unit Testing` plugin.
ru_ru: Щелкните на пиктограмме ![](images/a-user-testing-icon.png) (двойная проверка) из панели пиктограмм, чтобы перейти к плагину `Solidity Unit Testing`.

source: If you haven't used this plugin before and are not seeing `double check` icon, you have to activate it from Remix plugin manager.
ru_ru: Если Вы еще не использовали этот плагин и не видите значок `double check`, Вам необходимо активировать его в менеджере плагинов Remix.

source: Go to the plugin manager by clicking the ![](images/a-plug.png) (plug) icon and activate `Solidity Unit Testing` plugin.
ru_ru: Перейдите в менеджер плагинов, щелкнув на пиктограмме ![](images/a-plug.png) (плагин), и активируйте плагин `Solidity Unit Testing`.

source: Now `double check` icon will appear on the left side icon bar. Clicking on icon will load the plugin in the side panel.
ru_ru: Теперь на левой боковой панели пиктограмм появится значок `double check`. Щелчок по значку приведет к загрузке плагина в боковую панель.

source: <i>Alternatively, just select `Solidity` environment from Remix IDE `Home` tab. This will activate `Solidity Unit Testing` plugin along with `Solidity Compiler`, `Deploy & Run Transactions` & `Solidity Static Analysis` plugins.</i>
ru_ru: <i>В качестве альтернативы, просто выберите среду `Solidity` на вкладке `Home` среды Remix IDE. Это активирует плагин `Solidity Unit Testing`, а также плагины `Solidity Compiler`, `Deploy & Run Transactions` и `Solidity Static Analysis`.</i>

source: After successful loading, plugin looks like this:
ru_ru: После успешной загрузки плагин выглядит следующим образом:

source: Test directory
ru_ru: Тестовый каталог

source: Plugin asks you to provide a directory which will be your workspace only for this plugin. To select directory, as soon as you add `/` to the path, it shows the possible options.
ru_ru: Плагин просит Вас указать директорию, которая будет Вашей рабочей областью только для этого плагина. Для выбора директории, как только Вы добавляете `/` к пути, он показывает возможные варианты.

source: Once selected, this directory will be used to load test files and to store newly generated test files.
ru_ru: После выбора эта директория будет использоваться для загрузки тестовых файлов и для хранения вновь созданных тестовых файлов.

source: Default test directory is `browser/tests`.
ru_ru: Каталог тестов по умолчанию - `browser/tests`.

source: Generate
ru_ru: Создайте

source: Select a solidity file which you want to test and click on the button `Generate`. It will generate a test file dedicated to selected file **in the test directory**.
ru_ru: Выберите файл solidity, который Вы хотите протестировать, и щелкните на кнопке `Generate`. Будет сгенерирован тестовый файл, соответствующий выбранному файлу **в директории test**.

source: If no file is selected, it will still create a file with generic name as `newFile_test.sol`.
ru_ru: Если файл не выбран, то все равно будет создан файл с общим именем `newFile_test.sol`.

source: This file contains sufficient information to give better understanding about developing tests for a contract.
ru_ru: Этот файл содержит достаточно информации, чтобы дать лучшее понимание о разработке тестов для контракта.

source: Generic file looks as:
ru_ru: Общий файл выглядит как:

source: Write Tests
ru_ru: Напишите тесты

source: Write sufficient unit tests to ensure that your contract works as expected under different scenarios.
ru_ru: Напишите достаточное количество модульных тестов, чтобы убедиться, что Ваш контракт работает так, как ожидается при различных сценариях.

source: Remix injects a built-in `assert` library which can be used for testing. You can visit the library documentation [here](./assert_library).
ru_ru: В Remix встроена библиотека `assert`, которую можно использовать для тестирования. Вы можете посетить документацию по библиотеке [here](./assert_library).

source: Apart from this, Remix allows usage of some special functions in the test file to make testing more structural. They are as:
ru_ru: Кроме того, Remix позволяет использовать некоторые специальные функции в тестовом файле, чтобы сделать тестирование более структурным. К ним относятся:

source: `beforeEach()` - Runs before each test
ru_ru: `beforeEach()` - Выполняется перед каждым тестом.

source: `beforeAll()` - Runs before all tests
ru_ru: `beforeAll()` - Выполняется перед всеми тестами

source: `afterEach()` - Runs after each test
ru_ru: `afterEach()` - Выполняется после каждого теста

source: `afterAll()` - Runs after all tests
ru_ru: `afterAll()` - Выполняется после всех тестов

source: To get started, see [this simple example](./unittesting_examples.html#simple-example).
ru_ru: Чтобы начать, посмотрите [этот простой пример](./unittesting_examples.html#simple-example).

source: Run
ru_ru: Выполните

source: Once you are done with writing tests, select the file(s) and click on `Run` to execute the tests. The execution will run in a separate environment. After completing the execution of one file, a test summary will be shown as below:
ru_ru: После того, как Вы закончили писать тесты, выберите файл(ы) и нажмите `Run` для выполнения тестов. Выполнение будет происходить в отдельном окружении. После завершения выполнения одного файла будет показана сводка тестов, как показано ниже:

source: For failed tests, there will be more assertion details to analyze the issue. Clicking on failed test will highlight the relevant line of code in the editor.
ru_ru: Для неудачных тестов будет представлено больше деталей утверждения для анализа проблемы. Щелчок на неудачном тесте выделит соответствующую строку кода в редакторе.

source: If you have selected multiple files to run the tests and want to stop the execution, click on `Stop` button. It will stop execution after running the tests for current file.
ru_ru: Если Вы выбрали несколько файлов для выполнения тестов и хотите остановить выполнение, щелкните на кнопке `Stop`. Это остановит выполнение после выполнения тестов для текущего файла.

source: Customization
ru_ru: Персонализация

source: Remix facilitates users with various types of customizations to test a contract properly.
ru_ru: Remix предоставляет пользователям различные виды настроек для правильного тестирования контракта.

source: **1. Custom Compiler Context**
ru_ru: **1. Пользовательский контекст компилятора**

source: `Solidity Unit Testing` refers to the `Solidity Compiler` plugin for compiler configurations. Configure `Compiler`, `EVM Version`, `Enable Optimization` & `runs` in the `Solidity Compiler` plugin and this will be used in the `Solidity Unit Testing` plugin for contract compilation before running unit tests.
ru_ru: `Solidity Unit Testing` ссылается на плагин `Solidity Compiler` для конфигураций компилятора. Настройте `Compiler`, `EVM Version`, `Enable Optimization` и `runs` в плагине `Solidity Compiler`, и это будет использовано в плагине `Solidity Unit Testing` для компиляции контрактов перед запуском модульных тестов.

source: **2. Custom Transaction Context**
ru_ru: **2. Контекст пользовательских транзакций**.

source: For interacting with a contract's method, the prime parameters of a transaction are `from` address, `value` & `gas`. Typically, a method's behaviour is tested with different values of these parameters.
ru_ru: Для взаимодействия с методом контракта основными параметрами транзакции являются адрес `from`, `value` и `gas`. Обычно поведение метода тестируется при различных значениях этих параметров.

source: One can input custom values for `msg.sender` & `msg.value` of transaction using NatSpec comments, like:
ru_ru: Можно ввести пользовательские значения для `msg.sender` и `msg.value` транзакции, используя комментарии NatSpec, например:

source: <b>Instructions to use:</b>
ru_ru: <b>Инструкция по применению:</b>

source: Parameters must be defined in the method's NatSpec
ru_ru: Параметры должны быть определены в NatSpec метода.

source: Each parameter key should be prefixed with a hash (**#**) and end with a colon following a space (**:&nbsp;**) like `#sender: ` & `#value: `
ru_ru: Каждый ключ параметра должен иметь префикс в виде хэша (**#**) и заканчиваться двоеточием, следующим за пробелом (**:&nbsp;**), например, `#sender: ` & `#value: `.

source: For now, customization is only available for parameters `sender` & `value`
ru_ru: На данный момент настройка доступна только для параметров `sender` и `value`.

source: Sender is the `from` address of a transaction which is accessed using `msg.sender` inside a contract method. It should be defined in a fixed format as '**account-**<account_index>'
ru_ru: Отправитель - это `from` адрес транзакции, доступ к которому осуществляется с помощью `msg.sender` внутри метода контракта. Он должен быть определен в фиксированном формате как '**account-**<account_index>'.

source: `<account_index>` varies from `0-2` before remix-ide release v0.10.0 and `0-9` afterwards
ru_ru: `<account_index>` варьируется от `0-2` до выхода remix-ide v0.10.0 и `0-9` после.

source: `remix_accounts.sol` must be imported in your test file to use custom `sender`
ru_ru: `remix_accounts.sol` должен быть импортирован в Ваш тестовый файл, чтобы использовать пользовательский `sender`.

source: Value is `value` sent along with a transaction in `wei` which is accessed using `msg.value` inside a contract method. It should be a number.
ru_ru: Значение - это `значение`, отправленное вместе с транзакцией в `wei`, доступ к которому осуществляется с помощью `msg.value` внутри метода контракта. Это должно быть число.

source: Regarding `gas`, Remix estimates the required gas for each transaction internally. Still if a contract deployment fails with `Out-of-Gas` error, it tries to redeploy it by doubling the gas. Deployment failing with double gas will show error: ```contract deployment failed after trying twice: The contract code couldn't be stored, please check your gas limit```
ru_ru: Что касается `газа`, то Ремикс внутренне оценивает необходимый газ для каждой транзакции. Тем не менее, если развертывание контракта завершилось неудачей с ошибкой `Out-of-Gas`, он пытается развернуть его заново, удвоив количество газа. При неудачном развертывании с удвоенным количеством газа будет показана ошибка: ``Развертывание контракта не удалось после двойной попытки: код контракта не удалось сохранить, пожалуйста, проверьте лимит газа``.

source: Various test examples can be seen in [examples](./unittesting_examples) section.
ru_ru: Различные примеры тестирования можно посмотреть в разделе [examples](./unittesting_examples).

source: Points to remember
ru_ru: Что следует помнить

source: A test contract cannot have a method with parameters. Having one such method will show error: `Method 'methodname' can not have parameters inside a test contract`
ru_ru: Тестовый контракт не может иметь метод с параметрами. Наличие одного такого метода приведет к ошибке: `Метод 'methodname' не может иметь параметров внутри тестового контракта`.

source: Number of test accounts are `3` before remix-ide release v0.10.0 and `10` afterwards
ru_ru: Количество тестовых учетных записей составляет `3` до выхода remix-ide v0.10.0 и `10` после

source: While a test file which imports `remix_accounts.sol` might not compile successfully with `Solidity Compiler` plugin, do not worry, this will have no bearing on its success with `Solidity Unit Testing` plugin.
ru_ru: Хотя тестовый файл, импортирующий `remix_accounts.sol`, может не скомпилироваться с помощью плагина `Solidity Compiler`, не волнуйтесь, это никак не повлияет на его успешную работу с плагином `Solidity Unit Testing`.
