Repository: Adel1364r/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/unittestingAsCLI.po
Languages: ru_ru

source: Command Line Interface
ru_ru: Интерфейс командной строки

source: `remix-tests` is a tool which can be used as a CLI (Command Line Interface) solution to run the solidity unit tests. This is the same tool which works as a library underneath Remix's `Solidity Unit Testing` plugin. It is available on NPM as `@remix-project/remix-tests`.
ru_ru: `remix-tests` - это инструмент, который можно использовать в качестве CLI (интерфейса командной строки) для запуска модульных тестов Solidity. Это тот же самый инструмент, который работает как библиотека под плагином `Solidity Unit Testing` в Remix. Он доступен на NPM под именем `@remix-project/remix-tests`.

source: Get started
ru_ru: Приступить к работе

source: You can install it using NPM:
ru_ru: Вы можете установить его с помощью NPM:

source: As a dev dependency:
ru_ru: Как зависимость от разработчика:

source: As a global NPM module:
ru_ru: Как глобальный модуль NPM:

source: To confirm installation, run:
ru_ru: Чтобы подтвердить установку, выполните:

source: Version should be same as on NPM.
ru_ru: Версия должна быть такой же, как и в NPM.

source: How to use
ru_ru: Как использовать

source: You can see all available options using `help` command.
ru_ru: Вы можете посмотреть все доступные опции, используя команду `help`.

source: General structure of a command is as:
ru_ru: Общая структура команды выглядит следующим образом:

source: To run all test files inside `examples` directory
ru_ru: Чтобы запустить все тестовые файлы, находящиеся в директории `examples`

source: To run single test file named `simple_storage_test.sol` inside `examples` directory
ru_ru: Для запуска одного тестового файла с именем `simple_storage_test.sol` внутри директории `examples`.

source: **NOTE:** `remix-tests` will assume that name of test(s) file ends with `"_test.sol"`. e.g `simple_storage_test.sol`
ru_ru: **ПРИМЕЧАНИЕ:** `remix-tests` будет считать, что имя файла теста(ов) заканчивается на `"_test.sol"`. например, `simple_storage_test.sol`.

source: Example
ru_ru: Пример

source: Consider for a simple storage contract named `simple_storage.sol`:
ru_ru: Рассмотрим для простого контракта хранения с именем `simple_storage.sol`:

source: Test file `simple_storage_test.sol` can be as:
ru_ru: Тестовый файл `simple_storage_test.sol` может быть в виде:

source: Running `simple_storage_test.sol` file will output as:
ru_ru: Запуск файла `simple_storage_test.sol` приведет к результату:

source: Custom compiler context
ru_ru: Пользовательский контекст компилятора

source: Most of the `remix-tests` options are there to define a custom compiler context. With an extended custom compiler context, execution of above test file will go as:
ru_ru: Большинство опций `remix-tests` предназначены для определения пользовательского контекста компилятора. С расширенным пользовательским контекстом компилятора выполнение приведенного выше тестового файла будет происходить следующим образом:

source: Rememeber, custom compiler version will require internet connection to load compiler.
ru_ru: Помните, что пользовательская версия компилятора потребует подключения к Интернету для загрузки компилятора.

source: As a CI solution
ru_ru: В качестве решения CI

source: `remix-tests` can also be used for continuous integration (CI) testing.
ru_ru: `remix-tests` можно также использовать для тестирования в режиме непрерывной интеграции (CI).

source: For implementation example, see [Su Squares contract](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) and [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067) that uses `remix-tests` for continuous integration.
ru_ru: Пример реализации см. в [Su Squares contract](https://github.com/su-squares/ethereum-contract/tree/e542f37d4f8f6c7b07d90a6554424268384a4186) и [Travis build](https://travis-ci.org/su-squares/ethereum-contract/builds/446186067), где используется `remix-tests` для непрерывной интеграции.
